{"0":{"tilte":"Huawei plans 5G unit in France\n","link":"https:\/\/www.dawn.com\/news\/1537113\/huawei-plans-5g-unit-in-france","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e58977c4d573.jpg","discription":"PARIS: Huawei will build its first European manufacturing plant in France, the chairman said on Thursday, as the Chinese telecom giant seeks to ease worldwide concerns stoked by US charges that Beijing could use its equipment for spying.Liang Hua said Huawei, the world’s biggest producer of telecoms equipment, would invest 200 million euros ($217m) in the first phase of setting up the mobile base station plant. He said it would create 500 jobs.Huawei, which denies its equipment poses a security risk, is at the centre of a storm pitting the United States against China over 5G, the next generation mobile technology. Europe has become a major battleground.“This site will supply the entire European market, not just France’s,” Liang told a news conference.  “Our group’s activities are worldwide and for this we need a global industrial footprint.” 5G technology is expected to deliver a huge leap in the speed and capacity of communications and an exponential spike in connections between the billions of devices, from smart fridges to driverless cars, that are expected to run on 5G networks.Published in Dawn, February 28th, 2020"},"1":{"tilte":"GNI identifies risks to privacy, freedom of expression in social media rules\n","link":"https:\/\/www.dawn.com\/news\/1537098\/gni-identifies-risks-to-privacy-freedom-of-expression-in-social-media-rules","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e588e138349e.jpg","discription":"KARACHI: Concerned about the broad scope of the Citizens Protection (Against Online Harm) Rules 2020, approved by the Pakistan government, the Global Network Initiative (GNI) has identified aspects of the rules that create significant risks to privacy and freedom of expression. The GNI is a multi-stakeholder organisation composed of leading information and communication technology (ICT) companies (like Google, Microsoft, Telenor), academics, digital rights and media freedom groups that work to protect freedom of expression and privacy rights in the ICT sector. In its statement on Wednesday, the GNI welcomed the government’s decision to hold “extensive and broad-based consultations” on the rules. “GNI and its members stand ready to engage thoughtfully and respectfully with the government of Pakistan and any other government that is considering how best to address content regulation,” said GNI executive director Judith Lichtenberg. The rules would require social media platforms to comply with censorship orders made without judicial review and facilitate access to the ICT user data endangering privacy. The broad and unspecified nature of these authorities and requirements pose real risks to the digital rights of Pakistani citizens, the GNI said. Welcomes govt decision to hold broad-based consultation“The Rules Against Online Harm, as currently drafted, raise more questions than they answer. We encourage the government to work with interested stakeholders to ensure proper identification of problems and corresponding solutions,” said Mark Stephens, GNI board independent chair. The rules, the GNI said, raised significant concerns both locally and globally, among internet companies, civil society, and the general public, due to complete absence of consultation with stakeholders and the sweeping scope of the regulations. “We welcome the decision by the government to hold an ‘extensive and broad based consultation’ process with all relevant segments of civil society and technology companies about [the rules],” it stated. The GNI expressed confidence that an open, considered approach to any concerns regarding illegal content online would yield more legally-sound results, which empower and protect Pakistani citizens and complement the government’s vision of a ‘Digital Pakistan’. It pointed out that the rules appeared to have been passed quic­kly and without consultation with stakeholders, calling into question their legitimacy and legality under international human rights law. By establishing broad and unchecked powers to censor a wide range of — and in some instances vaguely defined — categories of content, it said, the rules were also difficult to reconcile with the principles of necessity and proportionality. Call to revoke rulesThe GNI called on the government to pull back the rules and engage in a broad, transparent consultation with legislators, civil society, social media companies and other relevant stakeholders. The GNI said the rules challenged the ability of companies to provide encryption for their products and services, raising cybersecurity concerns. In addition, the rules seemed to grant powers that might be greater than the authorising legislation they purport to implement.  It would enhance the government’s authority to demand user data in a non-judicially-supervised manner, raising privacy concerns as well, it added. PTA to lead consultationEarlier this week, the government in a press release had said the Pakistan Telecommunication Autho­rity (PTA) would lead the consultation with relevant stakeholders.  “In concert with other stakeholders, the PTA will be undertaking extensive, broad-based consultation process with all relevant segments of civil society and technology companies about Citizens Protection (Against Online Harm) Rules,” it said.  The statement neither clarified whether the existing rules would be revoked nor did it specify a time period for the revision plan. The memo document of the rules, labelled ‘to be published in the official gazette’, has already been uploaded on the Ministry of Information Technology and Telecommunication (MoITT) website.Published in Dawn, February 28th, 2020"},"2":{"tilte":"Internet giants fight spread of coronavirus untruths\n","link":"https:\/\/www.dawn.com\/news\/1536767\/internet-giants-fight-spread-of-coronavirus-untruths","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e5609a59c763.jpg","discription":"As the new coronavirus spreads globally, the online battle to keep misinformation about the disease is also stepping up.Google, Facebook and other platforms are struggling to keep ahead of scammers, trolls, and others with ill intent who routinely use major tragedies or disasters as opportunities to swindle or manipulate people.\"The public concern about coronavirus is being used as a vehicle to get people to transmit misinformation and disinformation,\" said University of Washington biology professor Carl Bergstrom.Internet companies took part in a meeting with the World Health Organization last week at Facebook offices in Silicon Valley to discuss tactics such as promoting reliable information and fact-checking dubious claims about the coronavirus referred to as COVID-19.\"(We must) combat the spread of rumors and misinformation,\" WHO Director General Tedros Adhanom Ghebreyesus told AFP recently.\"To that end, we have worked with Google to make sure people searching for information about coronavirus see WHO information at the top of their search results.\"Google search ranks authoritative sources higher when people are seeking information on health and labels results or news stories that have been fact-checked.Ghebreyesus said that social media platforms including Twitter, Facebook, Tencent and TikTok have also taken steps to limit spread of misinformation about coronavirus.Facebook said in a recent online post that it is focusing on claims which, if relied on, could increase the likelihood of someone getting sick or not getting proper treatment.\"This includes claims related to false cures or prevention methods — like drinking bleach cures the coronavirus - or claims that create confusion about health resources that are available,\" Facebook head of health Kang-Xing Jin said in the post.\"We will also block or restrict hashtags used to spread misinformation on Instagram, and are conducting proactive sweeps to find and remove as much of this content as we can.\"Bergstrom said some virus misinformation is \"people trying to sell snake oil products\" such as bogus cures or treatments, while others use attention-grabbing deceptions to drive online traffic that yields money from advertising.Misinformation is also spread by \"actors\" out to fuel distrust for the establishment in China or foment societal instability overall, according to Bergstrom.\"There's appetite for up-to-date, real-time information,\" said Jevin West, co-author of a book on misinformation with Bergstrom.\"These actors can take advantage of that; things with crazier scenarios are more likely to be clicked on than the report from that doctor at WHO trying to calm down the fears.\"Facebook said that when users seek information related to the virus, the social network will show \"educational pop-up\" boxes with information considered credible.Facebook is also giving free advertising credits to organisations running coronavirus education campaigns.Google-owned video sharing platform YouTube has been modifying policies and products for several years to remove harmful content and give priority to authoritative content deemed trustworthy.\"We currently do not allow content promoting dangerous remedies or cures, like videos which claim that harmful substances or treatments can have health benefits,\" YouTube said.YouTube last year began providing links to reliable information along with videos on \"subjects prone to misinformation,\" and added coronavirus to that list.Social media giants have also beefed up ranks of fact-checkers, hiring outside parties such as AFP News Wire, to sort truth from fiction, even if there are questions on their effectiveness.A recent study published in the journal Science Advances suggested fact-checking did little to stem the tide of misinformation about other epidemics such as Zika, Ebola and yellow fever.The researchers said that \"current approaches to combating misinformation and conspiracy theories about disease epidemics and outbreaks may be ineffective or even counterproductive,\" and could even cause \"collateral\" damage by undermining trust in fact-based disease information.Bergstrom and West questioned whether social media giants optimized for virality could stem the tide of disinformation and deceit.\"Social media company claiming it's active participant in the fight against misinformation is like (tobacco maker) Philip Morris saying they're active participant in the fight against lung cancer,\" Bergstrom said."},"3":{"tilte":"Apple loses patent fight in US top court\n","link":"https:\/\/www.dawn.com\/news\/1536490\/apple-loses-patent-fight-in-us-top-court","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e549a731d185.jpg","discription":"WASHINGTON: The US Supreme Court on Monday refused to hear Apple Inc’s bid to avoid paying about $440 million in damages for using patent licensing firm VirnetX Inc’s internet security technology without permission in features such as FaceTime video calling.The justices rejected Apple’s appeal in the long-running case in which a federal jury in 2016 found that Apple had infringed VirnetX’s patents and awarded $302m. A judge later increased that amount to $439.7m including interest and other costs.The case dates back to 2010 when Nevada-based VirnetX filed suit in federal court in the Eastern District of Texas accusing Cupertino, California-based Apple of infringing four patents for secure networks, known as virtual private networks, and secure communications links. VirnetX said Apple infringed with its FaceTime and VPN on Demand features in products such as the iPhone and iPad.The US Court of Appeals for the Federal Circuit in Washington, which specialises in patent disputes, upheld the judgment against Apple last year.During the litigation, Apple and other companies requested that a tribunal of the US Patent and Trademark Office review the validity of the VirnetX patents. The tribunal canceled key parts of the patents at issue in the case.But in separate decisions also issued last year, the Federal Circuit set aside certain of the tribunal’s rulings, bringing VirnetX closer to collecting damages from Apple. Apple appealed to the Supreme Court, contending that the damages should be recalculated because the specific patents VirnetX accused it of infringing with FaceTime were nearly wiped out.Apple in a court filing called the Federal Circuit’s refusal to entertain its demands “legally wrong and grossly unfair.” The company also said the lower courts impermissibly allowed VirnetX to request damages far beyond the value of the patented invention.VirnetX told the justices: “The entire damages award ... remains supported by claims that a jury — and the Federal Circuit - found valid years ago and that have not been canceled since.”Published in Dawn, February 25th, 2020"},"4":{"tilte":"LHC takes up social media rules case tomorrow\n","link":"https:\/\/www.dawn.com\/news\/1536138\/lhc-takes-up-social-media-rules-case-tomorrow","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e5202af5d5f1.jpg","discription":"LAHORE: Lahore High Court Chief Justice Mamoon Rashid Sheikh will hear on Monday an application assailing the legitimacy of new social media regulations published by Ministry of Information, Technology and Telecommunication (MoITT).“The regulations prima facie appear to be illegal and ultra vires for contravening and exceeding the scope of Pakistan Telecommunication Reorganization Act, 1996 and the Prevention of Electronic Crime Act, 2016 (Peca) and [in] violation of fundamental constitutional rights,” argued the application moved by digital rights activist Ms Jannat Ali. Through her counsel Usama Khawar Ghumman, the applicant pleaded that the Peca, the parent law, conferred limited powers to “remove or block or issue directions for removal or blocking of access to information through any information system.She said the parent law did not give the Pakistan Telecommunication Authority (PTA) the power to sub-delegate any of its powers, including the delegation of rules to National Coordinator – a person appointed by the federal government.The applicant further contended that the federal government had very limited rule-making powers under the sections of the Peca and the PTA Act.“Neither these sections confer powers upon the federal government to frame rules that can empower its delegated functionaries to frame rules having the effect of law, nor the power to delegate is to be read as a part of the power to frame rules,” she said, adding the constitutional courts of the country also did not allow such excessive delegation and already declared such practices to be an exercise in excessive delegation liable to be struck down.She pleaded that the sub-statutory rules could not impose or create new restrictions beyond the scope of the parent law. However, she said, the impugned “Online Harm Rules” introduced a new extremely broad and vague definition of “extremism” with penal consequences infringing upon the fundamental rights of citizens.Ms Ali pointed out that the remedy for review and appeal provided under the impugned regulations was very limited and narrow. She said a high court, under the regulations, while hearing an appeal would be limited to adjudication upon grounds of the review, and not the entirety of the record.This limitation, she believed, had the effect of not providing a right of appeal to citizens whose fundamental rights, including freedom of expression, right to access to information, right to dignity and privacy, would have been infringed upon. She said this limitation would also be a blatant violation of the citizens’ rights to fair trial and access to justice.Through the application, the activist also sought the court’s permission to become a party to a pending petition in favour of the impugned regulations and urged the court to dismiss the same.Published in Dawn, February 23rd, 2020"},"5":{"tilte":"Govt remains befuddled over how to deal with online harm\n","link":"https:\/\/www.dawn.com\/news\/1535943\/govt-remains-befuddled-over-how-to-deal-with-online-harm","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e50a0a558f2b.jpg","discription":"It has been four years since the draconian Prevention of Electronic Crimes Act (Peca) was passed, but confusion still reigns in the country over how to deal with harmful content on social media. On Feb 15, the Asia Internet Coalition (AIC) — a group of internet companies, including giants such as Facebook, Twitter and Google — wrote a letter to Prime Minister Imran Khan, warning him that new rules to regulate social media activity would make it “extremely difficult” for digital companies to operate in Pakistan. Amid criticism, Prime Minister Khan said “all stakeholders” would be taken on board before implementing the new rules. Without delving into details of the process, he hoped that all internet companies would continue to work in Pakistan and that the government would address their grievances. Uncertainty persists because some officials maintain the new rules were “approved” by the federal cabinet on Jan 28, but not notified. Sources said the rules were not being implemented right now and the upcoming consultation would be focused on overall content management and ways to generate revenue. According to PM’s Focal Person on Digital Media Arslan Khalid, a working document on the consultation will be drafted by the Pakistan Telecommunication Authority (PTA) and will be made available to the public soon. The PTA says modalities regarding the process will be shared once finalised. Mr Khalid said the stakeholders, including technology firms, civil society activists, parliamentarians, lawyers and media persons, would be consulted on regulating content relating to blasphemy, child pornography, extremism, hate speech, character assassination and fake news. Under the new rules, the internet firms are required to establish permanent offices in the federal capital. About the government’s move, Science and Technology Minister Fawad Chaudhry said that “it is an economic decision which will increase advertising revenue”. However, in a recent interview with Dawn, head of the PM’s Digital Pakistan initiative Tania Aidrus said the country was not ready to invite global platforms. “Global firms, including Facebook and Google, have a defined mechanism that decides requirements to enter a country. They are incredibly cautious as they should be,” she had said, adding that the aim was to offer “comfort, legal framework, security and policy before expecting these companies to work in Pakistan”. A glance at the digital landscape reflects the same. Just over a third of Pakistan’s population or around 76 million people are online in 2020 (17pc growth from 2019). Of the total internet users, only 37m are active social media users. According to the 2020 digital report by We Are Social and Hootsuite, out of the total users the number of people who can be reached with advertising on Facebook is 33m, 6.4m for Instagram and 1.83m for Twitter. If the government is serious about attracting investment, it should demonstrate commitment towards improving the investment climate, which includes financial inclusion, supporting physical and regulatory infrastructure, lowering cost of starting a business, trading across borders, fast tracking of business transactions and resolving commercial disputes. Although Pakistan has improved its global ease of doing business ranking to 108 for 2020, it is still behind other emerging markets. Pakistan’s investment level for instance is almost half the volume attracted by growing economies like Vietnam, India, Bangladesh and Sri Lanka. There are 17pc Pakistanis who have accounts with financial institutions (but only 1pc of the citizens have credit cards) as opposed to 80pc financial inclusion in India and 41pc in Bangladesh. Pakistan spent $856m on digital advertising in 2019 as compared to India’s $6.62bn, according to the digital report. Besides, there is already an ongoing global movement to tax tech giants that supply services over internet to their citizens. A framework, released by the Organisation for Economic Cooperation and Development (OECD), would allow countries to tax large multinationals even if they did not operate inside their borders. Under the negotiations, involving over 135 countries, including Pakistan, companies will pay taxes — largely based on where their sales occur. The OECD hopes to reach a consensus-based solution with all member countries by the end of this year. Objectionable contentUnder various provisions of Peca, the “priority” categories highlighted by the government (with the exception of fake news) are deemed unlawful. In fact, the PTA has reported content to social media companies under those provisions that are related to blasphemy, sectarianism, hate speech, anti-state activity, defamation and impersonation. The government’s concern is that platforms are mostly entertaining the requests in accordance with their own community guidelines — although those guidelines overlap with most specified categories such as child pornography and extremism. Take Facebook’s example. According to the PTA, the authority has reported a total of 14,296 URLs to Facebook, out of which the platform has removed 12,226 (6,535 for violation of its own community standards).The problem, according to PTA, lies with regulating defamatory and blasphemous content that is reported in high volumes by both the public and over 30 stakeholders that can report content for removal\/blocking. “Through the e-portal, the Ministry of Religious Affairs alone has so far reported 24,725 links containing blasphemous, pornographic and sectarian material,” the PTA told Dawn. Another popular concern is protecting women, children and minorities online. For authorities investigating and pursuing these cases offline, the reality is different. According to digital rights advocacy group Bolo Bhi’s data, as of Aug 2019, 54 cases under Peca were pending in Karachi. These cases include charges under Section 21 (offences against modesty of a natural person and minority) and Section 20 (offences against dignity of a natural person). In terms of breakdown, seven accused in the cases are in jail custody, 34 are on bail, eight accused have been acquitted while there has been only one conviction. In two cases, the accused have absconded. The new rules are meant to streamline online regulation not amplify it. Unless the government is headed on the same path as its predecessor that approved Peca, the consultation is a chance to set things right.Published in Dawn, February 22nd, 2020"},"6":{"tilte":"Journalists, lawyers, rights bodies to resist move against social media\n","link":"https:\/\/www.dawn.com\/news\/1535722\/journalists-lawyers-rights-bodies-to-resist-move-against-social-media","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e4f52e9df492.jpg","discription":"ISLAMABAD: As the clamour against the government’s move to regulate social media becomes louder, the Pakistan Federal Union of Journalists (PFUJ), lawyers and civil society members have decided to launch a nationwide movement for getting the Citizens Protection (Against Online Harm) Rules revoked.Journalist unions, lawyers, and civil society organisations termed the recently notified rules unacceptable and urged the government to revoke these immediately and hold consultations over the regulation.The demands were put forward at a press conference at National Press Club here on Thursday.Representatives from the Human Rights Commission of Pakistan, the Islamabad High Court Bar Association and Media Matters for Democracy atte­nded the press conference.Nasir Zaidi, PFUJ’s secretary general, read out a joint statement contending that the rules exceeded the mandate given by the 2016 Prevention of Electronic Crimes Act.“The rules [to regulate social media] were approved by the cabinet without any debate,” Mr Zaidi said. “The clampdown on online content is the final extreme in a long series of restrictions on freedom of expression and press freedom in Pakistan.”He outlined a “plan of action” thrashed out by the PFUJ, in concert with the three “partner organisations”, to launch a countrywide drive against enforcement of the rules.“Press conferences will be held at press clubs in Karachi, Lahore, Peshawar and Quetta,” Mr Zaidi said. A national conference will be held at Islamabad’s press club on Feb 27 to work out a joint declaration on social media regulation.Speakers at the press conference said the proposed social media rules posed a severe threat to freedom of expression, media independence, and the country’s digital economy.Harris Khalique, the HRCP secretary general, said the rules framed by the federal cabinet were based on “malicious intent”.The speakers said rights guaranteed by the Constit­ution should form the basis for any law regarding social media.The Asia Internet Coalition, whose members include Facebook, Google and Twitter, has said the rules can “severely cripple” Pakistan’s digital economy and make it difficult for internet companies to offer their services to Pakistanis.The Committee to Protect Journalists and Reporters without Borders have also condemned the rules.A number of senior journalists, including M. Ziauddin and Hamid Mir, spoke on the occasion.Sadaf Khan, co-founder of Media Matters For Dem­ocracy, said claims being spread by official quarters that internet was unregulated in this country were incorrect.At the same time, the speakers welcomed a statement by the prime minister that the government would hold consultations with all stakeholders before enforcing the rules, but insisted that the proposed rules be de-notified.Published in Dawn, February 21st, 2020"},"7":{"tilte":"BJP shared deepfake video during Delhi elections: report\n","link":"https:\/\/www.dawn.com\/news\/1535619\/bjp-shared-deepfake-video-during-delhi-elections-report","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e4e9caec9408.jpg","discription":"One of the videos of Bharat Janatya Party (BJP) leader Manoj Tiwari that went viral earlier this month during the Delhi elections is deepfake, reported online publication Vice.Deepfake videos use a form of artificial intelligence called deep learning to create fake images of people and events. One of the videos had Tiwari speaking in English while the other one showed him using the same facial expressions and gestures but speaking in Haryanvi. An analysis of the two 44-second videos by Vice on Tuesday showed that the Haryanvi video is fake. Neelkant Bakshi, co-incharge of social media and IT for BJP Delhi, told Vice that the BJP IT cell had partnered with Chandigarh-based political communications firm The Ideaz Factory to create \"positive campaigns using deepfakes to reach different linguistic voter bases. \"The Haryanvi videos let us convincingly approach the target audience even if the candidate didn’t speak the language of the voter.\"The Haryanvi video was aimed primarily at Haryanvi-speaking migrant workers in Delhi to dissuade them from voting for Arvind Kejriwal's Aam Aadmi Party (AAP), according to Vice. Bakshi added that the videos were distributed across 5,800 WhatsApp groups in Delhi and the National Capital Region, reaching approximately 15 million people.However, the efforts were not successful as Kejriwal's AAP won 62 out of 70 seats in the legislative elections held in Delhi on February 8."},"8":{"tilte":"Internet giants fight spread of coronavirus untruths\n","link":"https:\/\/www.dawn.com\/news\/1536767\/internet-giants-fight-spread-of-coronavirus-untruths","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e5609a59c763.jpg","discription":"As the new coronavirus spreads globally, the online battle to keep misinformation about the disease is also stepping up.Google, Facebook and other platforms are struggling to keep ahead of scammers, trolls, and others with ill intent who routinely use major tragedies or disasters as opportunities to swindle or manipulate people.\"The public concern about coronavirus is being used as a vehicle to get people to transmit misinformation and disinformation,\" said University of Washington biology professor Carl Bergstrom.Internet companies took part in a meeting with the World Health Organization last week at Facebook offices in Silicon Valley to discuss tactics such as promoting reliable information and fact-checking dubious claims about the coronavirus referred to as COVID-19.\"(We must) combat the spread of rumors and misinformation,\" WHO Director General Tedros Adhanom Ghebreyesus told AFP recently.\"To that end, we have worked with Google to make sure people searching for information about coronavirus see WHO information at the top of their search results.\"Google search ranks authoritative sources higher when people are seeking information on health and labels results or news stories that have been fact-checked.Ghebreyesus said that social media platforms including Twitter, Facebook, Tencent and TikTok have also taken steps to limit spread of misinformation about coronavirus.Facebook said in a recent online post that it is focusing on claims which, if relied on, could increase the likelihood of someone getting sick or not getting proper treatment.\"This includes claims related to false cures or prevention methods — like drinking bleach cures the coronavirus - or claims that create confusion about health resources that are available,\" Facebook head of health Kang-Xing Jin said in the post.\"We will also block or restrict hashtags used to spread misinformation on Instagram, and are conducting proactive sweeps to find and remove as much of this content as we can.\"Bergstrom said some virus misinformation is \"people trying to sell snake oil products\" such as bogus cures or treatments, while others use attention-grabbing deceptions to drive online traffic that yields money from advertising.Misinformation is also spread by \"actors\" out to fuel distrust for the establishment in China or foment societal instability overall, according to Bergstrom.\"There's appetite for up-to-date, real-time information,\" said Jevin West, co-author of a book on misinformation with Bergstrom.\"These actors can take advantage of that; things with crazier scenarios are more likely to be clicked on than the report from that doctor at WHO trying to calm down the fears.\"Facebook said that when users seek information related to the virus, the social network will show \"educational pop-up\" boxes with information considered credible.Facebook is also giving free advertising credits to organisations running coronavirus education campaigns.Google-owned video sharing platform YouTube has been modifying policies and products for several years to remove harmful content and give priority to authoritative content deemed trustworthy.\"We currently do not allow content promoting dangerous remedies or cures, like videos which claim that harmful substances or treatments can have health benefits,\" YouTube said.YouTube last year began providing links to reliable information along with videos on \"subjects prone to misinformation,\" and added coronavirus to that list.Social media giants have also beefed up ranks of fact-checkers, hiring outside parties such as AFP News Wire, to sort truth from fiction, even if there are questions on their effectiveness.A recent study published in the journal Science Advances suggested fact-checking did little to stem the tide of misinformation about other epidemics such as Zika, Ebola and yellow fever.The researchers said that \"current approaches to combating misinformation and conspiracy theories about disease epidemics and outbreaks may be ineffective or even counterproductive,\" and could even cause \"collateral\" damage by undermining trust in fact-based disease information.Bergstrom and West questioned whether social media giants optimized for virality could stem the tide of disinformation and deceit.\"Social media company claiming it's active participant in the fight against misinformation is like (tobacco maker) Philip Morris saying they're active participant in the fight against lung cancer,\" Bergstrom said."},"9":{"tilte":"Government will not take any step against social media users' interests, assures Awan\n","link":"https:\/\/www.dawn.com\/news\/1534245\/government-will-not-take-any-step-against-social-media-users-interests-assures-awan","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e4543b2e9f5f.png","discription":"Special Assistant to the Prime Minister on Information and Broadcasting Firdous Ashiq Awan on Thursday defended the government’s new social media policy, saying that the new rules had been created for the protection of citizens.  \"There was no mechanism that protected our citizens' interests [... or] our national integrity,\" she said, adding that after the enactment of the new policy, social media companies would be mindful of hurting Pakistan's national interests. The federal government has approved a new policy under which social media companies will be obliged to disclose any information or data to a designated investigation agency, when sought. Failure to do so would entail a fine of up to Rs500 million.Furthermore, social media platforms will be required to remove any ‘unlawful content’ pointed out to them in writing or electronically signed email within 24 hours, and in emergency cases within six hours. The companies will also have to establish registered offices with a physical address located in Islamabad within the next three months and appoint a focal person.Awan, while speaking to the media today, insisted that previously, the government \"did not know who was creating fake pages and harming socio-cultural and religious values\". The new rules, Awan said, would not only expose Pakistan's opponents but would also enable authorities to stop extremists who spread hate on the basis of religion and race. She claimed that social media was spreading disorder in society by propagating pornography, sexual abuse, child abuse, hate speech and sectarian material. \"[About] 73 per cent of Pakistanis are internet users. Social media users are increasing, especially among the youth. We will not take any step that is against the interests of these users,\" she assured. She said that because these companies have no offices or focal persons in Pakistan, whenever the government asked them to remove harmful material, the decision depended on the companies' disposition. Under the new law, the companies would have to establish their offices in the country within three months which will bring them in the ambit of the Pakistani legal system, the premier's aide explained. The social media companies will also be required to share their databank with the government as per the law.  \"The companies will have the right to challenge the authority's decision if they think it will harm their interests,\" Firdous said, adding that the forum for appeal will be the high courts. Earlier, Minister for Science and Technology Fawad Chaudhry had also denied perceptions that the new rules made to regulate social media content in the country are for political control. Speaking to the media outside Parliament House, Chaudhry explained that the new rules were made to regulate advertisements and harmful content on social media. \"The keyword here is harmful content,\" he said, adding that \"social media is used for maligning women, blasphemy and defaming people and anyone on social media knows there are groups that for Rs20,000 or 30,000 will run trends against you and defame you.\" He pointed out that digital media \"had taken the space of formal media\" and there has been an exponential increase in digital advertising. If it isn't regulated, it will further harm the already-suffering journalists and people, and cause damage to formal media, he cautioned.He said the aim is to hold social media companies answerable within the country's economic framework. "},"10":{"tilte":"Gboard introduces Roman Urdu to Urdu feature","link":"https:\/\/www.dawn.com\/news\/1351175\/gboard-introduces-roman-urdu-to-urdu-feature","img":"https:\/\/i.dawn.com\/medium\/2017\/08\/598f007e2ea6f.jpg","discription":"Google has recently launched its Roman Urdu to Urdu Google Keyboard (Gboard) feature for both Android and iOS.According to techjuice.pk's (TJ) review, Gboard’s Roman Urdu to Urdu feature is smart and accurately translates Roman Urdu text into Urdu script in real time. Gboard will also allow users to convert Roman texts to not just Urdu, but also into Sindhi, Punjabi and Kashmiri script, according to TJ.Google already had full Urdu, Kashmiri and Sindhi text scripts in Gboard options.If users do not already have the Gboard, they should go to Google Play and install Gboard, available for both Android and iOS.Once the application has been installed it will guide users to enable the keyboard and select it as their input method.Once that's done, users can move to the Gboard settings → Languages and deselect the option for ‘Use system language’.After deselecting the option, users can go through Gboard’s list of languages and select the option for Urdu (abc → اردو).Once this is done users will be able to access the feature across multiple apps including their phone’s in-built text messaging app.To change the mode of the keyboard users need to press and hold the spacebar and select Urdu (abc → اردو) on the popup, they can go back to the regular keyboard anytime."},"11":{"tilte":"Google completes first drone delivery in the US\n","link":"https:\/\/www.dawn.com\/news\/1511756\/google-completes-first-drone-delivery-in-the-us","img":"https:\/\/i.dawn.com\/medium\/2019\/10\/5dab3bf01a839.jpg","discription":"Alphabet (Google) subsidiary Wing has become the first company in the United States to deliver packages by drone.In Christiansburg, the small Virginia town chosen as Wing's test location, the 22,000 residents can order products normally shipped by FedEx, medicine from Walgreens and a selection of candy from a local business — all of which will arrive via drone.Wing, which already operates in two Australian cities as well as Helsinki, announced in a statement that the first drone-powered deliveries had taken place Friday afternoon in Christiansburg, “paving the way for the most advanced drone delivery service in the nation”. One family used the Wing app to order Tylenol, cough drops, Vitamin C tablets, bottled water and tissues, the statement said. An older resident ordered a birthday present for his wife.Although the majority of the delivery was done by a FedEx truck, the last mile was completed by drone.The yellow and white drones are loaded with packages at a local centre of operations called the “Nest,” where Wing employees pack them with up to three pounds (1.3 kilogrammes) of goods, deliverable within a six mile (10 kilometre) radius.Once they have arrived at their destination, the drones don't land. Instead, they hover above the house and lower the package with a cable.Other companies are working to launch similar services, most notably Amazon, UPS and Uber Eats. But Wing was the first to obtain a license from the Federal Aviation Administration (FAA), authorising company pilots to fly multiple drones at the same time."}}