{"0":{"tilte":"Afghanistan's partial truce will continue, 'with goal' for full ceasefire: Ghani\n","link":"https:\/\/www.dawn.com\/news\/1537622\/afghanistans-partial-truce-will-continue-with-goal-for-full-ceasefire-ghani","img":"https:\/\/i.dawn.com\/medium\/2020\/03\/5e5b7379940f7.jpg","discription":"\nAfghanistan's President Ashraf Ghani said on Sunday that a seven-day partial truce would continue but he rejected a key component of a new US-Taliban deal that calls for the release of thousands of insurgent prisoners.\nThe so-called \"reduction in violence\" period ran for the week preceding the signing of a historic accord between the US and the Taliban in Doha on Saturday.\nThe agreement spells out a withdrawal timeline of 14 months for all foreign forces, provided the Taliban honour several pledges and enter talks with Kabul for a more comprehensive peace deal.\nRead: US, Taliban clinch historic deal for Afghan peace\n“The reduction in violence will continue with a goal to reach a full ceasefire,” Ghani told a press conference.\n“General (Scott) Miller has told Taliban to do so. It is expected (to continue),” he added, referring to the US commander in charge of foreign forces in Afghanistan.\nA Taliban source did not immediately comment.\nThe partial truce saw scenes of jubilant Afghans dancing in the street as hopes rose that Afghanistan's 18-year-old war might finally come to an end.\nBut, in a sign of a bumpy road ahead, Ghani pushed back against a clause in the deal that calls for the Taliban to release up to 1,000 prisoners and for the Afghan government to release up to 5,000 insurgent captives.\n“There is no commitment to releasing 5,000 prisoners,” Ghani said.\n“This is the right and the self-will of the people of Afghanistan. It could be included in the agenda of the intra-Afghan talks, but cannot be a prerequisite for talks.” He added that any prisoner release was “not in the authority of the US, it is in the authority of the Afghan government.” \nThe president, who is mired in a political crisis following fraud allegations in his re-election, was referring to upcoming talks between the Taliban and the Afghan government that were agreed to as part of the deal.\nThe Taliban had until now refused to negotiate with Ghani's administration, which they considered a US puppet regime, but the withdrawal agreement hinges on Kabul and the insurgents reaching a separate peace deal through “intra-Afghan” negotiations.\nGhani's questioning of the prisoner release points to tough negotiations ahead in a country where leaders seem incapable of coalescing around important issues.\nWashington has pointedly not yet acknowledged Ghani's win, announced last week after months of delays while his top rival Abdullah Abdullah has vowed to set up a parallel administration.\nThe Taliban's political chief Mullah Abdul Ghani Baradar has met with senior diplomats from countries including Russia, Indonesia and Norway, hours after signing a deal with Washington aimed at ending the Afghan war, Taliban said in a statement on Sunday.\nTaliban political chief met foreign ministers from Turkey, Uzbekistan and Norway in Doha along with diplomats from Russia, Indonesia and neighbouring nations, the Taliban said, a move that signalled the group's determination to secure international legitimacy.\n“The dignitaries who met Mullah Baradar expressed their commitments towards Afghanistan's reconstruction and development [...] the US-Taliban agreement is historical,” said Taliban spokesman Zabiullah Mujahid.\n“Baradar received congratulatory messages and thanked them (ministers and diplomats) for attending the ceremony,” he said.\nThe Taliban ruled Afghanistan from 1996 to 2001 after seizing power following years of civil war, and imposed many restrictions on women and activities it deemed \"un-Islamic\". After being ousted from power in 2001, the Taliban have led a violent insurgency against the internationally-backed government, killing thousands.\nThe Afghan war has been a stalemate for over 18 years, with the Taliban increasingly controlling or contesting more territory, yet unable to capture and hold major urban centres.\nDuring the last two years of direct negotiations with the United States, the Taliban leaders opened direct channels of dialogue with Pakistan, Iran, Russia, China, Germany and Islamic nations, a move that poses a direct threat to the legitimacy of Ghani's government.\n“The fanfare around the signing ceremony proved that many countries are willing to start fresh talks with Taliban leadership [...] they are also working fast to secure the validation too,” said a senior US diplomat who was present at the signing ceremony in Doha."},"1":{"tilte":"New Malaysia PM sworn in amid crisis, Mahathir fights on\n","link":"https:\/\/www.dawn.com\/news\/1537612\/new-malaysia-pm-sworn-in-amid-crisis-mahathir-fights-on","img":"https:\/\/i.dawn.com\/medium\/2020\/03\/5e5b5ac26f1fe.jpg","discription":"\nA former interior minister was sworn in as Malaysia's premier on Sunday, marking the return of a scandal-mired party to power after a reformist government's collapse but ex-leader Mahathir Mohamad, 94, slammed the move as illegal.\nThe Southeast Asian nation was plunged into turmoil after Mahathir's reformist \"Pact of Hope\" alliance, which stormed to a historic victory in 2018, collapsed amid bitter infighting.\nMahathir — who was the world's oldest leader — initially quit as premier but then sought to return. He lost out however to little-known Muhyiddin Yassin, who heads a coalition dominated by the country's Muslim majority.\nThe king's decision on Saturday to pick Muhyiddin as premier was greeted with shock as Mahathir's allies claimed to have enough support, and sparked widespread anger that the democratically elected government had been ejected.\nJust before Muhyiddin's inauguration, Mahathir accused him of betrayal and said he would seek a parliament vote challenging the new premier's support — signalling the political crisis is far from over.\n\"This is a very strange thing [...] losers will form the government, the winners will be in the opposition,\" he said.\n\"The rule of law no longer applies.\"\nMuhyiddin's coalition includes the United Malays National Organisation (UMNO), the party of disgraced ex-leader Najib Razak, as well as a hardline group that wants tougher Islamic laws.\nUMNO was the corruption-riddled lynchpin of a coalition thrown out at the 2018 elections amid allegations Najib and his cronies looted billions of dollars from state fund 1MDB. Najib is now on trial for corruption.\nDespite a last-minute bid by Mahathir to prove that he had enough support to return as premier, Muhyiddin's inauguration went ahead Sunday morning at the national palace.\nHis alliance boycotted the ceremony.\nTo become premier, a candidate must prove to the king, who appoints the prime minister, that he has the backing of at least 112 MPs.\nMeanwhile, public anger was growing at the ejection of the reformist alliance, with the hashtag \"NotMyPM\" trending on Twitter and more than 100,000 people signing a petition that said the move was a \"betrayal\" of voters' choice at the 2018 poll.\nMahathir —  who served a first stint as premier from 1981 to 2003 before staging a comeback two years ago— also raised concerns that ongoing court cases against Najib related to the 1MDB scandal could be affected by the change of government.\nMahathir came out of retirement aged 92 to take on his one-time protege Najib over the controversy, and has pledged to bring him to justice.\nAnalysts said Muhyiddin's government was in a weak position as it was not clear whether he had a parliamentary majority, and was a member of a tiny party without a strong support base.\nHe was a senior UMNO figure for decades before being sacked from the party by Najib in 2015 after criticising the handling of the 1MDB scandal, and then allied with Mahathir to oust them at the last elections.\nIn a volte-face, he joined hands last week with UMNO in his quest for the premiership — although he is not a member.\nIn addition, he lacks \"the domestic legitimacy or the international legitimacy the previous government had\", Bridget Welsh, an analyst from the University of Nottingham, told AFP.\nHe is a Muslim nationalist — he once controversially described himself as \"Malay first\" and Malaysian second — and there are concerns his leadership could worsen already tense race and religious relations in the multi-ethnic country.\nAbout 60 per cent of Malaysia's population are ethnic Malay Muslims and the country is also home to substantial ethnic Chinese and ethnic Indian minorities.\nThe political crisis began a week ago when a group of ruling coalition lawmakers joined forces with opposition parties in a bid to form a new government and push out Mahathir's designated successor Anwar Ibrahim.\nIn a week of fast-moving twists and turns, Mahathir and Anwar —  who have a long and stormy history — briefly locked horns in a fight for the leadership.\nThey then joined forces again in an 11th-hour bid to stop Muhyiddin, but it proved too little, too late."},"2":{"tilte":"Turkey asks Russia to step aside in Syria\n","link":"https:\/\/www.dawn.com\/news\/1537505\/turkey-asks-russia-to-step-aside-in-syria","img":"https:\/\/i.dawn.com\/medium\/2020\/03\/5e5b31b4169da.jpg","discription":"\nA former interior minister was sworn in as Malaysia's premier on Sunday, marking the return of a scandal-mired party to power after a reformist government's collapse but ex-leader Mahathir Mohamad, 94, slammed the move as illegal.\nThe Southeast Asian nation was plunged into turmoil after Mahathir's reformist \"Pact of Hope\" alliance, which stormed to a historic victory in 2018, collapsed amid bitter infighting.\nMahathir — who was the world's oldest leader — initially quit as premier but then sought to return. He lost out however to little-known Muhyiddin Yassin, who heads a coalition dominated by the country's Muslim majority.\nThe king's decision on Saturday to pick Muhyiddin as premier was greeted with shock as Mahathir's allies claimed to have enough support, and sparked widespread anger that the democratically elected government had been ejected.\nJust before Muhyiddin's inauguration, Mahathir accused him of betrayal and said he would seek a parliament vote challenging the new premier's support — signalling the political crisis is far from over.\n\"This is a very strange thing [...] losers will form the government, the winners will be in the opposition,\" he said.\n\"The rule of law no longer applies.\"\nMuhyiddin's coalition includes the United Malays National Organisation (UMNO), the party of disgraced ex-leader Najib Razak, as well as a hardline group that wants tougher Islamic laws.\nUMNO was the corruption-riddled lynchpin of a coalition thrown out at the 2018 elections amid allegations Najib and his cronies looted billions of dollars from state fund 1MDB. Najib is now on trial for corruption.\nDespite a last-minute bid by Mahathir to prove that he had enough support to return as premier, Muhyiddin's inauguration went ahead Sunday morning at the national palace.\nHis alliance boycotted the ceremony.\nTo become premier, a candidate must prove to the king, who appoints the prime minister, that he has the backing of at least 112 MPs.\nMeanwhile, public anger was growing at the ejection of the reformist alliance, with the hashtag \"NotMyPM\" trending on Twitter and more than 100,000 people signing a petition that said the move was a \"betrayal\" of voters' choice at the 2018 poll.\nMahathir —  who served a first stint as premier from 1981 to 2003 before staging a comeback two years ago— also raised concerns that ongoing court cases against Najib related to the 1MDB scandal could be affected by the change of government.\nMahathir came out of retirement aged 92 to take on his one-time protege Najib over the controversy, and has pledged to bring him to justice.\nAnalysts said Muhyiddin's government was in a weak position as it was not clear whether he had a parliamentary majority, and was a member of a tiny party without a strong support base.\nHe was a senior UMNO figure for decades before being sacked from the party by Najib in 2015 after criticising the handling of the 1MDB scandal, and then allied with Mahathir to oust them at the last elections.\nIn a volte-face, he joined hands last week with UMNO in his quest for the premiership — although he is not a member.\nIn addition, he lacks \"the domestic legitimacy or the international legitimacy the previous government had\", Bridget Welsh, an analyst from the University of Nottingham, told AFP.\nHe is a Muslim nationalist — he once controversially described himself as \"Malay first\" and Malaysian second — and there are concerns his leadership could worsen already tense race and religious relations in the multi-ethnic country.\nAbout 60 per cent of Malaysia's population are ethnic Malay Muslims and the country is also home to substantial ethnic Chinese and ethnic Indian minorities.\nThe political crisis began a week ago when a group of ruling coalition lawmakers joined forces with opposition parties in a bid to form a new government and push out Mahathir's designated successor Anwar Ibrahim.\nIn a week of fast-moving twists and turns, Mahathir and Anwar —  who have a long and stormy history — briefly locked horns in a fight for the leadership.\nThey then joined forces again in an 11th-hour bid to stop Muhyiddin, but it proved too little, too late.\nISTANBUL: Turkish President Tayyip Erdogan said on Saturday that he had asked President Vladimir Putin for Russia to step aside in Syria and leave Turkey to deal with Syrian government forces alone, after 34 Turkish soldiers were killed this week.\nGovernment forces, backed by Russian air power, have waged a major assault to capture the northwest province of Idlib, part of the last remaining territory held by rebels backed by Turkey.\nSyrian and Russian warplanes on Saturday kept up air strikes on the Idlib city of Saraqeb, the Syrian Observatory war monitor reported. The strategic city sits on a key international roadway and has been a flashpoint of fighting in recent days.\nTurkish strikes using drones and smart missiles late on Friday that hit Hezbollah headquarters near Saraqeb killed nine of its members and wounded 30 in one of the bloodiest attacks on the Iran-backed group in Syria, according to a commander in the regional alliance backing Damascus.\nThe Syrian Observatory said 48 pro-Damascus troops had been killed by Turkish strikes in the past 24 hours.\nIran says innocent people in Idlib should be protected\nWith diplomacy sponsored by Ankara and Moscow to ease tensions in tatters, Turkey has come closer than ever to confrontation with Russia on the battlefield.\nSpeaking in Istanbul, Erdogan said he had told Putin in a phone call to stand aside and let Turkey “do what is necessary” with the Syrian government. He said Turkey does not intend to leave Syria right now.\n“We did not go there because we were invited by (Syrian President Bashar al-Assad). We went there because we were invited by the people of Syria. We don’t intend to leave before the people of Syria say, ‘Okay, this is done,’” Erdogan added.\nAs tensions rose, Russia and Turkey have held three rounds of talks, the first two of which did not yield a ceasefire.\nRussia’s Foreign Ministry said on Saturday that the two sides agreed in this week’s talks to reduce tensions on the ground in Idlib while continuing military action there.\nBut Turkish Foreign Minister Mevlut Cavusoglu told reporters in Doha that the Idlib issue can only be settled in a meeting between Erdogan and Putin, which he said would take place on March 5 or March 6.\nAfter 33 of its soldiers were killed on Thursday, Turkey said it would allow migrants it hosts to freely pass to Europe. One more Turkish soldier was killed on Friday, raising this month’s toll to 55.\nTurkey hosts some 3.7 million Syrian refugees, in addition to Afghans, Iranians, and Moroccans among others. It has warned that it cannot take another refugee wave from Idlib.\nViolence in the northwestern Syrian province has displaced one million civilians since December inside the country near the Turkish border in desperate winter conditions, in what is perhaps the worst humanitarian crisis of the conflict.\nErdogan said that 18,000 migrants has crossed the border to Europe from Turkey since the gates were opened, without providing evidence, and added that the number could rise to 25,000-30,000 on Saturday.\nGreece and Bulgaria, both European Union member states neighbouring Turkey, vowed not to admit the migrants. Greek police fired teargas toward migrants who were gathered on its border with Turkey and demanding entry on Saturday.\n“We will not close these doors in the coming period and this will continue. Why? The European Union needs to keep its promises. We don’t have to take care of this many refugees, to feed them,” Erdogan said.\nMeanwhile, Iranian President Hassan Rouhani told his Turkish counterpart on Saturday that innocent people should be protected in Syria’s northwest province, as tensions rose between Moscow and Ankara over the fighting there.\n“Idlib’s situation is very complicated, considering the presence of dangerous terrorists that should be uprooted and necessity to protect innocent people living there,” Rouhani told Tayyip Erdogan in a telephone conversation, according to Iranian state TV.\nPublished in Dawn, March 1st, 2020"},"3":{"tilte":"Austria hints at border closures in echo of Europe’s last migration crisis\n","link":"https:\/\/www.dawn.com\/news\/1537503\/austria-hints-at-border-closures-in-echo-of-europes-last-migration-crisis","img":"https:\/\/i.dawn.com\/medium\/2020\/03\/5e5b14afb85be.jpg","discription":"\nA former interior minister was sworn in as Malaysia's premier on Sunday, marking the return of a scandal-mired party to power after a reformist government's collapse but ex-leader Mahathir Mohamad, 94, slammed the move as illegal.\nThe Southeast Asian nation was plunged into turmoil after Mahathir's reformist \"Pact of Hope\" alliance, which stormed to a historic victory in 2018, collapsed amid bitter infighting.\nMahathir — who was the world's oldest leader — initially quit as premier but then sought to return. He lost out however to little-known Muhyiddin Yassin, who heads a coalition dominated by the country's Muslim majority.\nThe king's decision on Saturday to pick Muhyiddin as premier was greeted with shock as Mahathir's allies claimed to have enough support, and sparked widespread anger that the democratically elected government had been ejected.\nJust before Muhyiddin's inauguration, Mahathir accused him of betrayal and said he would seek a parliament vote challenging the new premier's support — signalling the political crisis is far from over.\n\"This is a very strange thing [...] losers will form the government, the winners will be in the opposition,\" he said.\n\"The rule of law no longer applies.\"\nMuhyiddin's coalition includes the United Malays National Organisation (UMNO), the party of disgraced ex-leader Najib Razak, as well as a hardline group that wants tougher Islamic laws.\nUMNO was the corruption-riddled lynchpin of a coalition thrown out at the 2018 elections amid allegations Najib and his cronies looted billions of dollars from state fund 1MDB. Najib is now on trial for corruption.\nDespite a last-minute bid by Mahathir to prove that he had enough support to return as premier, Muhyiddin's inauguration went ahead Sunday morning at the national palace.\nHis alliance boycotted the ceremony.\nTo become premier, a candidate must prove to the king, who appoints the prime minister, that he has the backing of at least 112 MPs.\nMeanwhile, public anger was growing at the ejection of the reformist alliance, with the hashtag \"NotMyPM\" trending on Twitter and more than 100,000 people signing a petition that said the move was a \"betrayal\" of voters' choice at the 2018 poll.\nMahathir —  who served a first stint as premier from 1981 to 2003 before staging a comeback two years ago— also raised concerns that ongoing court cases against Najib related to the 1MDB scandal could be affected by the change of government.\nMahathir came out of retirement aged 92 to take on his one-time protege Najib over the controversy, and has pledged to bring him to justice.\nAnalysts said Muhyiddin's government was in a weak position as it was not clear whether he had a parliamentary majority, and was a member of a tiny party without a strong support base.\nHe was a senior UMNO figure for decades before being sacked from the party by Najib in 2015 after criticising the handling of the 1MDB scandal, and then allied with Mahathir to oust them at the last elections.\nIn a volte-face, he joined hands last week with UMNO in his quest for the premiership — although he is not a member.\nIn addition, he lacks \"the domestic legitimacy or the international legitimacy the previous government had\", Bridget Welsh, an analyst from the University of Nottingham, told AFP.\nHe is a Muslim nationalist — he once controversially described himself as \"Malay first\" and Malaysian second — and there are concerns his leadership could worsen already tense race and religious relations in the multi-ethnic country.\nAbout 60 per cent of Malaysia's population are ethnic Malay Muslims and the country is also home to substantial ethnic Chinese and ethnic Indian minorities.\nThe political crisis began a week ago when a group of ruling coalition lawmakers joined forces with opposition parties in a bid to form a new government and push out Mahathir's designated successor Anwar Ibrahim.\nIn a week of fast-moving twists and turns, Mahathir and Anwar —  who have a long and stormy history — briefly locked horns in a fight for the leadership.\nThey then joined forces again in an 11th-hour bid to stop Muhyiddin, but it proved too little, too late.\nISTANBUL: Turkish President Tayyip Erdogan said on Saturday that he had asked President Vladimir Putin for Russia to step aside in Syria and leave Turkey to deal with Syrian government forces alone, after 34 Turkish soldiers were killed this week.\nGovernment forces, backed by Russian air power, have waged a major assault to capture the northwest province of Idlib, part of the last remaining territory held by rebels backed by Turkey.\nSyrian and Russian warplanes on Saturday kept up air strikes on the Idlib city of Saraqeb, the Syrian Observatory war monitor reported. The strategic city sits on a key international roadway and has been a flashpoint of fighting in recent days.\nTurkish strikes using drones and smart missiles late on Friday that hit Hezbollah headquarters near Saraqeb killed nine of its members and wounded 30 in one of the bloodiest attacks on the Iran-backed group in Syria, according to a commander in the regional alliance backing Damascus.\nThe Syrian Observatory said 48 pro-Damascus troops had been killed by Turkish strikes in the past 24 hours.\nIran says innocent people in Idlib should be protected\nWith diplomacy sponsored by Ankara and Moscow to ease tensions in tatters, Turkey has come closer than ever to confrontation with Russia on the battlefield.\nSpeaking in Istanbul, Erdogan said he had told Putin in a phone call to stand aside and let Turkey “do what is necessary” with the Syrian government. He said Turkey does not intend to leave Syria right now.\n“We did not go there because we were invited by (Syrian President Bashar al-Assad). We went there because we were invited by the people of Syria. We don’t intend to leave before the people of Syria say, ‘Okay, this is done,’” Erdogan added.\nAs tensions rose, Russia and Turkey have held three rounds of talks, the first two of which did not yield a ceasefire.\nRussia’s Foreign Ministry said on Saturday that the two sides agreed in this week’s talks to reduce tensions on the ground in Idlib while continuing military action there.\nBut Turkish Foreign Minister Mevlut Cavusoglu told reporters in Doha that the Idlib issue can only be settled in a meeting between Erdogan and Putin, which he said would take place on March 5 or March 6.\nAfter 33 of its soldiers were killed on Thursday, Turkey said it would allow migrants it hosts to freely pass to Europe. One more Turkish soldier was killed on Friday, raising this month’s toll to 55.\nTurkey hosts some 3.7 million Syrian refugees, in addition to Afghans, Iranians, and Moroccans among others. It has warned that it cannot take another refugee wave from Idlib.\nViolence in the northwestern Syrian province has displaced one million civilians since December inside the country near the Turkish border in desperate winter conditions, in what is perhaps the worst humanitarian crisis of the conflict.\nErdogan said that 18,000 migrants has crossed the border to Europe from Turkey since the gates were opened, without providing evidence, and added that the number could rise to 25,000-30,000 on Saturday.\nGreece and Bulgaria, both European Union member states neighbouring Turkey, vowed not to admit the migrants. Greek police fired teargas toward migrants who were gathered on its border with Turkey and demanding entry on Saturday.\n“We will not close these doors in the coming period and this will continue. Why? The European Union needs to keep its promises. We don’t have to take care of this many refugees, to feed them,” Erdogan said.\nMeanwhile, Iranian President Hassan Rouhani told his Turkish counterpart on Saturday that innocent people should be protected in Syria’s northwest province, as tensions rose between Moscow and Ankara over the fighting there.\n“Idlib’s situation is very complicated, considering the presence of dangerous terrorists that should be uprooted and necessity to protect innocent people living there,” Rouhani told Tayyip Erdogan in a telephone conversation, according to Iranian state TV.\nPublished in Dawn, March 1st, 2020\nVIENNA: Austrian Chancellor Sebastian Kurz hinted on Saturday that borders could be closed across the Balkans in response to a rush of migrants towards Greece from Turkey, echoing action taken during Europe’s 2015-16 migration crisis.\nGreek police fired teargas to push back hundreds of migrants gathered on the border with Turkey on Saturday, as a crisis over Syria shifted onto the European Union’s doorstep.\nAnkara says it will no longer contain hundreds of thousands of asylum seekers after an air strike on Idlib in northwestern Syria killed 33 Turkish soldiers.\n“We are in constant contact with our partners in the EU and along the western Balkan route. Should the protection of the EU’s external borders not succeed, then Austria will protect its borders,” Kurz, a critic of Turkey’s government and a hawk on illegal immigration, said in a statement.\nHis comments hinted at a response similar to that of 2016 when he was foreign minister and Austria coordinated a series of border closures in Balkan countries between it and Greece to block a new wave of arrivals.\nKurz won power in 2017 after taking a hard line on immigration, pledging to prevent a repeat of 2015’s influx, in which Austria took in the equivalent of about 1% of its population in asylum seekers. He formed a government at the time with the far right, which had a similar stance on the issue.\nThat conservative-far right coalition collapsed amid scandal in May and he now shares power with the left-wing Greens, though his government has maintained much of the previous coalition’s stance on immigration.\n“A situation like 2015 must absolutely not be repeated. Our aim must be to protect the EU’s external borders properly, to stop illegal migrants there and not to wave them through,” Kurz said.\nAustria was ready to send extra police to countries on the border, he said, apparently referring to Greece and Bulgaria.\nPublished in Dawn, March 1st, 2020"},"4":{"tilte":"Biden seeks decisive South Carolina win to revive presidential bid\n","link":"https:\/\/www.dawn.com\/news\/1537499\/biden-seeks-decisive-south-carolina-win-to-revive-presidential-bid","img":"https:\/\/i.dawn.com\/medium\/2020\/03\/5e5b144ac5625.jpg","discription":"\nGREENVILLE: Former vice president Joe Biden is seeking a decisive win in South Carolina’s Democratic primary election on Saturday to resuscitate his presidential hopes, while Bernie Sanders aims to cement his status as front-runner for the party’s nomination.\nThe nominating contest in South Carolina, the fourth state to weigh in on which Democrat will face Republican President Donald Trump in November, is taking place just three days before the Super Tuesday elections in 14 states, which will award one-third of the available national delegates in a single day.\nSouth Carolina, where African Americans account for 60 per cent of the Democratic electorate, is seen as a final stand for Biden, the one-time front-runner who faltered in national polls after poor showings in Iowa and New Hampshire.\nSanders aims to cement his status as front-runner for party’s nomination\nHis second-place finish in Nevada’s caucuses a week ago — while still far behind Sanders, a US senator from Vermont — provided his campaign fresh momentum, and polls show he is well positioned to win South Carolina.\nFor months, Biden’s campaign has argued the state would serve as a  “firewall” given his strength among African-American voters, and Biden himself has suggested anything less than a victory would imperil his campaign.\n“He’s going to show them what he’s got,” said Allison Pryor, 57, a retired parole officer from Charleston who said she planned to vote for Biden.\nBut with Super Tuesday looming, even a comfortable victory in South Carolina might not be enough for Biden to blunt the momentum of Sanders, a self-identified  “democratic socialist” whom Democratic Party leaders worry might be too left-wing to beat Trump.\nAfter South Carolina, Biden will also face competition from billionaire former New York City Mayor Michael Bloomberg, who has blanketed the country with half a billion dollars in advertising. Bloomberg skipped the first four states and will be on the ballot for the first time on Tuesday.\nPublished in Dawn, March 1st, 2020"},"5":{"tilte":"UN chief stresses need to sustain reduction in violence\n","link":"https:\/\/www.dawn.com\/news\/1537510\/un-chief-stresses-need-to-sustain-reduction-in-violence","img":"https:\/\/i.dawn.com\/medium\/2020\/03\/5e5b338a8db25.jpg","discription":"\nGREENVILLE: Former vice president Joe Biden is seeking a decisive win in South Carolina’s Democratic primary election on Saturday to resuscitate his presidential hopes, while Bernie Sanders aims to cement his status as front-runner for the party’s nomination.\nThe nominating contest in South Carolina, the fourth state to weigh in on which Democrat will face Republican President Donald Trump in November, is taking place just three days before the Super Tuesday elections in 14 states, which will award one-third of the available national delegates in a single day.\nSouth Carolina, where African Americans account for 60 per cent of the Democratic electorate, is seen as a final stand for Biden, the one-time front-runner who faltered in national polls after poor showings in Iowa and New Hampshire.\nSanders aims to cement his status as front-runner for party’s nomination\nHis second-place finish in Nevada’s caucuses a week ago — while still far behind Sanders, a US senator from Vermont — provided his campaign fresh momentum, and polls show he is well positioned to win South Carolina.\nFor months, Biden’s campaign has argued the state would serve as a  “firewall” given his strength among African-American voters, and Biden himself has suggested anything less than a victory would imperil his campaign.\n“He’s going to show them what he’s got,” said Allison Pryor, 57, a retired parole officer from Charleston who said she planned to vote for Biden.\nBut with Super Tuesday looming, even a comfortable victory in South Carolina might not be enough for Biden to blunt the momentum of Sanders, a self-identified  “democratic socialist” whom Democratic Party leaders worry might be too left-wing to beat Trump.\nAfter South Carolina, Biden will also face competition from billionaire former New York City Mayor Michael Bloomberg, who has blanketed the country with half a billion dollars in advertising. Bloomberg skipped the first four states and will be on the ballot for the first time on Tuesday.\nPublished in Dawn, March 1st, 2020\nWASHINGTON: UN Secretary-General Antonio Guterres called the agreement signed between the United States and Taliban on Saturday an important development in achieving a lasting political settlement in Afghanistan, while stressing the importance of sustaining a nationwide reduction in violence.\n“The Secretary-General welcomes efforts to achieve a lasting political settlement in Afghanistan. Todays events in Doha and Kabul mark important developments in this regard,” UN spokesman Stephane Dujarric said in a statement.\n“The Secretary-General stresses the importance of sustaining the nationwide reduction in violence, for the benefit of all Afghans. He encourages continued efforts by all parties to create an enabling environment for the intra-Afghan negotiations and a comprehensive peace process.”\nIn Brussels, the European Union said the landmark deal between the US and the Taliban, and a separate US-Afghanistan declaration, are “important first steps towards a comprehensive peace process” in Afghanistan.\nEU calls deal ‘important first steps towards a comprehensive peace process’\nThe EU’s foreign policy chief Josep Borrell said in a statement that “the current opportunity to move towards peace should not be missed” and the bloc expected “Afghan-owned and Afghan-led negotiations to start without delay in an inclusive manner and aiming at a lasting peace”.\nThe signing of the US-Taliban accord in the Qatari capital Doha is historic, opening the way to a withdrawal of US troops from Afghanistan in return for Taliban security guarantees.\nThere are hopes it will put an end to nearly two decades of conflict in Afghanistan, where US-led forces have propped up the government in Kabul in the face of an unceasing Taliban insurgency.\nTo achieve peace, though, the accord will have to lead to intra-Afghan talks between the Afghan government and the Taliban.\nThe Afghan government was not directly involved in the negotiations resulting in Saturday’s deal signed in Doha. But US Defense Secretary Mark Esper was in Kabul to make a joint declaration with the government.\nBorrell said the EU stood ready to help with an Afghan peace process in which “all political factions, where notably Afghan women and minorities as well as the civil society, are represented in a meaningful manner”.\nSaudi Arabia also welcomed the peace agreement between the US and the Taliban on Saturday in a foreign ministry statement which said it hoped the deal would lead to a comprehensive and permanent ceasefire and nationwide peace in Afghanistan.\nPublished in Dawn, March 1st, 2020"},"6":{"tilte":"Trump allies hope to ride anti-socialist rhetoric to election win\n","link":"https:\/\/www.dawn.com\/news\/1537497\/trump-allies-hope-to-ride-anti-socialist-rhetoric-to-election-win","img":"https:\/\/i.dawn.com\/medium\/2020\/03\/5e5b3409363c7.jpg","discription":"\nGREENVILLE: Former vice president Joe Biden is seeking a decisive win in South Carolina’s Democratic primary election on Saturday to resuscitate his presidential hopes, while Bernie Sanders aims to cement his status as front-runner for the party’s nomination.\nThe nominating contest in South Carolina, the fourth state to weigh in on which Democrat will face Republican President Donald Trump in November, is taking place just three days before the Super Tuesday elections in 14 states, which will award one-third of the available national delegates in a single day.\nSouth Carolina, where African Americans account for 60 per cent of the Democratic electorate, is seen as a final stand for Biden, the one-time front-runner who faltered in national polls after poor showings in Iowa and New Hampshire.\nSanders aims to cement his status as front-runner for party’s nomination\nHis second-place finish in Nevada’s caucuses a week ago — while still far behind Sanders, a US senator from Vermont — provided his campaign fresh momentum, and polls show he is well positioned to win South Carolina.\nFor months, Biden’s campaign has argued the state would serve as a  “firewall” given his strength among African-American voters, and Biden himself has suggested anything less than a victory would imperil his campaign.\n“He’s going to show them what he’s got,” said Allison Pryor, 57, a retired parole officer from Charleston who said she planned to vote for Biden.\nBut with Super Tuesday looming, even a comfortable victory in South Carolina might not be enough for Biden to blunt the momentum of Sanders, a self-identified  “democratic socialist” whom Democratic Party leaders worry might be too left-wing to beat Trump.\nAfter South Carolina, Biden will also face competition from billionaire former New York City Mayor Michael Bloomberg, who has blanketed the country with half a billion dollars in advertising. Bloomberg skipped the first four states and will be on the ballot for the first time on Tuesday.\nPublished in Dawn, March 1st, 2020\nWASHINGTON: UN Secretary-General Antonio Guterres called the agreement signed between the United States and Taliban on Saturday an important development in achieving a lasting political settlement in Afghanistan, while stressing the importance of sustaining a nationwide reduction in violence.\n“The Secretary-General welcomes efforts to achieve a lasting political settlement in Afghanistan. Todays events in Doha and Kabul mark important developments in this regard,” UN spokesman Stephane Dujarric said in a statement.\n“The Secretary-General stresses the importance of sustaining the nationwide reduction in violence, for the benefit of all Afghans. He encourages continued efforts by all parties to create an enabling environment for the intra-Afghan negotiations and a comprehensive peace process.”\nIn Brussels, the European Union said the landmark deal between the US and the Taliban, and a separate US-Afghanistan declaration, are “important first steps towards a comprehensive peace process” in Afghanistan.\nEU calls deal ‘important first steps towards a comprehensive peace process’\nThe EU’s foreign policy chief Josep Borrell said in a statement that “the current opportunity to move towards peace should not be missed” and the bloc expected “Afghan-owned and Afghan-led negotiations to start without delay in an inclusive manner and aiming at a lasting peace”.\nThe signing of the US-Taliban accord in the Qatari capital Doha is historic, opening the way to a withdrawal of US troops from Afghanistan in return for Taliban security guarantees.\nThere are hopes it will put an end to nearly two decades of conflict in Afghanistan, where US-led forces have propped up the government in Kabul in the face of an unceasing Taliban insurgency.\nTo achieve peace, though, the accord will have to lead to intra-Afghan talks between the Afghan government and the Taliban.\nThe Afghan government was not directly involved in the negotiations resulting in Saturday’s deal signed in Doha. But US Defense Secretary Mark Esper was in Kabul to make a joint declaration with the government.\nBorrell said the EU stood ready to help with an Afghan peace process in which “all political factions, where notably Afghan women and minorities as well as the civil society, are represented in a meaningful manner”.\nSaudi Arabia also welcomed the peace agreement between the US and the Taliban on Saturday in a foreign ministry statement which said it hoped the deal would lead to a comprehensive and permanent ceasefire and nationwide peace in Afghanistan.\nPublished in Dawn, March 1st, 2020\nNATIONAL HARBOR: Conservative activists are enthusiastically taking up Republican President Donald Trump’s re-election rallying cry that his Democratic adversaries are pursuing a radical socialist ideology that will ruin the United States.\nConservative students, right-wing media personalities and pro-Trump fundraisers and fans have gathered just outside Washington this week for the annual Conservative Political Action Conference (CPAC) that appears to have crystallised Republican messaging for the election.\nIts theme was “America vs. Socialism,” taking aim at the candidates competing for the Democratic Party’s nomination to challenge Trump in the Nov. 3 election, especially Senator Bernie Sanders, the current front-runner and a self-described democratic socialist.\nIn speeches, panels and private conversations, senior Republican leaders decried socialism, hoping the message will resonate with voters.\n“As we watch the rise of socialism today on the floor of the House of Representatives, on the floor of the United States Senate, and among the ... presidential candidates on the Democratic side of the aisle, we must be vigilant,” Representative Liz Cheney of Wyoming said a session titled “Socialism: Wrecker of Nations and Destroyer of Societies.” The Democratic candidates are a mix of moderates such as former Vice President Joe Biden, businessman Michael Bloomberg, former South Bend, Indiana Mayor Pete Buttigieg and U.S. Senator Amy Klobuchar and candidates further to the left including Senator Elizabeth Warren and Sanders. Except for Sanders, the Democratic candidates do not identify themselves socialists.\nLeading Democratic elected officials including House of Representatives Speaker Nancy Pelosi have said socialism is not the view of their party, arguing that it is Trump and his allies on the right who are out of the political mainstream and a threat to American democracy.\nSome of the Democratic candidates have focused on policy proposals aimed at reducing American income inequality through steps such as expanded government-provided healthcare, student debt forgiveness and higher taxes on the wealthy. The idea that America’s rich should pay more has broad public support, a Reuters poll found in January.\nWhen accusing Democrats of socialism, conservatives often mention proposals like the Medicare for All concept promoted by Sanders and Warren, which proposes replacing the current complex U.S. combination of private insurance and public programmes with a government-run healthcare system that expands the existing Medicare programme. The United States spends about twice what other high-income nations do on healthcare, while millions of Americans remain with no medical insurance.\n‘There’s a rumour’\nFrom early on in this campaign cycle, Trump has sought to brand Democrats as socialists and refers to the “radical left.” Trump regularly denounces socialism at his rallies, winning applause from supporters.\n“I heard there’s a rumour the Democrats are going to change the name of the party from the ‘Democrat Party’ to the ‘Socialist Party,” Trump said in remarks in Japan last June.\nHis advertising outreach to Hispanic voters warned them that Democrats want Venezuela-style socialism, referring to the South American nation led by socialist President Nicolas Maduro that is gripped by economic crisis.\nThe Democratic National Committee denounced the cries of socialism heard at the CPAC event.\n“This is the oldest trick in the GOP playbook,” said Daniel Wessel, a DNC spokesman, using shorthand for the Republican Party. “Republicans are trying to distract because they know they can’t win on the issues.” “In 2017, 2018 and 2019, Democrats won on a message of expanding access to healthcare,” Wessel added, saying that as Trump works to overturn the Democratic-backed Affordable Care Act healthcare law and its mandate that insurers must cover people with pre-existing medical conditions “they’re scared we’ll do it again.” As Trump and his allies try to paint his Democratic adversaries as socialists, the front-runner status of Sanders seems to give them a boost.\n“He could win,” said Charlie Kirk of Turning Point USA, a conservative group focused on young people.\n“We should not do what the left did in 2016 and dismiss an outsider populist candidate from thinking that person can’t win the White House,” Kirk added, referring to businessman-turned-politician Trump’s election victory four years ago.\n“Socialism is seductive,” K.T. McFarland, a CPAC speaker and former deputy national security adviser to Trump, said in an interview.\n“Socialism has failed everywhere it’s ever been tried, in every era, on every continent and among every class of people,” Vice President Mike Pence told the crowd, while urging attendees to talk to younger voters on about the topic.\nAt CPAC, where participants walked around wearing Trump memorabilia including “Make America Great Again” and “Keep America Great” hats, the message seemed to resonate.\n“Socialism is creeping up on us,” said Jonathan Foss, 34, who traveled from Fargo, North Dakota.\nFoss said a Sanders candidacy might be positive for Trump.\n“It’s probably easier to combat than maybe someone like a Bloomberg,” he said, referring to the wealthy former New York City mayor.\nLes Smyth, 53, a Republican from Florida who sold Trump-related memorabilia at a CPAC stand, said he was glad the president moved to tightened social welfare programmes such as food assistance.\n“I look at what works,” Smyth added. “And socialism I don’t think will work at all.”\nPublished in Dawn, March 1st, 2020"},"7":{"tilte":"Virus slows China’s major projects in Asia\n","link":"https:\/\/www.dawn.com\/news\/1537495\/virus-slows-chinas-major-projects-in-asia","img":"https:\/\/i.dawn.com\/medium\/2020\/03\/5e5b2c1fa336d.jpg","discription":"\nGREENVILLE: Former vice president Joe Biden is seeking a decisive win in South Carolina’s Democratic primary election on Saturday to resuscitate his presidential hopes, while Bernie Sanders aims to cement his status as front-runner for the party’s nomination.\nThe nominating contest in South Carolina, the fourth state to weigh in on which Democrat will face Republican President Donald Trump in November, is taking place just three days before the Super Tuesday elections in 14 states, which will award one-third of the available national delegates in a single day.\nSouth Carolina, where African Americans account for 60 per cent of the Democratic electorate, is seen as a final stand for Biden, the one-time front-runner who faltered in national polls after poor showings in Iowa and New Hampshire.\nSanders aims to cement his status as front-runner for party’s nomination\nHis second-place finish in Nevada’s caucuses a week ago — while still far behind Sanders, a US senator from Vermont — provided his campaign fresh momentum, and polls show he is well positioned to win South Carolina.\nFor months, Biden’s campaign has argued the state would serve as a  “firewall” given his strength among African-American voters, and Biden himself has suggested anything less than a victory would imperil his campaign.\n“He’s going to show them what he’s got,” said Allison Pryor, 57, a retired parole officer from Charleston who said she planned to vote for Biden.\nBut with Super Tuesday looming, even a comfortable victory in South Carolina might not be enough for Biden to blunt the momentum of Sanders, a self-identified  “democratic socialist” whom Democratic Party leaders worry might be too left-wing to beat Trump.\nAfter South Carolina, Biden will also face competition from billionaire former New York City Mayor Michael Bloomberg, who has blanketed the country with half a billion dollars in advertising. Bloomberg skipped the first four states and will be on the ballot for the first time on Tuesday.\nPublished in Dawn, March 1st, 2020\nWASHINGTON: UN Secretary-General Antonio Guterres called the agreement signed between the United States and Taliban on Saturday an important development in achieving a lasting political settlement in Afghanistan, while stressing the importance of sustaining a nationwide reduction in violence.\n“The Secretary-General welcomes efforts to achieve a lasting political settlement in Afghanistan. Todays events in Doha and Kabul mark important developments in this regard,” UN spokesman Stephane Dujarric said in a statement.\n“The Secretary-General stresses the importance of sustaining the nationwide reduction in violence, for the benefit of all Afghans. He encourages continued efforts by all parties to create an enabling environment for the intra-Afghan negotiations and a comprehensive peace process.”\nIn Brussels, the European Union said the landmark deal between the US and the Taliban, and a separate US-Afghanistan declaration, are “important first steps towards a comprehensive peace process” in Afghanistan.\nEU calls deal ‘important first steps towards a comprehensive peace process’\nThe EU’s foreign policy chief Josep Borrell said in a statement that “the current opportunity to move towards peace should not be missed” and the bloc expected “Afghan-owned and Afghan-led negotiations to start without delay in an inclusive manner and aiming at a lasting peace”.\nThe signing of the US-Taliban accord in the Qatari capital Doha is historic, opening the way to a withdrawal of US troops from Afghanistan in return for Taliban security guarantees.\nThere are hopes it will put an end to nearly two decades of conflict in Afghanistan, where US-led forces have propped up the government in Kabul in the face of an unceasing Taliban insurgency.\nTo achieve peace, though, the accord will have to lead to intra-Afghan talks between the Afghan government and the Taliban.\nThe Afghan government was not directly involved in the negotiations resulting in Saturday’s deal signed in Doha. But US Defense Secretary Mark Esper was in Kabul to make a joint declaration with the government.\nBorrell said the EU stood ready to help with an Afghan peace process in which “all political factions, where notably Afghan women and minorities as well as the civil society, are represented in a meaningful manner”.\nSaudi Arabia also welcomed the peace agreement between the US and the Taliban on Saturday in a foreign ministry statement which said it hoped the deal would lead to a comprehensive and permanent ceasefire and nationwide peace in Afghanistan.\nPublished in Dawn, March 1st, 2020\nNATIONAL HARBOR: Conservative activists are enthusiastically taking up Republican President Donald Trump’s re-election rallying cry that his Democratic adversaries are pursuing a radical socialist ideology that will ruin the United States.\nConservative students, right-wing media personalities and pro-Trump fundraisers and fans have gathered just outside Washington this week for the annual Conservative Political Action Conference (CPAC) that appears to have crystallised Republican messaging for the election.\nIts theme was “America vs. Socialism,” taking aim at the candidates competing for the Democratic Party’s nomination to challenge Trump in the Nov. 3 election, especially Senator Bernie Sanders, the current front-runner and a self-described democratic socialist.\nIn speeches, panels and private conversations, senior Republican leaders decried socialism, hoping the message will resonate with voters.\n“As we watch the rise of socialism today on the floor of the House of Representatives, on the floor of the United States Senate, and among the ... presidential candidates on the Democratic side of the aisle, we must be vigilant,” Representative Liz Cheney of Wyoming said a session titled “Socialism: Wrecker of Nations and Destroyer of Societies.” The Democratic candidates are a mix of moderates such as former Vice President Joe Biden, businessman Michael Bloomberg, former South Bend, Indiana Mayor Pete Buttigieg and U.S. Senator Amy Klobuchar and candidates further to the left including Senator Elizabeth Warren and Sanders. Except for Sanders, the Democratic candidates do not identify themselves socialists.\nLeading Democratic elected officials including House of Representatives Speaker Nancy Pelosi have said socialism is not the view of their party, arguing that it is Trump and his allies on the right who are out of the political mainstream and a threat to American democracy.\nSome of the Democratic candidates have focused on policy proposals aimed at reducing American income inequality through steps such as expanded government-provided healthcare, student debt forgiveness and higher taxes on the wealthy. The idea that America’s rich should pay more has broad public support, a Reuters poll found in January.\nWhen accusing Democrats of socialism, conservatives often mention proposals like the Medicare for All concept promoted by Sanders and Warren, which proposes replacing the current complex U.S. combination of private insurance and public programmes with a government-run healthcare system that expands the existing Medicare programme. The United States spends about twice what other high-income nations do on healthcare, while millions of Americans remain with no medical insurance.\n‘There’s a rumour’\nFrom early on in this campaign cycle, Trump has sought to brand Democrats as socialists and refers to the “radical left.” Trump regularly denounces socialism at his rallies, winning applause from supporters.\n“I heard there’s a rumour the Democrats are going to change the name of the party from the ‘Democrat Party’ to the ‘Socialist Party,” Trump said in remarks in Japan last June.\nHis advertising outreach to Hispanic voters warned them that Democrats want Venezuela-style socialism, referring to the South American nation led by socialist President Nicolas Maduro that is gripped by economic crisis.\nThe Democratic National Committee denounced the cries of socialism heard at the CPAC event.\n“This is the oldest trick in the GOP playbook,” said Daniel Wessel, a DNC spokesman, using shorthand for the Republican Party. “Republicans are trying to distract because they know they can’t win on the issues.” “In 2017, 2018 and 2019, Democrats won on a message of expanding access to healthcare,” Wessel added, saying that as Trump works to overturn the Democratic-backed Affordable Care Act healthcare law and its mandate that insurers must cover people with pre-existing medical conditions “they’re scared we’ll do it again.” As Trump and his allies try to paint his Democratic adversaries as socialists, the front-runner status of Sanders seems to give them a boost.\n“He could win,” said Charlie Kirk of Turning Point USA, a conservative group focused on young people.\n“We should not do what the left did in 2016 and dismiss an outsider populist candidate from thinking that person can’t win the White House,” Kirk added, referring to businessman-turned-politician Trump’s election victory four years ago.\n“Socialism is seductive,” K.T. McFarland, a CPAC speaker and former deputy national security adviser to Trump, said in an interview.\n“Socialism has failed everywhere it’s ever been tried, in every era, on every continent and among every class of people,” Vice President Mike Pence told the crowd, while urging attendees to talk to younger voters on about the topic.\nAt CPAC, where participants walked around wearing Trump memorabilia including “Make America Great Again” and “Keep America Great” hats, the message seemed to resonate.\n“Socialism is creeping up on us,” said Jonathan Foss, 34, who traveled from Fargo, North Dakota.\nFoss said a Sanders candidacy might be positive for Trump.\n“It’s probably easier to combat than maybe someone like a Bloomberg,” he said, referring to the wealthy former New York City mayor.\nLes Smyth, 53, a Republican from Florida who sold Trump-related memorabilia at a CPAC stand, said he was glad the president moved to tightened social welfare programmes such as food assistance.\n“I look at what works,” Smyth added. “And socialism I don’t think will work at all.”\nPublished in Dawn, March 1st, 2020\nCOLOMBO: From an artificial island in Sri Lanka to a bridge in Bangladesh and hydropower projects in Nepal and Indonesia, China’s trillion-dollar Belt and Road plan is stuttering under the effects of the deadly coronavirus.\nThe outbreak that emerged in China in late December and spread to dozens of countries has cut off the Chinese labour supplies and equipment imports needed to keep major infrastructure projects running.\nMore than 133 countries have imposed entry restrictions on Chinese citizens or people who have visited China to prevent the spread of the disease, data from China’s National Immigration Agency showed.\nChina itself has imposed quarantines and travel curbs across the country to contain an epidemic that has killed more than 2,700 and infected around 79,000.\nSri Lanka requires 14-day quarantine for people arriving from China, and insists projects ensure Chinese staff are restricted to construction sites and their dorms.\nAt Colombo’s Port City — an artificial island the size of central London that is to house one of South Asia’s biggest financial centres — work was progressing at a snail’s pace as nearly a third of the Chinese workers who left for the Lunar New Year holidays have not returned.\nThe March opening of South Asia’s tallest free-standing communications tower — built with Chinese state funding in the heart of Colombo — has also been delayed by two months.\n“Major construction projects in Sri Lanka that are funded by China mostly employ Chinese construction workers and they have hit a snag,” Nissanka Wijeratne, secretary of the Sri Lanka Chamber of Construction Industries, told AFP.\nAt the Port City project along Colombo’s main seaboard, the cafeteria for Chinese workers was half empty recently.\n“Most of our Chinese colleagues want to return, but the local staff are afraid to work with them,” said a Chinese foreman who only offered his surname, Xia.\n“Work is slow and it isn’t clear when things would return to normal.” Temperatures of all workers at the site are taken several times a day and masks and hand sanitisers have been distributed.\nTwo top Chinese decision-makers at the Port City project who had to return to prevent work from coming to a standstill were quarantined at a five-star hotel, said project manager Bimal Gonaduwage.\n“At the beginning there was a lot of panic among local workers, but now things have subsided,” Gonaduwage said.\nA small pharmacy near the Port city project was doing a brisk sale in an “ayurvedic-amulet” used to “ward off infections.” The red strings with a ball of crushed wild turmeric coated in Asafetida powder tied to its centre are mostly bought by workers at “China projects,” the pharmacist Anjana Paramesh said.\nBridge, hydropower projects \nThe regulator of Chinese state-owned companies last week said the outbreak had caused “difficulties” for some overseas investments.\nSome Chinese state-owned enterprises were “isolating the personnel to be dispatched (overseas) for 14 days in China and then another 14 days upon their arrival in the host countries before they begin work,” said Peng Huagang, secretary general of the state-owned Assets Supervision and Administration Commission.\nBangladesh has stopped issuing visas to Chinese visitors including Chinese workers.\nSome 3,000 Chinese workers are employed at the China-funded $2.5 billion 1,320-megawatt Bangladesh China Power Company at the southern port of Payra.\nNearly two-thirds of them had returned to China during the Lunar New Year in January, said project manager Abdul Moula.\n“Our plan is to start full scale operation by next month. But if at least 300 Chinese workers don’t come back by this month ... power production could be delayed,” he said.\nAt the $3.5bn Padma Multipurpose Bridge, being built by state-owned China Major Railway Bridge Company, nearly one-third of the 980 Chinese workers have yet to return, said project manager Dewan Abdul Kader.\nOn Indonesia’s Sumatra island, work at the China-backed Batang Toru hydropower plant has ground to a halt due to a lack of Chinese workers, after Indonesia halted all flights to and from mainland China.\nConstruction of the $6bn Jakarta-Bandung high-speed rail project will also be delayed, according to Indonesia’s investment affairs minister Luhut Pandjaitan.\nChina downplays impact \nIn Nepal — home to more than a dozen Chinese-backed hydropower projects — many Chinese workers who left on holiday have also not returned.\n“In their absence, projects are being delayed or slowed down,” said Vishnu Bahadur Singh from the Nepal Hydropower Association.\n“Many of them are in specialised work, and it is not easy to replace them locally.” The setback from the coronavirus comes after a pushback against Belt and Road projects in several countries including Sri Lanka, Malaysia and Indonesia, where contracts were renegotiated to cut costs or ensure better environmental compliance.\nBut Chinese Foreign Minister Wang Yi last week played down fears that prolonged disruption from the virus could slow work on China-backed investments in Asia, saying it “won’t have any negative impacts”. \nPublished in Dawn, March 1st, 2020"},"8":{"tilte":"US and Afghan Taliban sign historic troop withdrawal deal in Doha\n","link":"https:\/\/www.dawn.com\/news\/1537384\/us-and-afghan-taliban-sign-historic-troop-withdrawal-deal-in-doha","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e5a80c4161e1.jpg","discription":"\nThe United States signed a deal with Taliban insurgents on Saturday that could pave the way toward a full withdrawal of foreign soldiers from Afghanistan over the next 14 months and represent a step toward ending the 18-year-old war in the nation.\nWhile the agreement creates a path for the US to gradually pull out of its longest war, many expect talks to come between the Afghan sides may be much more complicated.\nMonths of speculation about when the deal would be signed, and what its contents would be, culminated in a plush conference room in the Qatari capital Doha, when Taliban political chief Mullah Abdul Ghani Baradar signed the accord along with US special envoy Zalmay Khalilzad.\nThe pair then shook hands, as people in the room shouted “Allahu Akbar” (God is greatest). US Secretary of State Mike Pompeo was on hand to witness the ceremony.\nUS Defence Secretary Mark Esper said that while the signing of the accord would be a good step, the road ahead would not be easy.\n \n“This is a hopeful moment, but it is only the beginning. The road ahead will not be easy. Achieving lasting peace in Afghanistan will require patience and compromise among all parties,” said Esper, who met Afghan President Ashraf Ghani in Kabul where they announced a joint declaration in parallel to the US-Taliban accord.\nThe US said it is committed to reducing the number of its troops in Afghanistan to 8,600 — from the current 13,000 — within 135 days of signing the deal, and working with its allies to proportionally reduce the number of coalition forces in Afghanistan over that period, if the Taliban adhere to their commitments.\nA full withdrawal of all US and coalition forces would occur within 14 months of this deal getting signed, if the Taliban hold up their end of the deal, the joint statement said.\nFor US President Donald Trump, the Doha deal represents a chance to make good on his promise to bring US troops home.\nBut security experts have also called it a foreign policy gamble that would give the Taliban international legitimacy.\n“Today is a monumental day for Afghanistan,” the US Embassy in Kabul said on Twitter. “It is about making peace and crafting a common brighter future. We stand with Afghanistan.” \n \nAddressing the historic event, US Secretary of State Pompeo said Washington will closely watch the Taliban compliance to the agreement signed today. He said the Taliban had shown that they have the will to be peaceful during the recent ‘reduction in violence’ period.\nHe cautioned, however, that the agreement will mean nothing “if concrete actions are not taken on commitments and promises”.\nPompeo called on the Taliban to keep their promise to cut ties with Al Qaeda and keep fighting the militant Islamic State group.\nGhani said he hoped the Doha deal paves the way towards lasting peace. “We hope the US-Taliban peace [deal] will lead to a permanent ceasefire ... The nation is looking forward to a full ceasefire,” he told a news conference in Kabul.\nThe Afghan government said it stood ready to negotiate and conclude a ceasefire with the Taliban, and it affirmed its support for the phased withdrawal of US and coalition forces subject to the Taliban's fulfilment of their commitments.\n \nIt also said that it remained committed to preventing militant groups from using its soil to threaten the security of the US, its allies and other countries.\nSeparately, Nato pledged to adjust the coalition troop levels in the first phase too, bringing down Nato's numbers to about 12,000 from roughly 16,000 troops at present.\n“We went in together in 2001, we are going to adjust [troop levels] together and when the time is right, we are going to leave together, but we are only going to leave when conditions are right,” Nato Secretary-General Jens Stoltenberg, who was in Kabul on Saturday, told reporters.\nHours before the deal, the Taliban ordered all their fighters in Afghanistan “to refrain from any kind of attack ... for the happiness of the nation”.\n“The biggest thing is that we hope the US remain committed to their promises during the negotiation and peace deal,” said Zabiullah Mujahid, a spokesman for the hardline militant group.\nFor millions of Afghans, the deal represents some hope for an end to years of bloodshed.\n“Peace is extremely simple and my country deserves it. Today is the day when maybe we will see a positive change,” said Javed Hassan, 38, a school teacher living on the outskirts of Afghan capital Kabul.\nHassan's children were killed in a bomb blast carried out by the Taliban in 2018. Since then, he has been writing letters to world leaders urging them to end the Afghan war.\nPakistan welcomed the signing of the US-Taliban agreement.\nForeign Minister Shah Mahmood Qureshi, who was present at the signing ceremony, in his remarks to the media after the event said that the accord carried \"immense importance — both in symbolism and substance — for Afghanistan, the region and beyond\", a Foreign Office statement said.\nHe said the deal reflected a \"significant step forward by the US and the Taliban in advancing the ultimate aim of peace and reconciliation in Afghanistan\".\nHe expressed the hope that Afghan parties will now \"seize this historic opportunity\" and work out a comprehensive and inclusive political settlement for peace and stability in Afghanistan.\nAccording to the statement, Qureshi underscored the need for international support to the Afghan government in creating an enabling environment for the return of Afghan refugees in Pakistan to their homeland.\n\"Today’s ceremony has, once again, vindicated Pakistan’s long-held stance that there is no military solution of the Afghan conflict,\" the FO said. \nThe foreign minister said Pakistan had fulfilled its part of the responsibility by facilitating the peace agreement. \"Pakistan will continue to support a peaceful, stable, united, democratic and prosperous Afghanistan, at peace with itself and with its neighbours,\" he added.\nRepresentatives from 50 countries and foreign ministers of different countries attended the signing ceremony of the agreement.\nPakistan, which neighbours Afghanistan, and has been a long-time ally in America's war on terror, played a critical role in bringing the two sides to the negotiation table. \nKhalilzad has on multiple occasions appreciated and thanked Pakistan for its constructive role in the peace process. \nRead more: US thanks Pakistan for facilitating Afghan peace process\nMore than 18 years since President George W. Bush ordered bombing in response to the September 11, 2001, attacks, the agreement will set the stage for the withdrawal of US troops, some of whom were not yet born when the World Trade Centre collapsed on that crisp, sunny morning that changed how Americans see the world.\nSaturday’s ceremony also signals the potential end of a tremendous investment of blood and treasure. The US spent more than $750 billion, and on all sides the war cost tens of thousands of lives lost, permanently scarred and indelibly interrupted. Yet it’s also a conflict that is frequently ignored by US politicians and the American public.\nTrump, as he seeks re-election this year, is looking to make good on his campaign promise to bring troops home from the Middle East. Still, he has approached the Taliban agreement cautiously, steering clear of the crowing surrounding other major foreign policy actions, such as his talks with North Korea.\nLast September, on short notice, he called off what was to be a signing ceremony with the Taliban at Camp David after a series of new Taliban attacks. But he has since been supportive of the talks led by his special envoy, Khalilzad.\nIn a statement released by the White House, Trump said on Friday that if the Taliban and Afghan government live up to the commitments in the agreement, “we will have a powerful path forward to end the war in Afghanistan and bring our troops home.”\n“These commitments represent an important step to a lasting peace in a new Afghanistan, free from al-Qaida, ISIS and any other terrorist group that would seek to bring us harm,” Trump said.\nIf the agreement is successful, Afghanistan, the “graveyard of empires” that has repeatedly repelled foreign invaders from imperial Britain and Russia to the Soviet Union, will have once again successfully turned away a world power from its landlocked borders.\nBut prospects for Afghanistan’s future are uncertain. The agreement sets the stage for peace talks involving Afghani factions, which are likely to be complicated. Under the agreement, 5,000 Taliban are to be released from Afghan-run jails, but it’s not known if the Afghan government will do that. There are also questions about whether Taliban fighters loyal to various warlords will be willing to disarm.\nIt’s not clear what will become of gains made in women’s rights since the toppling of the Taliban, who had repressed women and girls under a strict brand of Sharia law. Women’s rights in Afghanistan had been a top concern of both the Bush and Obama administration.\nAdditional input by AFP."},"9":{"tilte":"Taliban order halt to attacks in Afghanistan ahead of US agreement\n","link":"https:\/\/www.dawn.com\/news\/1537402\/taliban-order-halt-to-attacks-in-afghanistan-ahead-of-us-agreement","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e5a50d48d0e8.jpg","discription":"\nThe United States signed a deal with Taliban insurgents on Saturday that could pave the way toward a full withdrawal of foreign soldiers from Afghanistan over the next 14 months and represent a step toward ending the 18-year-old war in the nation.\nWhile the agreement creates a path for the US to gradually pull out of its longest war, many expect talks to come between the Afghan sides may be much more complicated.\nMonths of speculation about when the deal would be signed, and what its contents would be, culminated in a plush conference room in the Qatari capital Doha, when Taliban political chief Mullah Abdul Ghani Baradar signed the accord along with US special envoy Zalmay Khalilzad.\nThe pair then shook hands, as people in the room shouted “Allahu Akbar” (God is greatest). US Secretary of State Mike Pompeo was on hand to witness the ceremony.\nUS Defence Secretary Mark Esper said that while the signing of the accord would be a good step, the road ahead would not be easy.\n \n“This is a hopeful moment, but it is only the beginning. The road ahead will not be easy. Achieving lasting peace in Afghanistan will require patience and compromise among all parties,” said Esper, who met Afghan President Ashraf Ghani in Kabul where they announced a joint declaration in parallel to the US-Taliban accord.\nThe US said it is committed to reducing the number of its troops in Afghanistan to 8,600 — from the current 13,000 — within 135 days of signing the deal, and working with its allies to proportionally reduce the number of coalition forces in Afghanistan over that period, if the Taliban adhere to their commitments.\nA full withdrawal of all US and coalition forces would occur within 14 months of this deal getting signed, if the Taliban hold up their end of the deal, the joint statement said.\nFor US President Donald Trump, the Doha deal represents a chance to make good on his promise to bring US troops home.\nBut security experts have also called it a foreign policy gamble that would give the Taliban international legitimacy.\n“Today is a monumental day for Afghanistan,” the US Embassy in Kabul said on Twitter. “It is about making peace and crafting a common brighter future. We stand with Afghanistan.” \n \nAddressing the historic event, US Secretary of State Pompeo said Washington will closely watch the Taliban compliance to the agreement signed today. He said the Taliban had shown that they have the will to be peaceful during the recent ‘reduction in violence’ period.\nHe cautioned, however, that the agreement will mean nothing “if concrete actions are not taken on commitments and promises”.\nPompeo called on the Taliban to keep their promise to cut ties with Al Qaeda and keep fighting the militant Islamic State group.\nGhani said he hoped the Doha deal paves the way towards lasting peace. “We hope the US-Taliban peace [deal] will lead to a permanent ceasefire ... The nation is looking forward to a full ceasefire,” he told a news conference in Kabul.\nThe Afghan government said it stood ready to negotiate and conclude a ceasefire with the Taliban, and it affirmed its support for the phased withdrawal of US and coalition forces subject to the Taliban's fulfilment of their commitments.\n \nIt also said that it remained committed to preventing militant groups from using its soil to threaten the security of the US, its allies and other countries.\nSeparately, Nato pledged to adjust the coalition troop levels in the first phase too, bringing down Nato's numbers to about 12,000 from roughly 16,000 troops at present.\n“We went in together in 2001, we are going to adjust [troop levels] together and when the time is right, we are going to leave together, but we are only going to leave when conditions are right,” Nato Secretary-General Jens Stoltenberg, who was in Kabul on Saturday, told reporters.\nHours before the deal, the Taliban ordered all their fighters in Afghanistan “to refrain from any kind of attack ... for the happiness of the nation”.\n“The biggest thing is that we hope the US remain committed to their promises during the negotiation and peace deal,” said Zabiullah Mujahid, a spokesman for the hardline militant group.\nFor millions of Afghans, the deal represents some hope for an end to years of bloodshed.\n“Peace is extremely simple and my country deserves it. Today is the day when maybe we will see a positive change,” said Javed Hassan, 38, a school teacher living on the outskirts of Afghan capital Kabul.\nHassan's children were killed in a bomb blast carried out by the Taliban in 2018. Since then, he has been writing letters to world leaders urging them to end the Afghan war.\nPakistan welcomed the signing of the US-Taliban agreement.\nForeign Minister Shah Mahmood Qureshi, who was present at the signing ceremony, in his remarks to the media after the event said that the accord carried \"immense importance — both in symbolism and substance — for Afghanistan, the region and beyond\", a Foreign Office statement said.\nHe said the deal reflected a \"significant step forward by the US and the Taliban in advancing the ultimate aim of peace and reconciliation in Afghanistan\".\nHe expressed the hope that Afghan parties will now \"seize this historic opportunity\" and work out a comprehensive and inclusive political settlement for peace and stability in Afghanistan.\nAccording to the statement, Qureshi underscored the need for international support to the Afghan government in creating an enabling environment for the return of Afghan refugees in Pakistan to their homeland.\n\"Today’s ceremony has, once again, vindicated Pakistan’s long-held stance that there is no military solution of the Afghan conflict,\" the FO said. \nThe foreign minister said Pakistan had fulfilled its part of the responsibility by facilitating the peace agreement. \"Pakistan will continue to support a peaceful, stable, united, democratic and prosperous Afghanistan, at peace with itself and with its neighbours,\" he added.\nRepresentatives from 50 countries and foreign ministers of different countries attended the signing ceremony of the agreement.\nPakistan, which neighbours Afghanistan, and has been a long-time ally in America's war on terror, played a critical role in bringing the two sides to the negotiation table. \nKhalilzad has on multiple occasions appreciated and thanked Pakistan for its constructive role in the peace process. \nRead more: US thanks Pakistan for facilitating Afghan peace process\nMore than 18 years since President George W. Bush ordered bombing in response to the September 11, 2001, attacks, the agreement will set the stage for the withdrawal of US troops, some of whom were not yet born when the World Trade Centre collapsed on that crisp, sunny morning that changed how Americans see the world.\nSaturday’s ceremony also signals the potential end of a tremendous investment of blood and treasure. The US spent more than $750 billion, and on all sides the war cost tens of thousands of lives lost, permanently scarred and indelibly interrupted. Yet it’s also a conflict that is frequently ignored by US politicians and the American public.\nTrump, as he seeks re-election this year, is looking to make good on his campaign promise to bring troops home from the Middle East. Still, he has approached the Taliban agreement cautiously, steering clear of the crowing surrounding other major foreign policy actions, such as his talks with North Korea.\nLast September, on short notice, he called off what was to be a signing ceremony with the Taliban at Camp David after a series of new Taliban attacks. But he has since been supportive of the talks led by his special envoy, Khalilzad.\nIn a statement released by the White House, Trump said on Friday that if the Taliban and Afghan government live up to the commitments in the agreement, “we will have a powerful path forward to end the war in Afghanistan and bring our troops home.”\n“These commitments represent an important step to a lasting peace in a new Afghanistan, free from al-Qaida, ISIS and any other terrorist group that would seek to bring us harm,” Trump said.\nIf the agreement is successful, Afghanistan, the “graveyard of empires” that has repeatedly repelled foreign invaders from imperial Britain and Russia to the Soviet Union, will have once again successfully turned away a world power from its landlocked borders.\nBut prospects for Afghanistan’s future are uncertain. The agreement sets the stage for peace talks involving Afghani factions, which are likely to be complicated. Under the agreement, 5,000 Taliban are to be released from Afghan-run jails, but it’s not known if the Afghan government will do that. There are also questions about whether Taliban fighters loyal to various warlords will be willing to disarm.\nIt’s not clear what will become of gains made in women’s rights since the toppling of the Taliban, who had repressed women and girls under a strict brand of Sharia law. Women’s rights in Afghanistan had been a top concern of both the Bush and Obama administration.\nAdditional input by AFP.\nThe Taliban ordered all their fighters “to refrain from any kind of attack” on Saturday ahead of the signing of an agreement with the US diplomats aimed at bringing peace to Afghanistan.\n“Today all the Taliban fighters are ordered to refrain from any kind of attack ... for the happiness of the nation,” Zabiullah Mujahid, a spokesman for the Taliban told Reuters.\n“The biggest thing is that we hope the US remain committed to their promises during the negotiation and peace deal,” he said, adding that foreign forces' aircraft were flying over Taliban territory which was “irritating and provocative”."},"10":{"tilte":"Footprints: Bernie barrels towards Super Tuesday\n","link":"https:\/\/www.dawn.com\/news\/1537468\/footprints-bernie-barrels-towards-super-tuesday","img":"https:\/\/i.dawn.com\/medium\/2020\/03\/5e5b444149a4a.jpg","discription":"\nThe only presidential candidate, Democratic or Republican, to have ever won the popular vote in the three early voting states of Iowa, New Hampshire and Nevada, Vermont Senator Bernie Sanders found himself celebrating his victory at the Nevada polls in Texas last weekend. On Sunday, over 12,000 people flooded the grounds of Vic Mathias Shores, along the river, in Austin to hear him speak. \nSupporters started gathering over an hour before seating was supposed to begin, and stood in line patiently, talking to each other about politics, T-shirts and badges, and how they had attended Sanders’ last rally in Austin, in 2016. The weather was great and Austin Bands for Bernie put on a great show featuring Molly Burch’s “love songs for Bernie”, the Black Angels and Jordan Moser, among others, urging action against the Permian Highway Pipeline in Texas, exploitative drug companies, oil companies and climate change. As band after another came on stage to perform and talk about how President Bernie would take away power from thieves, oligarchs and plutocrats and give it back to the people, the audience responded with cheers and waving their Bernie signs, indicating an acceptance and urgency to address problems now being recognized as systemic. \n“The powers that be are scared of Bernie, he’s too progressive, he’s too scary, we need a moderate,” author and activist Jim Hightower said at the podium. “He’s running a campaign that’s hotter than high school love.” \nHouston’s Marianne Williamson, who dropped out of the presidential race in January, endorsed Bernie at the rally saying: “It is said that Bernie can’t beat Trump, they also said you can’t abolish slavery, or give women voting rights.” The former candidate, who enjoyed massive support among American celebrities and progressives, added: “He [Bernie] has been consistent. He has been convicted, he has been committed. And now it’s time. I’m here and you’re here, because it’s time for us to take a stand with Bernie.”\nAustin residents love a good meditation, and that’s exactly what Bernie’s campaign manager Greg Casar asked the audience to do: close their eyes and meditate on a possible future. “Imagine a world where our kids are safe at school. Where the president isn’t calling us rapists and murderers. Imagine a world where the person next to you is not a target. Where every person can live in dignity and freedom…Now open your eyes. This world is within our reach. Can we do this?”\nThe response was a deafening “yes”. \n“Are you ready to fight white supremacy? Are you ready to fight for Medicare for All? Green New Deal? Fight racists and white supremacists?” Yes to all. The audience by now was pumped from imagining the future and then it was time for Bernie to speak. \n“The limitations of our imagination are in the form of the crises we face today. The wealthiest nation in the world can’t have half a million people sleeping on the streets,” he said. \n“If the drug companies and Wall Street see this crowd, they will really feel nervous… this is their nightmare: when they see all over the country, millions demanding decent wages, quality education and healthcare as a human right not a privilege.” \nWhile Texas being the hub of America’s oil and fracking industry has faced its share of climate-change-related disasters, Bernie announced his plan to create 20 million jobs through a transition from dirty energy to renewable energy. “Climate change is an existential threat, Houston is already familiar with that...We have a moral responsibility.” He said his plan on tackling climate change involved reaching out all over the globe including China, India and Pakistan, where instead of spending trillions of dollars on building and deploying weapons of mass destruction, the US could work with those countries to fight the effects of climate change. \nHe vowed to repeal Trump’s ‘racist’ immigration executive orders and stop demonising immigrants, and end ICE raids that have terrorised communities across the US. \n“We have an odd sense of justice in this country… If you are a Wall Street executive, the government will bail you out [even] if you are a crook, but if you are a kid who gets arrested for marijuana you get arrested. We are going to change that criminal justice system,” he announced. Interestingly, without skipping a beat, several people in the crowd lit up joints (though weed isn’t legal in Texas). \nHe then promised to cancel all student debt in the country by taxing Wall Street and making them pay for it. This sounds like a dream or an exercise in meditation but instead of asking whether it can be done, people preferred to listen. \n“No one from the press asks for Bernie signs,” a campaigner said to me, when I asked for one. “Why, not?” I asked. \n“Maybe because they hate us?”\nIt’s true. The journalists in the press gallery were laughing at the bands asking the crowd to take action against the Permian Pipeline and other issues important to Texans. The political workers argue that it’s because media organisations are owned by corporations and their interests are tied to maintaining the status quo, and for journalists who interpret ‘credible source’ as someone in power, this isn’t surprising. This is also why they got the 2016 election results wrong, they say. \nShan Ali Khan, a lawyer from Dallas, who travelled to Iowa ahead of the caucuses there, talks about what Bernie means when he says they are building a “grassroots movement”. Bernie’s campaign volunteers are connected across states through social media. The focus is on being mobile, visiting door to door, calling up or texting as many people as possible, and making sure the methods and message is consistent across states. It involves reaching out to communities that are otherwise ignored when it comes to campaigning, and that’s being done by thousands of young people from a variety of backgrounds who understand this election as a fight for their own future. \nAs American voters prepare to head to the polls on Super Tuesday, March 3, when the most US states hold elections and over a third of all delegates are allotted to candidates, Senator Bernie Sanders appears to be dominating the polls. While this has left the establishment democrats scared to the point that the NY Times is reporting the party is willing to sabotage itself rather than allowing him to run, Bernie himself is quite clear: “We are running a campaign for the working class of America, by working class of America, from the working class of America.”\nPublished in Dawn, March 1st, 2020"},"11":{"tilte":"Prince Harry, Jon Bon Jovi recreate Abbey Road Beatles cover\n","link":"https:\/\/www.dawn.com\/news\/1537355\/prince-harry-jon-bon-jovi-recreate-abbey-road-beatles-cover","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e59cb5e7c1f1.jpg?r=799914342","discription":"\nLONDON: Britain’s Prince Harry and singer Jon Bon Jovi recreated one of the Beatles’ best-known album covers on Friday, walking across the zebra crossing outside Abbey Road recording studios in north London.\nHarry was at the studio to meet the singer and members of a military veterans’ choir in one of his last engagements as a senior member of the royal family.\nAs countless Beatles fans have done since the 1969 release of the “Abbey Road” album, the pair walked across the black and white pedestrian crossing, this time led by a military veteran in a wheelchair.\nEarlier, a video of the two wearing headphones, with Bon Jovi strumming a guitar before beginning to sing was posted on the official Instagram page of Harry and his American wife Meghan, the Duke and Duchess of Sussex.\nThe couple announced in January that they would step down from their duties as senior royals, spend more time in North America and aim to become financially independent.\nThe Invictus Games Choir, who are recording a single for charity, is made up of veterans and serving personnel from the British military.\nTheir song, called “Unbroken,” was created by Bon Jovi to shine a spotlight on veterans living with Post Traumatic Stress Disorder.\nBon Jovi, whose parents were both in the US Marine Corps, told reporters he had a lot of respect for the royals.\n“I just want to give them a hug,” he said.\nProceeds from the sale of the record will go to the foundation that supports the Invictus Games, a sporting event for sick and injured veterans that is one of Harry’s favourite causes.\nPublished in Dawn, February 29th, 2020"},"12":{"tilte":"Scotland becomes first country to make sanitary products free for all\n","link":"https:\/\/www.dawn.com\/news\/1537163\/scotland-becomes-first-country-to-make-sanitary-products-free-for-all","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e58d12edc08c.jpg","discription":"\nThe Scottish parliament approved plans on Tuesday to make sanitary products freely available to all women, the first nation in the world to do so.\nThe legislation would make tampons and sanitary pads available at designated public places such as community centres, youth clubs and pharmacies, at an estimated annual cost of 24.1 million pounds ($31.2 million).\nThe Period Products (Free Provision) Scotland Bill passed through its first stage with 112 votes in favour, none against and one abstention. It now moves to the second stage, where members of the devolved Scottish parliament can propose amendments.\nDuring the debate, the bill’s proposer Monica Lennon said passing it would be a “milestone moment for normalising menstruation in Scotland and sending out that real signal to people in this country about how seriously parliament takes gender equality.”\nFellow lawmaker Alison Johnstone asked: “Why is it in 2020 that toilet paper is seen as a necessity but period products aren’t? Being financially penalised for a natural bodily function is not equitable or just.”\nIn 2018, Scotland became the first country in the world to provide free sanitary products in schools, colleges and universities.\nSanitary products in the United Kingdom are currently taxed at 5%. Former Prime Minister David Cameron’s government said it wanted to end that “tampon tax”, but that its hands were tied by European Union rules which set tax rates for certain products.\nThe government announced it would drop the tax in 2016, but this has not happened yet.\nEarlier on Tuesday, Lennon joined a rally gathered outside the Scottish parliament, and held a sign which said “Access to menstrual products is a right. Period.”"},"13":{"tilte":"BTS cancels concert amidst coronavirus outbreak\n","link":"https:\/\/www.dawn.com\/news\/1537155\/bts-cancels-concert-amidst-coronavirus-outbreak","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e58a85542921.jpg","discription":"\nSouth Korean boy band BTS canceled its scheduled April concert in Seoul, amid growing concerns of the new coronavirus outbreak, its music label, Big Hit Entertainment, said on Friday.\n“The current global coronavirus (COVID-19) outbreak has made it impossible at this time to predict the scale of the outbreak during the dates of the concert in April,” Big Hit said in a statement.\nFour shows in Seoul’s Olympic Stadium on April 11, 12, 18 and 19 were scheduled to lead a “MAP OF THE SOUL TOUR”, in which the seven-member boy band was due to visit 17 cities through September including Los Angeles, Washington D.C., London and Tokyo.\nThe label said reserved tickets will be refunded in full.\nThe cancellation comes after Big Hit chose JPMorgan Chase & Co (JPM.N), NH Investment & Securities Co Ltd (005940.KS) and others to handle its initial public offering (IPO), according to media reports. Concerts, along with merchandise sold at concerts, are one of the major revenue sources for management agencies.\nSouth Korea reported 256 new coronavirus cases on Friday, bringing the country’s total to 2,022 and 13 deaths.\nThe coronavirus originated in China before spreading to another 44 countries."},"14":{"tilte":"Hidden door spills centuries-old secrets of British parliament\n","link":"https:\/\/www.dawn.com\/news\/1536907\/hidden-door-spills-centuries-old-secrets-of-british-parliament","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e56e60adf8a8.jpg","discription":"\n \nLONDON: A forgotten passageway in the British parliament constructed for the 1661 coronation of king Charles II has been rediscovered during renovation work, officials said on Wednesday.\nIt was bricked up in 1807 and had not been accessed for more than 70 years, hidden behind a small wooden door that most people assumed contained an electricity cupboard.\nThe passage led out of Westminster Hall, the only building to survive a devastating fire in 1834 that destroyed the Houses of Commons and Lords.\nIt was created for the coronation banquet of king Charles in 1661, and 17th-century wooden timbers still run across the ceiling.\nSenior political figures such as the diarist Samuel Pepys and Britain’s first effective prime minister, Robert Walpole, would have likely used it.\n“To think that this walkway has been used by so many important people over the centuries is incredible,” House of Commons Speaker Lindsay Hoyle said.\nThe passage was reopened during the rebuilding of parliament after the fire, but closed again in 1851.\nGraffiti left by the 19th century bricklayers remains on the walls, with one section reading:  “This room was enclosed by Tom Porter who was very fond of Ould Ale (beer).” Workmen dealing with bomb damage from World War II were the next to find the passage, and they installed an electric light and small access door.\nBut the door, in wood panelling in a cloister formerly used as offices by the Labour Party, had only a tiny brass keyhole and it was soon forgotten.\nHistorians took a closer look when renovation works began across the whole parliamentary estate in 2018, according to Liz Hallam Smith, a historical consultant on the project.\n“As we looked at the panelling closely, we realised there was a tiny brass key-hole that no-one had really noticed before, believing it might just be an electricity cupboard,” she said.\n“Once a key was made for it, the panelling opened up like a door into this secret entrance.”\nPublished in Dawn, February 27th, 2020"},"15":{"tilte":"Pakistan hails Doha Accord as harbinger of peace in Afghanistan\n","link":"https:\/\/www.dawn.com\/news\/1537462\/pakistan-hails-doha-accord-as-harbinger-of-peace-in-afghanistan","img":"https:\/\/i.dawn.com\/medium\/2020\/03\/5e5b1feb84820.jpg","discription":"\nISLAMABAD: Pakistan on Saturday welcomed the signing of Doha Accord between the United States and Taliban as a major step towards peace in Afghanistan after 19 years of war and hoped that Afghan factions would avail this opportunity to reach a mutual accommodation. \nPakistan was represented at the signing ceremony in the Qatar capital by Foreign Minister Shah Mehmood Qureshi. The agreement, under which the US committed to withdraw up to 5,000 troops in about four and a half months and all remaining forces within 14 months, if the deal holds, is expected to lead to initiation of intra-Afghan dialogue by March 10. \n“We welcome the Doha Accord signed between US and the Taliban. This is the start of a peace and reconciliation process to end decades of war and suffering of the Afghan people,” Prime Minister Imran Khan tweeted and said he stood vindicated that a political solution was the only route to peace. \n \nCautioning about the challenges ahead for the peace process, Mr Khan said: “Now all stakeholders have to ensure that spoilers are kept at bay. My prayers for peace for the Afghan people who have suffered 4 decades of bloodshed.” \n \nFM hopes Afghan parties will work out an inclusive political settlement for durable peace, stability  \nPakistan, which played a key role in US-Taliban negotiations that resulted in the signing of the accord, the prime minister said, remained committed to playing its role in ensuring that the agreement held and succeeded in bringing peace to Afghanistan. \nMeanwhile, Foreign Minister Qureshi after witnessing the signing ceremony said that Doha Accord was important, both in symbolism and substance, for Afghanistan, the region and beyond. “It is a significant step forward by US and Taliban in advancing the ultimate aim of peace and reconciliation in Afghanistan,” he maintained. \nMr Qureshi hoped that the Afghan parties would now seize this historic opportunity and work out a comprehensive and inclusive political settlement for durable peace and stability in Afghanistan and the region. \nHe underlined the need for continued international support for Afghanistan to enable it to commence reconstruction and rehabilitation phase. He further called for assisting the Afghan government in creating an enabling environment for the return of the refugees. \nAbout Pakistan’s policy towards Afghan peace process, the foreign minister recalled that Pakistan had fulfilled its part of the responsibility for facilitating the peace agreement and would continue supporting the Afghan people in their efforts to achieve lasting peace, stability and development in their country. \n“Pakistan will continue to support a peaceful, stable, united, democratic and prosperous Afghanistan, at peace with itself and with its neighbours,” he asserted. \nNational Assembly Speaker Asad Qaiser said that Pakistan had always been a staunch supporter of resolution of disputes through peaceful means. He said that sustainable peace and security in Afghanistan, which would ensure long-term development, progress and prosperity there and in the region was in Pakistan’s best national interest. Peace, he believed, would also allow Afghan refugees to return to their homeland. \nReaffirming Pakistan’s resolve and continued commitment to the Afghan peace process, the speaker said a national dialogue was being convened on March 17 to look into the challen­ges arising out of the post US-Taliban accord situation with specific reference to Pakistan. Representatives of political parties, parliamentarians, academia, intelligentsia, media and civil society would be invited to attend the session.\nPublished in Dawn, March 1st, 2020"}}