{"1":{"tilte":"\n\t\t\tCostco changes its food court policy: You gotta be a member\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/costcos-changes-its-food-court-policy-you-gotta-be-a-member\/","discription":"\nShoppers who enjoy cheap hot dogs, churros and pizza from \nShoppers who are not members of the warehouse club have long enjoyed its food offerings — particularly the hot dog\/soda combo for $1.50 and the $1 churros. But beginning in March, the big-box retailer will require an active membership to visit the food court, according to multiple media reports.\nCostco couldn’t be reached to elaborate on the policy, but comments on social media indicate the change won’t immediately go into effect at all company stores and may be rolled out in stages.\nA photo on Instagram shows a sign in front of a Costco store that reads, “Effective March 16, 2020, an active Costco membership card will be required to purchase items from our food court.”\nThe sign encourages shoppers to “please see our membership counter for details.”\nBuying items from the food court has technically required a membership, but the policy has not been strictly enforced, the company said. With many of its food courts outdoors, it was easy for non-members to walk up and buy the inexpensive food without showing a membership card.\nThe pending change has elicited a wide range of comments.\n“Costco, ur starting to suck,” one Instagram follower posted.\n“Of course you should have a membership,” another posted. “Good for you, Costco!”\nA third Instagram follower offered yet another perspective:\n“In our area, our homeless depend on your fast food …” the message said."},"2":{"tilte":"\n\t\t\tCold storm expected to bring rain to Southern California\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/cold-storm-expected-to-bring-rain-to-southern-california\/","discription":"\nLOS ANGELES — A cold storm out of the gulf of Alaska will generate showers in Southern California and snow in the mountains before clearing out Saturday night, forecasters said.\nThe storm was some 500 miles to the west over the Pacific Ocean Friday morning and expected to slide into Southern California Friday evening, remaining through Saturday, said National Weather Service meteorologist Todd Hall.\nAlong with showers Friday evening, the storm is expected to produce 1 to 3 inches of snow in the San Gabriel Mountains around the 5,000-foot level, far above The Grapevine, meaning no major impacts are expected over the Interstate 5 corridor, Hall said. At sea level, between a tenth and a quarter-inch of rain is expected while in the mountains, the storm could generate between a quarter and a half-inch of rain, he said.\nA UPS cargo jet takes off early Friday, Feb. 21, 2020, from  Burbank Airport amid clouds from an incoming storm. (Photo by Mike Meadows\/Special to the Los Angeles Daily News)\n\nA UPS cargo jet takes off early Friday, Feb. 21, 2020, from  Burbank Airport amid clouds from an incoming storm. (Photo by Mike Meadows\/Special to the Los Angeles Daily News)\n\nClouds from an incoming storm fill the sky early Friday, Feb. 21, 2020, in Burbank. (Photo by Mike Meadows\/Special to the Los Angeles Daily News)\n\nA Southwest jet takes off early Friday, Feb. 21, 2020, from  Burbank Airport amid clouds from an incoming storm. (Photo by Mike Meadows\/Special to the Los Angeles Daily News)\n\nAs of Friday afternoon, no mud slides or debris flows are expected over burn areas, but that could change if a thunderstorm parks itself over slopes denuded by wildfire, Hall said, adding that the chance of thunderstorms is slight late Friday night into Saturday morning.\nPartly cloudy skies were forecast in LA County Friday along with highs of 62 on Mount Wilson; 67 in Avalon; 72 in Palmdale, Lancaster Long Beach and at LAX; 75 in Santa Clarita; 76 in Burbank; 77 in Downtown L.A. and San Gabriel; 78 in Pasadena; and 79 in Woodland Hills; Amid showers, highs will be as much as 17 degrees lower Saturday. But temperatures will then climb and reach 82 Tuesday.\nThe NWS forecast sunny skies in Orange County Friday with highs of 59 degrees on Santiago Peak; 67 in Laguna Beach; 68 in San Clemente and on Ortega Highway at 2,600 feet; 69 in Newport Beach; 73 in Fremont Caanyon; 75 in Trabuco Canyon and Mission Viejo; 76 in Fullerton and Yorba Linda; 77 in Irvine; and 78 in Anaheim. Showers are forecast Saturday, along with highs as much as 16 degrees colder. But highs reaching 75 are expected Tuesday."},"3":{"tilte":"\n\t\t\tCar plows through Ventura Boulevard restaurant\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/car-plows-through-ventura-boulevard-restaurant\/","discription":"\nA three-car accident sent a Honda Accord crashing through the front window of a restaurant Friday morning in Tarzana.\nThe Pita Kitchen restaurant at Reseda and Ventura boulevards was not open a the time, and there were only two workers in the establishment at the time of the crash — and they were not hurt, said a photographer at the scene.\nLos Angeles firefighters move furniture so they can safely remove a Honda Accord that plowed into the Pita Kitchen restaurant Friday, Feb. 21, 2020, after a three-car collision sent the car through the front door of the establishment at Ventura and Reseda boulevards in Tarzana. (Photo by Mike Meadows\/Special to the Los Angeles Daily News)\n\nLos Angeles firefighters remove a car that plowed into the Pita Kitchen restaurant Friday, Feb. 21, 2020, at Ventura and Reseda boulevards in Tarzana. The restaurant was not open at the time, and there were only two workers in the establishment. Nobody in the restaurant was hurt, but the driver was taken to a local hospital with minor injuries. (Photo by Mike Meadows\/Special to the Los Angeles Daily News)\n\nLos Angeles firefighters remove a car that plowed into the Pita Kitchen restaurant Friday, Feb. 21, 2020, at Ventura and Reseda boulevards in Tarzana. The restaurant was not open at the time, and there were only two workers in the establishment. Nobody in the restaurant was hurt, but the driver was taken to a local hospital with minor injuries. It all began with a three-car crash at the intersection that sent this Honda careening into the building. (Photo by Mike Meadows\/Special to the Los Angeles Daily News)\n\nThe woman driving the Honda was taken to a local hospital with minor injuries.\nThe crash occurred about 9:45 a.m., according to media reports."},"4":{"tilte":"\n\t\t\tCoronavirus causing dip in Chinese imports at Ports of L.A., Long Beach\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/coronavirus-causing-dip-in-chinese-imports-at-ports-of-l-a-long-beach\/","discription":"\nThe ongoing closure of factories in China due to the coronavirus continues bringing higher-than-normal cancellations of ships from that country to the Ports of Los Angeles and Long Beach, officials said Friday, Feb. 22 — capping off a trio of events that have combined to slice cargo volumes at the nation’s largest port complex.\n“The virus has had a major impact on the global supply chain,” said Port of L.A. spokesman Phillip Sanfield.\nWhile cargo numbers generally fall off in February due to the Lunar New Year, 2020 has seen a much steeper decline, Sanfield added.\n“Last year (February-March 2019), we had about 17 cancellations,” he said. “Now, there’s been 37 in that same period.”\nAnd L.A.’s sister, the Port of Long Beach, has also seen cancellations skyrocket.\n“Around this time in a typical year, in the weeks following the Lunar New Year, we usually see between 20 and 30 cancelled sailings,” said Noel Hacegaba, deputy executive director of Administration and Operations for the Long Beach port. “So far this year, we’re looking at 50, so that’s about a 67% increase in cancelled sailings (from China).”\nHacegaba was certain about the reason.\nIt is, he said, “100% due to the factory closures” in China brought about by efforts to prevent the further spread of novel coronavirus.\nThe new virus, which causes respiratory disease and spreads from person-to-person contact, was first detected in Wuhan City, in China’s Hubei Province, in late December, according to the \nA ship docked at the Long Beach Container Terminal on Friday was the last one expected to come in there from China for the next nine days; the still-expanding terminal, once completed around 2022, will be able to handle the equivalent of \nIt’s the latest crimp in imports from China, coming on the heels of earlier events that already have slowed trade.\nThe lingering trade war, for example, has continually cut into cargo from China, which makes up about half of all incoming cargo ships in both ports. And even though the Trump Administration announced \nPort officials, in the past, have said the trade war has resulted in supply chains shifting.\nIn January, the\nThen came February and an expected cargo slowdown as China closed factories for a couple of weeks to celebrate the Lunar New Year.\n“In a typical year, we do see about a 5% dip when factories close in China (for the new year),” Hacegaba said, “but we normally recover from that.”\nSanfield, for his part, said 37 cancelled sailings from China portend a significant drop in cargo compared to last year.\n“February is going to be one of the lowest months since 2015, and March will be soft also,” he said.\n“Until there’s some sort of change in the virus numbers and people return to work,” Sanfield added, “it’s a significant impact on everything from toys to appliances to apparel.”\nThe ripple effect, Hacegaba said, could have impacts across the economy until the coronavirus is better understood and the spread of it better contained.\n“We’re cautiously optimistic that the coronavirus situation will get under control in China and in due course, the factories will reopen,” Hacegaba said. “As long as U.S. consumers continue to buy and demand these imports, then that will keep the supply chain fluid.\n“But right now it’s a supply issue,” he added. “Factories are not open and not producing products.”\nOnce factories begin to produce goods again, shipments should resume on a more regular pace, port officials said they believe.\n“There are still some ships coming through (from China),” Sanfield said. “Just fewer of them.”"},"5":{"tilte":"\n\t\t\tThe tale of this Marine in the ‘other’ Iwo Jima photo can, at last, be told\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/the-tale-of-this-marine-in-the-other-iwo-jima-photo-can-at-last-be-told\/","discription":"\nBill Seltzer is the fourth Marine on the right in the photo above, the one with his foot on the stump in front of the American flag flying over Mt. Suribachi on Iwo Jima, 75 years ago this Sunday, Feb. 23.\nWe’ve all seen the iconic picture AP Photographer Joe Rosenthal took of the flag being raised, but not many have seen this one he took of a platoon of Marines who made it to the top, smiling and celebrating in front of the flag.\nThose smiles would soon fade as they made the treacherous journey back down the hill.\nSeltzer was attached to Easy Co., 2nd Battalion, 28th Marines, 5th Marine Division. Thirty-six battle-weary members of his platoon began the assault on Mount Suribachi that day — 18 made it to the top.\nBefore he died in 2016 at 89, he opened up about that day to a close friend, J.L. Prieto, also a Marine, who contacted me on behalf of Bill’s widow, Sallie. If I was planning to write anything on the anniversary of the flag raising, could I please mention Bill, they asked?\nThere were a lot of Marines and Navy men who went up that hill after it was secured, but they didn’t fight their way up, Sallie said. Bill did, and he never laid claim to any fame, notoriety, or the title hero — even shying away from the Silver Star, Bronze Star, and Purple Heart he received for being wounded by a sniper’s bullet on his last day on Iwo.\nWould I mention him? I’d be honored to.\n“During the assault, as you can imagine, he lost friends and watched some die just a few feet away, and others in his arms,” Prieto said. “It’s hard for some to believe that after the carnage, the grueling meat grinder that was Mount Suribachi, the men would have smiles on their faces. They thought the worst was behind them.”\nBut soon after this picture was taken, Seltzer’s platoon was ordered to move out, the fight was not done. The Japanese, who had been lying in wait in the tunnels and spider holes, attacked them from the rear, killing another four men in this picture.\n“As Bill was telling me the story, he was reliving the battle again in his mind,” Pietro said. “He was back in the tunnels and the hours of hand to hand combat that he endured after becoming lost inside them. He talked of the relief he felt of finally getting out.\n“None of that ever escaped him, just like the men who died in that place and would never escape their fate – the men he would always call heroes. Bill believed he was the last, living survivor of the men who fought their way to the top of Mount Suribachi, an honor he held, but lamented, as well. I hope you can understand why.\n“He was that man next to you in the grocery aisle, or driving alongside you down Magnolia or Buena Vista boulevards in his beloved Burbank. You would never suspect that he, along with his comrades and brothers in arms, changed the world.”\nSeltzer came home to a 32-year career with NASA, helping put John Glenn and Alan Shepard into space, and piloting his own plane at Whiteman Airport. While at NASA, he also got a P.H.D in medical clinical engineering from UCLA, helping develop the CT scanner and MRI technology.\nOn the seventh day, he rested.\nWith all his accomplishments, the one he was most proud of, and yes, lamented, as well, was standing in front of that American flag on Mount Siribachi with his Marine platoon, he told his wife and Pietro.\nAll of them smiling on the outside for Rosenthal’s camera, but crying inside for their buddies who didn’t make it to the top.\nThe real heroes, Bill Seltzer called them."},"6":{"tilte":"\n\t\t\tInstead of another gated community, Porter Ranch and Chatsworth get 257 acres of lovely, preserved open space\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/instead-of-another-gated-community-porter-ranch-and-chatsworth-get-257-acres-of-lovely-preserved-open-space\/","discription":"\nIt was once slated to become yet another suburban gated community with a bucolic name in the northern reaches of Porter Ranch and Chatsworth.\nBut on Friday, there was little doubt that the 257-acre swath of hills near the Aliso Canyon Gas Storage Facility was to remain what it has long been — the home of the oaks, mountain lions, southern spotted owla and other flora and fauna.\nA blessing ceremony by the Tataviam tribe marked the occasion, a dedication of the new parkland attended by state and county officials who had pooled their resources to buy the property last November from a developer that wanted to build a gated community of 188 luxury homes on that land.\nThe housing development was to be called Hidden Creeks Estates. Now the name Hidden Creeks is being used to refer to the newly established parkland in an unincorporated part of Porter Ranch, at Browns Canyon Road north of the 118 Freeway at Desoto Avenue.\nA ribbon-cutting ceremony on Friday, February 22, 2020,  officially opened the 257-acre, $6.7 million Hidden Creeks parkland in the Chatsworth Hills.  The space is located in Browns Canyon Road above the 118 Freeway at DeSoto Avenue.  Speakers included Paul Edelman, Mountains Recreation and Conservation Authority, Joseph T. Edmiston, Executive Director, Santa Monica Mountains Conservancy, Craig Campbell, Starwood Land Advisors, Rudy Ortega Jr., Tribal President, Fernando Tataviam Band of Mission Indians, Irma Munoz, Chair, Santa Monica Mountains Conservancy, John Donnelly, Executive Director, California Wildlife Conservation Board, Kathryn Barger, Los Angeles County Supervisor, 5th District and Henry Stern, California State Senator, 27th District. (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nA Tataviam blessing was given by Alan Salazar.  A ribbon-cutting ceremony on Friday, February 22, 2020,  officially opened the 257-acre, $6.7 million Hidden Creeks parkland in the Chatsworth Hills.  The space is located in Browns Canyon Road above the 118 Freeway at DeSoto Avenue.  (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nA Tataviam blessing and song were given by Rudy Ortega Jr., Alan Salazar and Mark Villasenor.  A ribbon-cutting ceremony on Friday, February 22, 2020,  officially opened the 257-acre, $6.7 million Hidden Creeks parkland in the Chatsworth Hills.  The space is located in Browns Canyon Road above the 118 Freeway at DeSoto Avenue.  (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nA ribbon-cutting ceremony on Friday, February 22, 2020,  officially opened the 257-acre, $6.7 million Hidden Creeks parkland in the Chatsworth Hills.  The space is located in Browns Canyon Road above the 118 Freeway at DeSoto Avenue.  (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nA couple look at maps of the area before the ceremony.  A ribbon-cutting ceremony on Friday, February 22, 2020,  officially opened the 257-acre, $6.7 million Hidden Creeks parkland in the Chatsworth Hills.  The space is located in Browns Canyon Road above the 118 Freeway at DeSoto Avenue.  (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nA ribbon-cutting ceremony on Friday, February 22, 2020,  officially opened the 257-acre, $6.7 million Hidden Creeks parkland in the Chatsworth Hills.  The space is located in Browns Canyon Road above the 118 Freeway at DeSoto Avenue.  (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nKathryn Barger, Los Angeles County Supervisor, 5th District , speaks during the ceremony.  A ribbon-cutting ceremony on Friday, February 22, 2020,  officially opened the 257-acre, $6.7 million Hidden Creeks parkland in the Chatsworth Hills.  The space is located in Browns Canyon Road above the 118 Freeway at DeSoto Avenue.  (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nHenry Stern, California State Senator, 27th District speaks during the ceremony.  A ribbon-cutting ceremony on Friday, February 22, 2020,  officially opened the 257-acre, $6.7 million Hidden Creeks parkland in the Chatsworth Hills.  The space is located in Browns Canyon Road above the 118 Freeway at DeSoto Avenue.  (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nA ribbon-cutting ceremony on Friday, February 22, 2020,  officially opened the 257-acre, $6.7 million Hidden Creeks parkland in the Chatsworth Hills.  The space is located in Browns Canyon Road above the 118 Freeway at DeSoto Avenue.  Speakers included Joseph T. Edmiston, Executive Director, Santa Monica Mountains Conservancy, Rudy Ortega Jr., Tribal President, Fernando Tataviam Band of Mission Indians, Irma Munoz, Chair, Santa Monica Mountains Conservancy, John Donnelly, Executive Director, California Wildlife Conservation Board, Kathryn Barger, Los Angeles County Supervisor, 5th District and Henry Stern, California State Senator, 27th District. (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nLupine grows next to a trail.  A ribbon-cutting ceremony on Friday, February 22, 2020,  officially opened the 257-acre, $6.7 million Hidden Creeks parkland in the Chatsworth Hills.  The space is located in Browns Canyon Road above the 118 Freeway at DeSoto Avenue.  (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nA ribbon-cutting ceremony on Friday, February 22, 2020,  officially opened the 257-acre, $6.7 million Hidden Creeks parkland in the Chatsworth Hills.  The space is located in Browns Canyon Road above the 118 Freeway at DeSoto Avenue.  (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nA ribbon-cutting ceremony on Friday, February 22, 2020,  officially opened the 257-acre, $6.7 million Hidden Creeks parkland in the Chatsworth Hills.  The space is located in Browns Canyon Road above the 118 Freeway at Desoto Avenue.  (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nIt joins 11,000 acres of open space also under the care and possession of the Mountains and Recreation Conservation Authority. The Hidden Creeks land belongs to the Santa Susana Pass intermountain range habitat linkage that connects the Simi Hills to the Santa Susana Mountains, according to the state.\nEfforts to preserve the land has been more than a decade in the making, but the $6.7 million purchase deal was finally struck just a month after the Saddleridge Fire had raced uncomfortably close to the natural gas storage that had experienced a massive, months-long leak in 2015, and several gated communities in Porter Ranch, some still under construction.\nThe county paid $1.6 million, the state footed $4.9 million and the MRCA and the Santa Monica Mountains Conservancy put in $200,000 to buy the land.\nState Sen. Henry Stern, who was on hand Friday to mark the opening of the park, \n“By protecting Hidden Creeks, the board (\nCounty Supervisor Kathryn Barger \nThe Hidden Creeks Estates housing project had long faced opposition, and efforts to purchase the land have spanned more than a decade. Last January, the Los Angeles Department of City Planning "},"7":{"tilte":"\n\t\t\tWhere to get a glass of Pliny the Younger before it’s all gone\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/where-to-get-a-glass-of-pliny-the-younger-before-its-all-gone\/","discription":"\nIt’s that time of year again — when hop heads go crazy for the release of Pliny the Younger, Russian River Brewing Company’s award-winning Triple IPA that’s 10.25% alcohol. The limited edition \nIf you’re looking this weekend and beyond, here’s a sampling from around the region.\nGet a glass of Pliny at $15 for 10 ounces, one per customer. Come in around 9:30 a.m. on Saturday, Feb. 22 to wait in line, the \n Opens at noon on Saturday, Feb. 29 offering  a 10-ounce pour for $10, limit one per person. Go early, they only have one 15-gallon keg is all they have. 6124 Hollywood Blvd., Hollywood, 323-464-2337; \n Will be pouring Pliny Monday, Feb. 24, through Wednesday, Feb. 26, at all their locations to those who buy tickets on \n The Woodland Hills location will host a “Five-Course Beer vs. Wine Dinner” on Monday, Feb. 24, and for $85 per person diners will get a four-ounce pour of Pliny the Younger. The following day at 4 p.m. there will be a keg tapping with 5-ounce pours for $5, limit one per person, but you get to keep a commemorative pint glass. The Sherman Oaks location will offer the same keg tapping deal on Wednesday, Feb. 26. 22901 Ventura Blvd., Woodland Hills, 818-876-0105; 14058 Ventura Blvd., Sherman Oaks, 818-501-0234, \nCraft brew fans go crazy this time of year for the release of Pliny the Younger, Russian River Brewing Company’s award-winning Triple IPA that’s 10.25 percent alcohol. Haven Craft Kitchen + Bar will pour the beer at two special brunches this weekend. (Courtesy of Haven)\n\nCraft brew fans go crazy this time of year for the release of Pliny the Younger, Russian River Brewing Company’s award-winning Triple IPA that’s 10.25 percent alcohol. Haven Craft Kitchen + Bar will pour the beer at two special brunches this weekend. Seen here, Pliny served in a commemorative glass. (Courtesy of Haven)\n\n \n Two \nTickets go on sale at 10 a.m. Sunday, Feb. 23, for a pour of Pliny and a  keepsake glass. Buy $15 tickets at the taprooms in Rancho Santa Margarita or Ladera Ranch (the San Juan Capistrano location is not participating). Show up at 4:30 p.m. on Monday, Feb. 24, or Tuesday, Feb. 25, to get your drink at the Rancho Santa Margarita location only.\n The Riverside gastropub \n Is selling tickets ($13) for a nine-ounce glass of Pliny, but Claremont, Redlands and other locations are already sold out. They’re still available through "},"8":{"tilte":"\n\t\t\tGarden events in the San Fernando Valley, LA area, Feb. 21-28\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/garden-events-in-the-san-fernando-valley-la-area-feb-21-28\/","discription":"\n \n \nGreen thumb or not, it’s fun to learn about plants whether it’s at a garden class or a visit to a botanic garden.\n \n \nNative plants and seeds for sale including bulbs, manzanitas and sages, 8:30-4:30 p.m. 10459 Tuxford St., Sun Valley. 818-768-1802. \n \n \n Share backyard produce, 9:30 a.m., followed by gardening tips. Woodland Hills Branch Library, 22200 Ventura Blvd. 818-226-0017. \n Master Gardener and author Christy Wilhelmi discusses the topic, 11 a.m. Wilhelmi signs “Gardening for Geeks” following the talk. Fig Earth Supply, 3577 N. Figueroa St., Los Angeles. 323-224-3938. \n \n \n One, free rose plant in a pulp pot (one per household while supplies last), beginning 8 a.m. Feb. 29 at all stores. The event also includes 20 percent off regular priced items (there are some restrictions) and a drawing for a free landscape design (1:30 p.m. and must be present to win). Check website for locations. \n Master Gardener Yvonne Savio discusses the topic plus techniques and plants appropriate for southern California gardens at a meeting of the Malibu Garden Club, 9:30 a.m. March 4. Point Dume Club House, 29500 Heathercliff Drive. Glen, 310-592-1013. \n Professional nature photographer \n The recorded hotline is scheduled to begin on March 6. 818-768-1802, Ext. 7. \n “Right Plant, Right Place,” with Lili Singer, 1 p.m. March 7 ($35); “Native Plant Garden Maintenance,” with Tim Becker, 1:30 p.m. March 14 ($35). Reservations required. 10459 Tuxford St., Sun Valley. 818-768-1802. \n Wildflower bloom is mid-March through April, according to the website (varies per year). The Jan S. Pinheiro Interpretive Center is open from March 1 to Mother’s Day (May 10 this year). Hours of the reserve: sunrise-sunset daily. Rules include: stay on official trails; no wildflower picking; no drones; no dogs except service dogs (recommended to have distinguishing marker on service dog). Parking $10. 15101 Lancaster Road, Lancaster. Poppy Reserve Hotline: 661-724-1180. \n Master Gardeners Barbara Dallis and Rose Scordino lead classes for beginners on how to plan and plant a vegetable garden, 9 a.m.-1 p.m. March 21 and 28 and April 4. Fee $20 for one class; $55 for all three. Register by phone of email: rosescordino@gmail.com. Community Gardens of Santa Clarita at Central Park,27150 Bouquet Canyon Road. 661-713-7003. \n \n \n Guided tours of the house, 11 a.m.-3 p.m. Friday-Saturday. Garden tour, 10 a.m. Friday. Admission $7; $2 ages 6-16; cash only. 23200 Pacific Coast Highway, Malibu. 310-456-8432. \n Specialty gardens include bird habitat, butterfly, desert, rare fruit, herb, orchard and tranquility. Hours: sunrise-sunset daily. Closed on July 4; heavy rain and if trails are muddy (trails may be muddy for several days after rain). Children’s garden: 11 a.m.-3 p.m. Sunday. Free admission. 400 W. Gainsborough Road, Thousand Oaks. 805-494-7630. \n Specialty gardens include ancient forest, California natives, camellias, Japanese, lilacs, oak forest and rose. Hours: 9 a.m.-5 p.m. daily (except closed on Christmas). Admission $9; $6 seniors and students; $4 ages 5-12. 1418 Descanso Drive, La Cañada Flintridge. 818-949-4200. \n Specialty gardens include English perennial, French, Italian, Japanese, mission courtyard and rose. Hours: 9 a.m.-5 p.m. Tuesday-Sunday. Closed on major holidays. Free. 2001 E. Thousand Oaks Blvd., Thousand Oaks. 805-557-1135. \n Tours of grounds and the Central Garden. Check website for hours. Free admission. Parking $20; $15 after 3 p.m. Getty Center Drive at North Sepulveda Boulevard, Los Angeles. 310-440-7300. \n Specialty gardens include Australian, children’s, Chinese, desert, herb, Japanese, palm and rose. Hours: 10 a.m.-5 p.m. daily except closed on Tuesdays. Closed on New Year’s Day, July 4, Thanksgiving, Christmas Eve and Christmas Day. Admission $25\/$29; $21\/$24 ages 65 and older and ages 12-18; $13 ages 4-11 (first price is weekday; second is weekend). 1151 Oxford Road, San Marino. 626-405-2100. \n Stroll through the “dry” Zen meditation and the “wet” gardens. Hours: 11 a.m.-4 p.m. Monday-Thursday; 10 a.m.-4 p.m. Sunday. Guided tours by advance reservation Monday-Thursday mornings. Call to check for unscheduled closures; closed if it rains 24 hours before opening and during open hours; closed on all Los Angeles city holidays. Admission $5; $3 for ages 62 and older and ages 12 and younger (cash only). 6100 Woodley Ave., Van Nuys. 818-756-8166. \n Check website for rules of conduct. Hours: 9 a.m.-4:30 p.m. Tuesday-Saturday; noon-4:30 p.m. Sunday. Closed Mondays, major holidays and heavy rain conditions. 17190 Sunset Blvd., Pacific Palisades. 310-454-4114. \n Specialty gardens include aquatic, herb, perennial, rose, southern Californian landscapes, rainbow serpent, water conservation and a tropical greenhouse. Historical section includes the Queen Anne Cottage and Santa Anita Depot. Hours: 9 a.m.-4:30 p.m. daily except closed on Christmas. Admission $9; $6 for ages 62 and older and students; $4 for ages 5-12. Tram tour: noon, 1, 2 and 3 p.m. Saturday-Sunday; $5. 301 N. Baldwin Ave., Arcadia. 626-821-3222. "},"9":{"tilte":"\n\t\t\tCeremony touts 8-story senior-living community coming to Woodland Hills\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/20\/ceremony-touts-8-story-senior-living-community-coming-to-woodland-hills\/","discription":"\nA groundbreaking ceremony was held on Thursday, February 20, 2020, for the first senior living community in Woodland Hills, CA.  The Variel, at 6233 Variel Ave. will be an Eight-story upscale rental mid-rise in Warner Center, expected to open in winter 2021.  (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nA groundbreaking ceremony was held on Thursday, February 20, 2020, for the first senior living community in Woodland Hills, CA.  The Variel, at 6233 Variel Ave. will be an Eight-story upscale rental mid-rise in Warner Center, expected to open in winter 2021.  (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nA groundbreaking ceremony was held on Thursday, February 20, 2020, for the first senior living community in Woodland Hills, CA.  The Variel, at 6233 Variel Ave. will be an Eight-story upscale rental mid-rise in Warner Center, expected to open in winter 2021.  (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nCouncilmember, Bob Blumenfield, speaks during the ceremony.  A groundbreaking ceremony was held on Thursday, February 20, 2020, for the first senior living community in Woodland Hills, CA.  The Variel, at 6233 Variel Ave. will be an Eight-story upscale rental mid-rise in Warner Center, expected to open in winter 2021.  (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nMichael Byrne, W.E. O’Neil Construction, speaks during the ceremony.  A groundbreaking ceremony was held on Thursday, February 20, 2020, for the first senior living community in Woodland Hills, CA.  The Variel, at 6233 Variel Ave. will be an Eight-story upscale rental mid-rise in Warner Center, expected to open in winter 2021.  (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nJosh Johnson, West Bay Senior Living, speaks during the ceremony.  A groundbreaking ceremony was held on Thursday, February 20, 2020, for the first senior living community in Woodland Hills, CA.  The Variel, at 6233 Variel Ave. will be an Eight-story upscale rental mid-rise in Warner Center, expected to open in winter 2021.  (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nA groundbreaking ceremony was held on Thursday, February 20, 2020, for the first senior living community in Woodland Hills, CA.  The Variel, at 6233 Variel Ave. will be an Eight-story upscale rental mid-rise in Warner Center, expected to open in winter 2021.  (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nPeter Petraglia, VTBS Architects, speaks during the ceremony.  A groundbreaking ceremony was held on Thursday, February 20, 2020, for the first senior living community in Woodland Hills, CA.  The Variel, at 6233 Variel Ave. will be an Eight-story upscale rental mid-rise in Warner Center, expected to open in winter 2021.  (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nA groundbreaking ceremony was held on Thursday, February 20, 2020, for the first senior living community in Woodland Hills, CA.  The Variel, at 6233 Variel Ave. will be an Eight-story upscale rental mid-rise in Warner Center, expected to open in winter 2021.  (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nAdam Arnold, Senior Development Manager, speaks during the ceremony.  A groundbreaking ceremony was held on Thursday, February 20, 2020, for the first senior living community in Woodland Hills, CA.  The Variel, at 6233 Variel Ave. will be an Eight-story upscale rental mid-rise in Warner Center, expected to open in winter 2021.  (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nA groundbreaking ceremony was held on Thursday, February 20, 2020, for the first senior living community in Woodland Hills, CA.  The Variel, at 6233 Variel Ave. will be an Eight-story upscale rental mid-rise in Warner Center, expected to open in winter 2021.  (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nA groundbreaking ceremony was held on Thursday, February 20, 2020, for the first senior living community in Woodland Hills, CA.  The Variel, at 6233 Variel Ave. will be an Eight-story upscale rental mid-rise in Warner Center, expected to open in winter 2021.  (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nA groundbreaking ceremony was held on Thursday, February 20, 2020, for the first senior living community in Woodland Hills, CA.  The Variel, at 6233 Variel Ave. will be an Eight-story upscale rental mid-rise in Warner Center, expected to open in winter 2021.  (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nA groundbreaking ceremony was held on Thursday, February 20, 2020, for the first senior living community in Woodland Hills, CA.  The Variel, at 6233 Variel Ave. will be an Eight-story upscale rental mid-rise in Warner Center, expected to open in winter 2021.  (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nPatrick McGonigle, South Bay Partners, speaks during the ceremony.  A groundbreaking ceremony was held on Thursday, February 20, 2020, for the first senior living community in Woodland Hills, CA.  The Variel, at 6233 Variel Ave. will be an Eight-story upscale rental mid-rise in Warner Center, expected to open in winter 2021.  (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nYoung Ben McGonigle helps his dad during the ceremony.  A groundbreaking ceremony was held on Thursday, February 20, 2020, for the first senior living community in Woodland Hills, CA.  The Variel, at 6233 Variel Ave. will be an Eight-story upscale rental mid-rise in Warner Center, expected to open in winter 2021.  (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\n \nAn array of private and public dignitaries turned out as a groundbreaking ceremony was held on Thursday, Feb. 20, for The Variel, an eight-story senior living community in Woodland Hills’ Warner Center.\nThe complex, located at 6233 Variel Avenue, is expected to include 215 independent living units, plus 94 assisted-living dwellings and a memory care area that can accommodate 27 people.\nLos Angles City Councilmember Bob Blumenfield of District 3 was joined by various construction and development players involved in the project. Among the speakers were:\nThe mixed-use center, scheduled to open in Winter next year, will also feature the Warner’s Restaurant, the 101 Bistro, The Tavern and a Zynergy Juice Bar.\n \n \n "},"10":{"tilte":"\n\t\t\tNorth Hollywood ‘navigation center,’ a first step to housing, will provide showers, storage for homeless\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/20\/north-hollywood-navigation-center-a-first-step-to-housing-will-provide-showers-storage-for-homeless\/","discription":"\nHope Of The Valley’s Ken and Laurie Craft speak with Los Angeles Mayor Eric Garcetti and Councilmember Paul Krekorian during the opening of the City of Los Angeles’ first Homeless Navigation Center in North Hollywood, Thursday, February 20, 2020. The center will offer 120 storage bins, showers, and access to service providers to assist with housing for homeless people.  (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nStorage bins during the opening of the City of Los Angeles’ first Homeless Navigation Center in North Hollywood, Thursday, February 20, 2020. The center will offer 120 storage bins, showers, and access to service providers to assist with housing for homeless people.  (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nThe grand opening of the City of Los Angeles’ first Homeless Navigation Center in North Hollywood, Thursday, February 20, 2020. The center will offer 120 storage bins, showers, and access to service providers to assist with housing for homeless people.  (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nLos Angeles Mayor Eric Garcetti speaks as  Council-member Paul Krekorian looks on during the opening of the City of Los Angeles’ first Homeless Navigation Center in North Hollywood, Thursday, February 20, 2020. The center will offer 120 storage bins, showers, and access to service providers to assist with housing for homeless people.  (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nLandscapers put the finishing touches on a navigation center for the homeless on a former day laborer site on Sherman Way in North Hollywood on Friday, February 14, 2020. Hope of the Valley Rescue Mission will manage the site when it opens. (Photo by Sarah Reingewirtz, Pasadena Star-News\/SCNG)\n\nHope Of The Valley’s Ken and Laurie Craft listen as Los Angeles Mayor Eric Garcetti speaks during the opening of the City of Los Angeles’ first Homeless Navigation Center in North Hollywood, Thursday, February 20, 2020. The center will offer 120 storage bins, showers, and access to service providers to assist with housing for homeless people.  (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nA new navigation center for the homeless is being built on a former day laborer site on Sherman Way in North Hollywood on Friday, February 14, 2020. Hope of the Valley Rescue Mission will manage the site when it opens. (Photo by Sarah Reingewirtz, Pasadena Star-News\/SCNG)\n\nHope Of The Valley’s Laurie Craft speaks as Los Angeles Council-member Paul Krekorian looks on during the opening of the City of Los Angeles’ first Homeless Navigation Center in North Hollywood, Thursday, February 20, 2020. The center will offer 120 storage bins, showers, and access to service providers to assist with housing for homeless people.  (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nBathrooms during the opening of the City of Los Angeles’ first Homeless Navigation Center in North Hollywood, Thursday, February 20, 2020. The center will offer 120 storage bins, showers, and access to service providers to assist with housing for homeless people.  (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nLos Angeles Mayor Eric Garcetti speaks as  Council-member Paul Krekorian looks on during the opening of the City of Los Angeles’ first Homeless Navigation Center in North Hollywood, Thursday, February 20, 2020. The center will offer 120 storage bins, showers, and access to service providers to assist with housing for homeless people.  (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nBathrooms at the navigation center which Hope of the Valley Rescue Mission will manage at a former day laborer site on Sherman Way in North Hollywood on Friday, February 14, 2020. (Photo by Sarah Reingewirtz, Pasadena Star-News\/SCNG)\n\nLos Angeles Council-member Paul Krekorian speaks during the opening of the City of Los Angeles’ first Homeless Navigation Center in North Hollywood, Thursday, February 20, 2020. The center will offer 120 storage bins, showers, and access to service providers to assist with housing for homeless people.  (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nLandscapers and a fencing company put the finishing touches on a new navigation center for the homeless which is being built on a former day laborer site on Sherman Way in North Hollywood on Friday, February 14, 2020. Hope of the Valley Rescue Mission will manage the site when it opens. (Photo by Sarah Reingewirtz, Pasadena Star-News\/SCNG)\n\nLos Angeles Mayor Eric Garcetti and Council-member Paul Krekorian during the opening of the City of Los Angeles’ first Homeless Navigation Center in North Hollywood, Thursday, February 20, 2020. The center will offer 120 storage bins, showers, and access to service providers to assist with housing for homeless people.  (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nMembers of the Fullerton Tri-Parish\/Diocesan Collaborative march past a homeless person’s bike as they circle Fullerton City Hall before the City Council Meeting in support of the final approval of the conditional use permit for the 150 bed Recuperative Care\/Navigation Center in Fullerton on Tuesday, Jan. 21, 2020. (Photo by Kevin Sullivan, Orange County Register\/SCNG)\n\nHope Of The Valley’s Ken and Laurie Craft speak with Los Angeles Mayor Eric Garcetti during the opening of the City of Los Angeles’ first Homeless Navigation Center in North Hollywood, Thursday, February 20, 2020. The center will offer 120 storage bins, showers, and access to service providers to assist with housing for homeless people.  (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nLos Angeles Mayor Eric Garcetti speaks as  Council-member Paul Krekorian looks on during the opening of the City of Los Angeles’ first Homeless Navigation Center in North Hollywood, Thursday, February 20, 2020. The center will offer 120 storage bins, showers, and access to service providers to assist with housing for homeless people.  (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nLos Angeles Council-member Paul Krekorian speaks during the opening of the City of Los Angeles’ first Homeless Navigation Center in North Hollywood, Thursday, February 20, 2020. The center will offer 120 storage bins, showers, and access to service providers to assist with housing for homeless people.  (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nVisitors look at storage bins during the opening of the City of Los Angeles’ first Homeless Navigation Center in North Hollywood, Thursday, February 20, 2020. The center will offer 120 storage bins, showers, and access to service providers to assist with housing for homeless people.  (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nLandscaper Tony Sandoval looks over landscaping plans as he walks through a new navigation center for the homeless on a former day laborer site on Sherman Way in North Hollywood on Friday, February 14, 2020. Hope of the Valley Rescue Mission will manage the site when it opens. (Photo by Sarah Reingewirtz, Pasadena Star-News\/SCNG)\n\nConsidered the first step in a journey to becoming housed again, a new center that includes showers, bathrooms and storage bins will be available for homeless people in North Hollywood early next month.\nAs the city inches closer to opening more shelters and affordable housing in the San Fernando Valley, the new $5.7 million facility at 11839 Sherman Way, near Lankershim Boulevard, will serve as a “navigation center,” a starting point to getting sheltered, employed and eventually housed.\nThe facility is being billed by elected officials as the first of its kind in the city. But it took significant convincing over the past few years to get it built.\n“Over the years I’ve had people tell me that this isn’t a solution, that the problem is much bigger than this, and that this is just a band-aid,” said Laurie Craft of Hope of Valley, the operator of the facility.\nBut Craft said that even a band-aid serves a purpose — to “facilitate and promote healing” and to prevent people from deteriorating into even worse condition.\nCraft said that while serving homeless people over the years, she has seen “transformations that are literally unbelievable — people that had been living on the streets chronically homeless for many many years who are now productive individuals and part of our community.”\n“This navigation center will be a place where people will be welcomed and treated with the dignity and respect that they deserve,” she said. “Living on our streets, is sometimes overwhelming and seems like an insurmountable task.”\nIn recent years, the focus has centered primarily on finding or creating housing. But experts say housing is the end of the tunnel — and the more immediate, day-to-day needs of homeless people, have recently attracted more attention.\nCraft spoke at the center’s Thursday, Feb. 20 grand opening. The event was populated by public officials — among them Mayor Eric Garcetti — each contributing their remarks to cheer the occasion, a spark of hope during a week in which Gov. Gavin Newsom declared the state’s enduring homeless crisis “a disgrace.”\nCouncilman Paul Krekorian spearheaded the project and shepherded the Proposition HHH and state dollars toward getting it built. He said the site will also eventually house a “day laborer” center and hinted that some of the patrons of the facility might also be able to take advantage landing work via those services.\nWhen the facility opens its doors on March 9, people who walk in will be able to sign up for the Los Angeles Homeless Services Authority’s coordinated entry-system pipeline, and for a waiting list to get matched with housing assistance and other services. Two case managers, and eventually a housing navigator, will work out of one of the trailers.\nThe operators of the facility are expecting that the five showers and five bathrooms, along with a room of 120 trash bins, re-purposed as storage containers, will have significant allure for those now living nearby on the streets.\nOfficials said there will also be limited shuttle service, mainly to transport people from the facility to their various appointments. A bus stop stands right outside the facility, too.\nA few miles away from the center, at an encampment near the Orange Line, 56-year-old Constance Gervasoni was helping a friend collect several articles of clothing, before Los Angeles sanitation crews were scheduled to perform a clean-up in the area.\nThe idea of storage bins nearby sounded promising to her, because she has lost belongings repeatedly, she said. It is like starting over each time, she said.\nShe’s lost phone chargers, clothes and other items, she said, and her husband recently lost artwork he created. Sometimes such items are stolen, she said, and other times they get thrown away or picked up when a cleanup crew comes through.\nStorage options are limited for the homeless and often unavailable at shelters, making it tougher to persuade homeless people to seek help there.\nGervasoni has tried a few storage solutions of her own. She said this is her third time paying the “first month” $1 promotional fee at a storage site, but she’ll have to move her possessions out when the charges kick in for the “real month.”\n“It would be such a relief to have storage, for real,” she said.\nThe availability of showers at the center seems promising, too, Gervasoni said. She is “filthy,” she said, and has not showered for a month, but is reluctant to wait in line for the shower at Hope of the Valley’s day center in Van Nuys for fear that her belongings will be taken while she is away.\nAs for the opportunity to land a job, she said that was also an attractive possibility. And the day laborer center intrigued her.\n“You want to put in a little, if you want to get a little,” she said. “And if you don’t, then you’re not part of the human course. You’re not part of mankind.”"},"11":{"tilte":"\n\t\t\tWest Valley board member faces two challengers in high-spending LAUSD election\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/14\/west-valley-board-member-faces-two-challengers-in-high-spending-lausd-election\/","discription":"\nFour seats are up for grabs on the seven-member \nThe high stakes are apparent in outside spending dollar amounts from the two usual power players, teachers union United Teachers Los Angeles and the California Charter Schools Association. The latter is hoping to reshuffle a union majority block on the school board.\nOne of such union-friendly seats at play is the one occupied by Scott Schmerelson, who oversees 106 total elementary, middle and high schools in the West San Fernando Valley. His board district three seat, which includes Chatsworth, parts of Woodland Hills, Northridge, Granada Hills, parts of Van Nuys and Sherman Oaks, faces two challengers.\nIf a candidate fails to win more than 50% of the vote in March, the top two finishers advance to a runoff election. Check which board district represents your neighborhood school \nAlongside district Superintendent Austin Beutner, board members oversee daily operations of the massive school district with a $7 billion budget. The position earns a yearly salary of $125,000 plus retirement and health benefits.\n: Schmerelson was first elected to his seat in 2015 after defeating then-incumbent city prosecutor Tamar Galatzan. He began his career as a Spanish language teacher in Philadelphia, first entering LAUSD as a teacher at Virgil Middle School. He worked his way up to principal at Lawrence Middle in Chatsworth and later Johnnie L. Cochran, Jr. Middle in South L.A.\nSchmerelson was an early board members to express support for striking teachers and is staunchly backed by LAUSD’s powerful teachers union, reflected in the over $400,000 of independent expenditures spent on his behalf by United Teachers Los Angeles. He has $24,105 cash raised on hand.\n: An LAUSD parent, Koziatek is community outreach manager for Granada Hills Charter High School and chair of Valley Industry Commerce Association’s education committee. With $20,121 cash on hand, she has received $400,000 of support in independent expenditures from the California Charter Schools Association, the Sacramento-based advocacy organization has spent even more opposing Schmerelson’s candidacy.\n: This election marks the latest of Badger’s several runs for local public office in recent years. The parent of two LAUSD students runs the Minority Outreach Committee, a nonpartisan non-profit that aims to bridge gaps between communities of color and schools.\n: Of all LAUSD grade levels, 43.9% of students met state standards in English and 33.47% in math for the 2018-19 school year. Asked how he plans to lift student achievement, Schmerelson said will advocate for parent representatives at every school in the district to increase parent engagement. Koziatek pointed to her experience at Granada Hills Charter High, where she used technological tools to engage families and chart more student data. Badger said the district has failed children for lack of good leadership, and raised issues of special needs education and school security.\n: According to 2018-19 budget reports, LAUSD received $15,537 per-pupil which, depending on which way you slice the data, puts California in the lower middle or bottom tier of public school funding nationwide. As a delegate to the California School Board Association, Schmerelson said he intends to advocate for higher per-pupil state funding in Sacramento that will enable the additional hiring of school nurses, librarians and counselors. Koziatek echoed the need for more funding, and referred to her school budgetary experience. Badger suggested the district needs to look inward at streamlining the budget before asking taxpayers to open their pockets.\n: LAUSD is home to 320 charter schools this 2019-20 school year, a number that served as a flashpoint during last year’s teachers strike. Recently passed Assembly Bill 1505 gave California school boards more authority to inhibit the opening of new ones. Schmerelson has expressed a need to give traditional public schools “the same authority” as charter schools before approving new charters in the district. Koziatek said she would make decisions on charter schools based on how a school has shown it can serve students. Badger described herself as being “okay” with charters as long as they’re adhering to the same rules and regulations as traditional public schools."},"12":{"tilte":"\n\t\t\tLAPD to embed 10 officers at Pacoima’s San Fernando Gardens through latest community-policing project\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/20\/lapd-to-embed-10-officers-at-pacoimas-san-fernando-gardens-through-latest-community-policing-project\/","discription":"\nThe San Fernando Valley’s only public housing project soon will be home to a new kind of beat cop, and city officials hope the program will show the Los Angeles Police Department’s radical experiment with community policing is still working.\nSan Fernando Gardens — a 1,500-resident, World War II-era development of low-slung, cream-colored apartment blocks located in the heart of Pacoima — \nCouncilwoman Monica Rodriguez, LAPD Chief Michel Moore and other officials will launch the program with a community event at the project. They expect hundreds of residents from around the area to turn out for food and games.\nIn a statement, Rodriguez’s office said the 10 CSP officers and a supervisor will be “tasked with developing positive police-community relationships through sports and educational programs, addressing crime trends in collaboration with community members, and exercising law enforcement duties through a long-term problem-solving approach.”\nThe San Fernando Gardens CSP is the city’s ninth. The first partnerships were set up in L.A.’s most violent housing projects, mostly in South L.A.\nThe idea was to embed a team of officers in the projects to talk to residents and solve quality of life issues. That could mean anything from starting youth sports programs to fixing lighting on darkened streets to chasing away violent, stray dogs.\nThe program is a huge departure from LAPD’s traditional response to crime in low-income, majority black and Latino communities.\nTwenty-five years ago, LAPD employed a boots-on-the-ground strategy, swarming areas around housing projects, or other crime-plagued communities, at certain times in an effort to prevent shootings and killings.\nViolent arrests might follow, as well as frequent stops of innocent people. Those tactics alienated residents.\n“If we saw someone committing a crime, you put handcuffs on them and you take them to jail,” said Captain David Grimes, who commands LAPD’s Foothill Division covering Pacoima.\n“What we figured out over the years was that arresting people and putting them in jail doesn’t make crime go away.”\nOfficers assigned to the CSP will still make arrests if they witness someone committing a violent crime. But Grimes gave the example of a teenage tagger seen spray-painting graffiti on a house or a wall — the goal now is to divert that child to more resources, not put them behind bars.\nNumerous L.A. officials, including Mayor Eric Garcetti and Chief Moore, have become believers in the program. The first four CSPs were credited with helping reduce gang homicides in projects like Nickerson Gardens and Jordan Downs to nearly zero in most years after they were set up.\n“I am sold on this,” Grimes said of the program. “I believe it. I’ve been to enough meetings. I’m convinced it works.”\nWhile San Fernando Gardens has been mostly free of intense gang violence since the early 2000s, crime is still common. Poverty and drugs in the project itself, and the neighborhoods nearby, are still issues.\nOn most days, however, the Gardens themselves are mostly quiet. Still, Grimes said he has seen worrying trends in the crime rate for the area. Part 1 crimes, which include most violent crimes, overall are up nearly double in the projects from 2014 to 2018.\nThere were no killings in the Gardens last year, and just one the year before. But other crimes — aggravated assault, domestic violence, burglaries, robberies, etc. — are on the rise."}}