{"_id": "5ec956f55019da268c469ee9", "img_description": "ay PO SS\n\nra Rae A ELE LEC\n\nEXPRESSION OF INTEREST\nFOR SELECTION OF CONSULTANTS\n\nThe National Skills University (NSU), Islamabad has set an agenda of reforms, roadmap, and targets for\nbringing qualitative and quantitative improvement in the institution. in order to develop a strategy in this regard,\nthere is need for an expert Consultants in the key area of administration viz Human Resource, Finance,\nAcademics and Audit. Applications are invited for selection of Consultants on short term basis, initially for six\nmonths, as under:-\n\nPositions:\n\n     \n  \n \n   \n    \n \n    \n  \n   \n \n   \n \n  \n \n \n \n \n \n \n   \n \n  \n \n \n \n \n \n \n \n \n \n \n \n \n    \n   \n   \n \n \n \n \n   \n    \n    \n  \n \n \n \n \n \n \n \n \n \n \n   \n\n   \n\n \n\n1. Consuttant (HR) fi, Consultant (Finance)\niil, Consultant (Academic) iv, Consultant (Audit)\nQualification and Experionce:\n\nMinimum Bachelor Degree with 20 years of relavant post qualification experience. Preference would be given to\nthe candidate having mid-career experience in institutions of high quality and/ or eminence, and for experience\nat successively more responsible positions within such organizations.\n\nThe candidate must possess sound knowledge of laws governing a university, excellent communication skilts\nand team building aptitude.\n\nSalary:\nMarkel) Compotitive\nHow to Apply:\n\n* Candidates are required to send two sets of applications On preseribed form.\n\n* The candidates should attach Pay Order/Demiand Draft of Fis.1500/- drawn in favour of National Skills\nUniversity, islamabad.\n\n* The candidates applying fer more than One position should submit separate form and draft for each\n\nposition applied.\n\nIn service candidates should apply through proper channel along with NOC,\n\n‘Only shortlisted candidates will be called for interview,\n\nNo TA/DA will be admissible for interview.\n\nThe applications should reach in the office of Registrar, National Skills University, Faiz Anmed Faiz Road,\nSector H-8/1, Islamabad within twenty days of the advertisement,\n\nRegistrar\nNational Skills University, Islamabad. Tel: 051-925090S\n\nBia)\n\nTERMS OF REFERENCE FOR CONSULTANT FINANCE\n\n‘Supervision of preparation of Books of Accounts\n\n‘Supervision of matters relating to fees and other students dues\n\n‘Supeevision ofall kinds of revenues of the university\n\nSupervision of payments at vendors and visiting taculty\n\nPreparation of disbursement of monthly salary 10 the amployees\n\nUsison with banks\n\nPreparation and supervision of final accounts of the university\n\nPreparation of Annual Budget of the university anc submission to HEC\n\nPreparabon and supervision of quarterly utilzation reports and subrnission to HEC\n\nFraming policy for investment of university surplus funds\n\nLiaison with HEC for release of Recurring and Development Grants\n\n‘Giese compliance of the accounting procedures according lo the Accounting Standards and policies\nPreparation of Working papers for Finance and planning Committee and conduct of meeting ofthe F&PC\nPreparation of annual financial statements and conduct of third party audit by a Chartered Accountants Firm\n\nTERMS OF REFERENCE FOR CONSULTANT AUDIT\n\n= Supervision and pre audit of ail kinds of payments to vendors anct visiting faculty\n\n‘= Supervision and pre audit of monthly salary of the employees of the unevarsity\n\n+ Proauditol al types ol payments and receipts\n\n‘Vetting ofall fencer Documents and RFPS\n\n\\Votting of pay fication cases of university employees\nUsison with Director General Federal Audit for annus audit ol the university by auc party of Auditor General of Pakistan\n‘Supeevision and ensure financial contro!s in the university\n‘Checking of annual interest calculations of interest on G.P Fund of university employees\nScrutiny of ctaimns of cid works/adiustenent accounts\nPreparation of working papers for Departmental Accounts Committe and arranging of OAC meetings\n‘Coordination with external aucitors of Federal Gow.\nCoordinate and prepare annotated replies of audit reports ofthe university\n\nTERMS OF REFERENCE FOR CONSULTANT ACADEMICS:\n\n‘Supervise teaching faculty ofthe University\n\n‘= Participate 1 hiring, managing, and developing academichsaching faculty\n\n+ Develop, oversee. and review the curricula for ski, vocational, technical and engneering technologies’ subjects\n\n* Develop, oversee, and review Teaching Leaming Recourse Matorial (textbooks, lab manuals, teacher's guides)\nDevelopment\nDevelop SOP and assists on assessment and accreditation of skills, vocational, technical and engineering technology\nprograms.\n(Develop and review academic calendars and proposais\n‘Collaborate in caliacting, analyzing, the creation and revision aif academic data analysis and intervention progracrss\n‘Assists with Student Recruitment: marketing, advertising, and strategic plan\nAilother matters related to academics\n\nTERMS OF REFERENCE FOR CONSULTANT HR\n\nDovotop statutes, rules and regulabons\n\n‘Conductand HA Audit and recommend changes/impravements\n\n‘Review job description/TORS of aficers in the ight of organizational abjectrves\n\n‘Design and recommend policies programs tor continuous professional development of employees\n(Design and recommend policies/prograrns for enhancing amployee wettare\n\nFleview the performance Appraiaal System and provide suggestions for improvement\n\nAPPLICATION FORM\n\nFill application form in block letters,\n1. Postapplied tor:\n\n2 Name:\n\n3%. Father's Name: Photograph\n4 Date of Birth:\n5. CNICNo.\n6.\n\n7.\n\n8.\n\n \n\nruc\n\n \n\nGk\n\n   \n\nro\n\n      \n    \n\n \n\n \n       \n   \n   \n   \n   \n   \n   \n   \n        \n      \n    \n  \n     \n \n   \n \n\nReligion\nMantal Status:\n\n \n\n \n\n \n\nk Domicile (Destrict/Province):\n\n9. Postal Address.\n\n10, Permanent Address:\n\n1. Phone/Cell No.\n\n12, E-mail:\n\n13, Academic record Give exact names in examination column (starting from high schoo! |.e matric\n‘onward in chronological order), Please attach attested copies of the academic/ experience\ncertificates.\n\n \n\n \n\n \n\n \n\n \n\nPassing ‘i Marks Division) | Major Subject |\nExamination] PYSEr9 | Board /Universty | e=ea] tata | eae — Siu | i\n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n14. Professional Experience\n\n \n\nPeriod Served\nFrom to\n\n \n\nOrganization Name | Position Held Field of Work\n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\nhereby undertake that the information provided by the undersigned is correct and best of knowledge.\n| also aware that any false information will ead to disqualification of my candidature.\n\nSignature of Applicant"}