{"_id": "5ec956f55019da268c469ef0", "img_description": "POLICE DEPARTMENT GOVERNMENT OF SINDH\nwww.sindhpolice.gov.pk\n\nee ee ele eel Te eee arr)\neS LET LES saltinial? COURT OF PAKISTAN ORDER DATED 26.12.2016,\n\nApplications are invited from the 78 dismissed Police Constables of Special\nBranch Hyderabad, who were appointed during the years 2012 to 2015\nand dismissed from service being appointed through irregular process as\npointed out by the enquiry committee constituted on the orders of Honourable\n‘Supreme Court of Pakistan dated 23.12.2015 in HRC 16082-S of 2015.\n\n‘The candidates must have domicile of Sindh Province and qualify following\n\nstandard:\n\na, Age: 18 to 28 at the time of their initial appointment in special Branch\n\nHyderabad.\n\nb. Quaification: Matric from any Board of Secondary Education of Sindh Province.\n\nc. Physical standard: Height 5 feet & 5 inch (minimum) Chest Minimum 33-34%.\n\nNote:\n\ni. No relaxation granted to candidates in age and physical standard.\n\nii, If the candidate selected for either in tesvinterview, he shall not be\n\nentitied to allow TA/DA\n\nPhysical test: Running 1600 meters in 7 minutes,\n\n‘Those candidates who claim of injury during serviceand medical problem\nshall be granted relaxation in physical test onthe recommendation of a\nmedical board\n\nHOW TO APPLY:\n\n‘+ Please download the Application Form and Deposit Slip from PTS Website:\nwww: pts.0rg.pk Pay the prescribed test fee in any of the country wide online\nbranches of HBL and UBL and fil up the Application Form property.\nPlease send the filled-up Application Form along with paid copy of the\nPTS Deposit Slip in original to PTS Headquarters, 3rd Floor, Adeel Plaza,\nFazl-e-Haq Road, Blue Area, Islamabad.\n\nApplication processing fee of Rs. 290/- (non-refundable) for physical part\nis required to be deposited in PTS account. However, Rs. 50/- will be\ndeposited separately.\n\nCandidate should attach his copy of appointment and dismissal order\n* aiong with copy of domicile PRG and Matriculation Certificate\n\nNo other dismissed police personnel shatt be eligible to submit application\nin this re-examination process.\n\nPTS shall not be held responsible for late delivery of application forms\nthrough post / courier services\n\nApplication Forms improperly filled-up, Incomplete, without paid copy\nof deposit slip, “hand written post wheré\" option for selection of post is\nalready available and submitted by hand will not be entertained\n\n‘The actual verification of original certificates'will only be done in respect of\ncandidates who are called for “interview and any applicant having made an\nincorreotfalse declaration shall stand disquaified automatically at any stage.\nIncomplete application shall not be entertained.\n\nCandidates qualified in physical test shall only be called for written lest by\nPTS. Test venue and date shall be communicated separately.\n\nDate, time & venue of all tests shall also be intimated later through letters,\n‘SMS add website from PTS.\n\nCandidates who do not fulfil the given criteria are advised not to submit\napplication.\n\nLast Date for Submission of Application Form is 31-03-2020.\n\nApplication received after Expiry of the Last Date, will not be entertained\n& shall stand ineligible.\n\nNOTE: Please do not attach original educational certificates with the\napplication form at this stage.\n\nAddl: Inspector General of Police,\nSPECIAL BRANCH SINDH, KARACHI\n\nINE-KRY No. 858/2020"}