{"_id": "5ecbb870b2238622bc8dbedb", "img_description": "i Government of Pakistan\n(om NATIONAL ACCOUNTABILITY BUREAU, LAHORE 4 }\n\nW\nNAB COMPLEX, THOKAR NIAZ BAIG, LAHORE\n\naoe JOB OPPORTUNITIES\n\nApplications are invited on prescribed application form from the persons, possessing the domicile of Lahore, Guirenwala,\nSargadha, Faisalabad and Sahiwal Division, for appointment against the following temporary posts, but lkely ta continu\ninthe National Accountability Bureau, Lahore;\n\nCy rey\n\nPS-04) | Middle Pass with vad Expesence it\n\nTotal Posts (15) | computeriaed diving Local area\nMert :10 Dens of LTV(Public hiving ts\n\nArmed Forces: 03 Service)’ HIV. preferable\n‘Minonty, 02\n\nNaib Qasid (8PS-01)\nTotal Pests: 04 Woe Fass\nsnmed Forces: 02\nDisadle 01\nMinority. 01\n‘ge. qualiicavon and expenence sal be counted as onthe closing dae for receipt af appicatons\nAfter short sting ofthe eligible candidates, the past ot Naib Gasid, mentioned at serial No.2 shale tiled through i\nballoting. For the post of Diver (BPS-4) mestioned at senal No.1. names of thse candidates willbe considered\nfor balloting, who will pass the driving/technical test.\nGoverrmant servartsiautonomous/sar autonomousicorporation employees can only apply through their\nGepartments,\n‘No further relaxation inmaximum age limit as mentioned above. will be given, hawever under mentioned categories\nwill be admissible for age relaxation maximum upto:\n\n3 years age retaxstion 1s admissible to the candidates belonging to scheduled castes. Buddhist\n‘Community recognized Tes of the Tribal Areas, in Punjab Province.\n\n15 years (0F) the number of years actually served in the Armed Forces of Pakistan whichever is less is\nadmissible tothe released for retired personnel of the Armed Forces of Pakistan\n\n10 years age relegation ts admissible to Government servants. who have completed 2 years ot\n‘continuous government service onthe closing date\n\nwhere a candidate ented to age retaxation under more than one category specified above, he’ she will\nbe allowed relaxation in age onty in ane category tavorable to him’hec\n\nit candidate is interested to apply for more than one post, a Separate set of application will be required, otherwise\nthe application willnot be entertained,\n\nThe service against said posts shall be by NAB Employees Terms & Conditions of Service 2002 and amendments\n‘made therein from time to time.\n\nNo TAVDA willbe paid for appearing in any tests/interview.\n\nIncomplete applicabons wil not be entertained.\n\nNameotthe post applied for should be writen boldly on the Tap Right\" comer of envelope.\n\nResult awaited candidates are not eligible to apply\n\nAlt appointments willbe made on Ment subjectto security clearance.\n\nDepartmenthas the rightto increase or decrease the number of post,\n\n‘Dual Nationality holders are not eligible to apply in terms of section 3.13 of NAB Employees Terms & Conditions ot\nServices (TCS)2002\n\nImerested candidates, who tutl the above said criteria may forward thelr applications by post as per given format\n(without any copy of documents, however, candidates applying forthe Post of Dehver (BPS-4) must attach a.copy\ntheic valid driving license with application. Form, Filed in Application Form must reach tothe undersigned tit\n20\" March, 2020, whichis available on NAB's website www.nab.gov.0k.\n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\nAddl Director (HR)\n‘NAB Complex, Thokar Wiaz Baig, Lahore,\n042-99232623\n\nSt. No-————~\n\na Ua Se (for Offical Use ony)\n\n(Please propare you anpiication as ger folowing Format\n1. Post Applied tor = proiatsca ences amcor aie aizecsi Fe eu pisces\n2. Name of Applicant Proigagn\n3, NIC No:\n\n4 Oat of Birth ————( Age on closing date of application)\n\n5. Fathor’s Name\n6, Address:\n\na, Permanent », Postal\n7. Donic 8, Contact No. (Line! Mati)\n8. Detats of Quaitication’ Experience\n\na. Academicy Technical\n\n \n\n \n\n \n\nExperience:\n\n‘Wentioned grade wise relevani experience as | _Pariod of Experinnce\nrequired’ mentioned la the advertisement fom | Ta\n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\nSignature ot Appcant\nDate"}