{"_id": "5ecbb870b2238622bc8dbedf", "img_description": "PUNJABIRUBEICISERVICE\n\nCl\nEAHORE:\n\nCOMMISSION\n\nADVERTISEMENT NO.10/2020\n\n   \n\n_ GENERAL INSTRUCTIONS (WRITTEN TEST/INTERVIEW)\n\n1. To appear in testinterview only Original Valid CNIC Issued by NADRA wil be accepted. No other Identification\ndocument willbe acceptable.\n\n12. Applicants are advised to read all terms and coneltions! instructions of the Advertisement 98 well 8 “Important\nInstructions to Candidates” given on PPSC website carefuly inorder to submit ther Online Applications complet ina\nrespects. The onus! responsibilty ofcorrecness ofthe data givenin the On-ine Application Form wil rest squarely onthe\n\ncancdates,\n3. Applicants are required to submit cat 1\" by the Closing Date 30-03-2020\n12:00 AM (Midnight). Appicants should filin the On-ine Appiation Form carefully inthe ight of the Guidelines and\n\n \n\nInstuctonsmentenedinine Adversamentfrthe sat post and=ImportantGeneral Instructions o Candidates\"\n\n4. Ein options, io covet ay daa the One Aplcaion Form wb avaiate che cancaes tl the Closing Date of\nsubmistnot Onine Applications.\n\n5. Neguve marking shabe done andO:2 mark shal be deducted fr eachincorectanswerinal Objective (MCQ) papers.\n\n6. Foratpoststobe ted troughwrtenteetolowedby era orinterew alone te number ofchanoesshalbe rested\n{cthee, However, fa cana quan tha terval cant bu recommended fo apocrimart fo shartage of\n\n‘ecanoe ts cove ll tot covaored es eyed feraes chee fe canna wo est gua te rent\n‘cr lnervew sal be considered as vale. Fre post Lecturer nEdtalton Deparment a candle who apart\ntecereltunote ebjed shlbe alowed tes tances inwach bjt or hich lhe acne detain woeoedance wth\natovelnid down pole\n\n7. Incas, a anda cains experince orate fr erty, he /shemust xing rot tte time aitensethat he fm /\nnity epetred wih SECP, Reiser of Fim orany athe Regltory Autry. faling wich hi her eppcatin sal be\ntmected\n\nfe, “Th canis wi aru that tr png or = ped pt iy linc ap br Dept Poiealos\nCerieatenNOC iter concer Department(s) and provide the Departmental Permission Cereal at he te of\ninterview ated).\n\nJs. Te candidates st ate appyng fora pacar post adverse by PPSC wl ensue that he have obiinedapled for\nTein in PECPNCIPMDCIPVMC or ter eleva body fr Region Cereal etre the Closng Dale and\nprovide the same atthe ine frervew called)\n\n10. The candates wi ener that hy wil provde marks obtained total marks or percentage certcate fal degrees a the\ntime ofnteniew, COPRisnot accepabe\n\ni. tis mandatory or Applicants to depost{SEMAUTA under Head\"c02101- ORGANZATIONS OF STATE-TEST FEE\nREALIZED BY THE PUNJAB PUBLIC SERVICE COMMISSION many Branchat State BarkofPaksan or National Bank\nOf Pakistan o Goverment Treasury onorbeorethe CosngDsect sutmisalnteppleaons\n+ Incase. the reason otanypost is withdrawn by the Administrative Desariment air recent of applications\n\n= a poco ee ofthe withdrawn post\nacainsany her not (Once. advected by fn Commission thinthenextOne Yer,\n\n+ Special Persons are nt required io deposit application fe.\n\n{Applian residing outside Pakistan but having Domicile othe Punjab wil epost the fee athe Pakistani\nEbene of reading country in the ciency of tat country equivalent to the amount ot Appbcaion! Tet,\nFee preserved forthe post.\n\nNo Bank Ort or Pay Order or Chaque or any such instrument wil be accepted as fe by the Commision\n\n12 Besc's Helpines: Lahore: 42 0202\" eoZ00(6, 26200162, Rawalpind Ost-515000,alsalabads\n041990719, Sargodha: O46 3259710, ln 81-0990354, Bahawalpur 062-2811 82,0,G Khan; 064 2200410\n\n \n\n \n\n \n\n  \n\n \n\nDISCLAIMER\nHtany instruction availabe onthe Webste or Advertisement is found contradictory tothe relevant Lav, Rules\nand Regulations and Poly Decisions, the relevant Law, Rules and Reguabons and Polley Decisone vl\nDrevalloverthe insiucions\nCAUTION\n\nPlease refuse to engage with any person who may oferto help you get selected. Have fathin your own abit\nand Wust in ALLAH (SW?) In case any dubious person contacts you fer providing undue favour in writen\n‘2xamination or interview, please immediately contact the folowing Hon able Members ofthe Commission a\n\n© Me. NasirKhan Durrani, Member PPSC, E-mail member!t@ppse gop ph, Te: 04285202753)\n‘© ms. Amjad Javid Saleem, Member PPSC, (E-mail membet6@ppse gop pk. Tet 04299202751)\nYour name will be kept secret and no prejudice will be caused to you.\n\n \n\noluil\n\n \n\n \n\n25 Lap hart the Ly we Pie deedre Tomy!\nPPS NL eG PILE Lash iroiesiae iy Ln Oborib\nihr EMGPI ord PS Soe seb na pig POP Lat Sie SAbSonL.\nmembert1@ppse.gop.pk Kis! 042-00202753:<u} (wield) Aduwwte-t 1\nmembert@ppsc.gop pk -Jkisi  o42-9020275t sly (AYA area 2\n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n  \n\n \n\n \n\n \n\n \n\nLg tvs thee\n\n= TMPORTANTIGENERAL\nROLL eT ee ar\nol) ty visit PPSC website:\n\nAPPLICATIONS ‘Www. ppsc.gop.pk\n\nDe ULNA NAVA GN eat =i\nSaag\nUAN NO. 042-111-988-722\n\nE-mail: ppsc@punjab.gov.pk website: www.ppsc.gop.pk\n\nMe gaidoue ie\n<p Lpecy SPP tty CsA"}