{"1":{"tilte":"KP Benevolent Fund Merit Scholarship","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/kp-benevolent-fund-merit-scholarship-scholar-654","discription":"Benevolent Fund Khyber pukhtonkhwa announces merit scholarships for the children of KP Govt. Employees. Scholarships are awarded to the students of Matriculation to Postgraduation. 200 scholarships will be awarded on merit basis.\nKP Benevolent Fund Scholarship details\nDetails of each category, number and amount of scholarship and terms of condition of Merit Scholarship program are as under: -\n\n\n\n\nCategory\n\n\nNo. of Scholarships\n\n\nScholarship\n\n\n\n\nSSC\n\n\n50\n\n\nRs.16,000\/-\n\n\n\n\nIntermediate\n\n\n50\n\n\nRs.32,000\/-\n\n\n\n\nB.A \/ B.Sc.\n\n\n50\n\n\nRs.40,000\/-\n\n\n\n\nProfessional Colleges \/ Universities\n\n\n50\n\n\nRs.48,000\/-\n\n\n\n\n\nEligibility Criteria for KP Benevolent Fund Merit scholarship\nChildren of serving provincial government employees (regular Benevolent Fund contributors), scoring not less than 1st Division, are eligible for the Merit Scholarship.\nHow to apply for Benevolent fund merit scholarship\n\nApplication form can be downloaded from KP benevolent fund website or google drive here\nLast date to apply fro scholarship is 11-02-2020.\nThe grantee who avail the Merit Scholarship is not eligible for any other scholarships.\nThe scholarship application forms are required to be verified from the Head of Institution and submitted through the head of Department concerned.\nForm should be filled clearly in CAPITAL LETTERS, and all required information must be provided. Incomplete forms will not be entertained."},"2":{"tilte":"PEEF Scholarship for FATA","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/peef-scholarship-for-fata-scholar-123","discription":"Punjab Education Endowment Fund PEEF announces scholarships for talented and deserving students of FATA\/Merged areas for session 2019-20. Students who have passed Matric or Inter exams in 2019 are eligible to apply. Last date to submit application for PEEF KP Scholarships is January 30, 2020. Those having domicile of FATA\/Merged areas can apply.\nEligibility Criteria for PEEF FATA Scholarships\n\nCandidates who have passed Matric\/ Inter exams from Government institutions in FATA or in Khyber Pukhtonkhwa\nCandidate must have scored at least 60% marks in Matric or Inter Exams 2019 conducted by BISE Khyber Pukhtonkhwa.\nThe candidate must have passed the above mentioned examination from a Government Institution.\nCandidate must have domicile of FATA\/Merged Areas.\nMust be enrolled in a full time registered institution.\nHis\/Her Parents total monthly income must not exceed from Rs.23,000\/-\nGrade 1-4 employees children are exempted from such income condition.\nChildren of those martyred in terrorist attacks are also exempted for income condition.\nThe candidate must not be receiving any scholarship\/stipend from any other source.\n\nIn addition to these scholarships, special quota scholarships are also available for those falling under one of the following categories.\nFor PEEF Special Quota Scholarships\n\nOrphan Children\nChildren of government servants in BPS 1 to  4\nChildren belonging to minority religion\nSpecial Children\nChildren of civilians martyred in terrorist attacks\n\nHow to apply for PEEF FATA Scholarships \nComplete application form should be submitted on or before January 30, 2020. Applications filled only on prescribed application form shall be accepted. Prescribed application form for PEEF FATA Scholarships can be obtained from the office of Section officer (training), department of higher education, Government of Khyber Pukhtonkhwa. Application forms can also be downloaded from PEEF Website."},"3":{"tilte":"HEC Scholarship for Undergraduate students at MUST","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/hec-scholarship-for-undergraduate-students-at-must-scholar-644","discription":"Higher education commission HEC Islamabad is offering scholarships to the students admitted in Bachelor degree programs in session 2019 at Mirpur university of Science and Technology, MUST Mirpur AJK. Scholarship will be offered through the MUST university relevant department.\nHEC MUST Scholarship 2019 covers\n\nPKR: 100,000 per year stipend from HEC\nPKR: 18,000\/- stipend from MUST\n\nEligibility Criteria\n\nStudents admitted at MUST in session 2019 for\nMust be enrolled in a 4-5 year degree programs\nCandidate must be financially deserving,\nTalented candidates\n\nHow to apply for HEC MUST Scholarship\nInterested deserving and talented candidates will submit the application for scholarship to the focal person of their relevant department. Last date to submit the application is 17-01-2020. Application form is available online at university website.\nHEC MUST Scholarhsip Selection procedure\nScholarship will be awarded after the scrutiny of forms, on the recommendation of different committees. Relevant committees at HEC and MUST will finalize the list of selected candidates. Terms and conditions are available online at HEC website."},"4":{"tilte":"Ehsaas Scholarship program for undergraduate students","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/ehsaas-scholarship-program-for-undergraduate-students-scholar-641","discription":"Government of Pakistan has launched the country's largest undergraduate Scholarship program Ehsaas Undergraduate scholarship 2019. Under Ehsaas scholarship program, 200,000 scholarships will be awarded to the deserving students in coming four years. 50% quota is reserved for female students. Ehsaas scholarship is a fully funded program, which not only covers tuition fee but a monthly stipend will also be provided to the scholars. Now the Deadline for Ehsaas Undergraduate Scholarship is extended till December 24, 2019\nMain Features of Ehsaas Undergraduate Scholarship 2019\n\n50,000 Scholarships per annum\n200,0000 undergraduate scholarships in 4 years\n50% seats reserved for Girls \nFull tuition fee\nMonthly Stipend \nSpecial Preference to disabled and students belonging to underprivileged areas\n\nEhsaas Scholarship Eligibility Criteria \n\nStudents enrolled in any Government University admitted on merit\nDeserving students from low income familties  \n\nEhsaas Scholarship program will offer need based scholarships to the students of undergraduate degree programs.\nHow to Apply for Ehsaas Undergraduate Scholarship 2019\n\nEligible candidates can apply online at http:\/\/ehsaas.hec.gov.pk\/hec-portal-web\/auth\/login.jsf\nComplete application form can be submitted to the respective university's financial aid office\nDo not submit the application form directly to HEC or BISP\n\nEshass Scholarship Deadline \nDeadline for Ehsaas Undergraduate Scholarship is extended till December 24, 2019"},"5":{"tilte":"Ministry of Religious Affairs MORA Scholarship for minorities","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/ministry-of-religious-affairs-mora-scholarship-for-minorities-scholar-626","discription":"Ministry of Religious Affairs MORA invites Applications for the award of scholarship from students of minority groups for different levels of studies i.e. from primary level to Undergraduate and master studies. Scholarships rates for the current financial year 2019-20\nEligibility Criteria for MORA Minority Scholarship 2019-20\n\nRegular students of Government \/ Public Sector Institutes (Schools, Colleges and Universities) with minimum 50% marks are eligible to apply.\nPoor, need, orphan and handicapped students belonging to minority groups having a good educational record are eligible to apply. Candidates' parents income must not exceed PKR: 10,000\/- monthly in case of students of school level and Rs: 20,000 per month in case of other students.\n\nHow to Apply for MORA Minority Scholarship 2019-20\n\nThe application will be accepted only on new prescribed performa supported with last two duly attested annual marks sheets and parents'\/Guardian's original income certificate.\nAll particulars of the students concerned will be certified by the Head of Educational Institute, An attested copy of the school progress report \/ marks sheet of the last annual examination showing actual performance of the student will be enclosed. Marks sheet Prepared on printed form or plain paper afresh will not be accepted. \nHead of Institutes should check that forms are complete in every aspect, required documents \/ certificates are attached and prepare a list of such students and send it to this ministry  along with his covering letter duly signed by him. Only applications received through Educational institutions shall be considered.  \nStudents receiving financial assistance, stiped or scholarship etc. from any other source will not be eligible.\nCNC number of applicant or NADRA B-Form  for younger than than 18 years must be written on the forms and copies must be attached.\nIncomplete application forms will not be accepted.\nStudents of Private Institutes are not eligible to apply.\nStudents parents and Guardians are advised to provide contact number and email address to get possible queries resolved in time.\nNote. The Application Forma received before advertisement and after closing date shell not be considered \nThe applications, complete in every respect, with documentary evidence must leach the undersigned within 30 days of publishing of this advertisement. Applications received after due date will not be entertained. Application forms can either be photocopied from Newspaper."},"6":{"tilte":"HEC announces CGI Thailand Fully Funded Master degree Scholarship postgraduate","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/hec-announces-cgi-thailand-fully-funded-master-degree-scholarship-postgraduate-scholar-627","discription":"Higher Education commission HEC, Islamabad invites applications Chulabhorn Graduate Institute Postgraduate Scholarship Program (Academic Year 2020). CGI is one of the leading postgraduate institute in Thailand. CGI Thailand scholarship is a fully funded master degree program which covers all expenses i.e. tuition fee, academic expenses, round tickets and much more. These fully funded international scholarships are offered for Master Degree \/ MS \/ MPhil (18 years education) in Applied Bio Sciences i.e. Environmental Healther, Environmental Texicology, and chemistry.\nCGI Thailand Postgraduate scholarship is purely on merit basis, potential of the candidate and the likely impact of the work on the development of Pakistan. \nEligibility criteria for CGI Thailand Master Degree Fully Funded Scholarship:\n\nPakistani \/ AJK National\nUnder 30 years of age as on as on 30th October, 2019.\n16 years Bachelor \/ Undergraduate Degree with a  minimum CGPA 3.00\/4.00 in one of the following fields:\n\n​Sciences: Chemistry, Biology, Biological Sciences, Molecular Biology, Environmental Sciences.\n​Medical Sciences: Medicine, Medical Technology\n​Pharmacy or Pharmaceutical Sciences.\n\n\nScientific Laboratory Research Experience\nEnglish proficiency tests (TOEFL or IELTS)\nStatement of Purpose\n\nRequired Fileds of study for Postgraduate International Scholarship:\n\nApplied Biological Sciences: Environmental Health\nEnvironmental Toxicology\nChemical Science\n\nCGI Thailand Postgraduate Scholarship \nThe award is tenable for a period of six weeks refresher courses in June 2020 followed by a period of 2 years Master Degree, subject to an annual review of the scholar's satisfactory progress. The Scholarship will cover is a fully funded including tuition fees and all other academic fees, round airfare ticket, accommodation, monthly stipend, book allowance, health insurance and others. Refresher will tentatively commence in June 2020 while the academic programme will commence in August 2020.\nDownload CGI Thailand Scholarship application forms\nCGI scholarship application form and medical history and report can be downloaded from here. \n\nCGI application from (Click here)\n\n\nMedical history and report form (Click here)\n\n\nApply online at HEC website: http:\/\/eportal.hec.gov.pk\/loa . After registering and filling your profile, please select \"Learning Opportunities Abroad\". After submission of the application, get its printed copy to be signed & stamped by employer (if employed already). Attach deposit slip of Rs. 300\/- (in original) through HEC online Account No. 17427900133401 in HBL, Shalimar Recording Company Branch, H-9, Islamabad. All payments are to be made to HEC through HBL online facility. This facility is available in all branches of Habib Bank Ltd across Pakistan.​\n\nRequired Documents for CGI Thailand Fully Funded Master Scholarship\nFor your own convenience, please keep ready two sets of CGI application form (printed copy) in a separate spiral binding along-with following documents:\n\nTwo passport size photographs\nAttested copies of all Academic Degrees & Transcripts\nResearch proposal\nThree Letter of Recommendation (academic or professional)\nCertificate of English language proficiency preferably TOEFL or IELTS.\nStatement of purpose explaining their interests in the study\nMedical certificate\nNOC from employer (for serving candidates)\n One copy of HEC application form with bank deposit slip (in original) separately.\n\nDeadline:\nThe last date to apply for this fully funded Master degree scholarship is September 24, 2019.  Application can be submitted on HEC portal by latest 24th September, 2019."},"7":{"tilte":"HEC MS\/M.Phil Indigenous scholarships for students of Balochistan and erstwhile","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/hec-ms-mphil-indigenous-scholarships-for-students-of-balochistan-and-erstwhile-fata-scholar-372","discription":"Applications are invited from outstanding students of Balochistan and erstwhile FATA who intend to pursue postgraduate (MS\/MPhil) studies from HEC-Recognized Universities. The Scholarships are offered for the academic year 2019-20 in all areas of studies \/ disciplines. \nELIGIBILITY CRITERIA\n\nApplicants must possess local domicile certificate from Balochistan \/ erstwhile FATA.\nMaximum age limit is 35 years as on closing date.\nApplicant must have completed 16 years of education with at least 60% marks. \nCandidates must have acquired the requisite academic qualification on or before the closing date.\nThe applicants who are already availing any HEC \/ Government Scholarship are not eligible to apply.\nApplicants will have to meed HEC and University eligibility Criteria for admission in MS\/MPhil Programs. \n\nHEC Scholarship for Balochistan and FATA Covers\n\nTuition fee and other charges (including Hostel Fee) maximum PKR: 60,000\/- per semester\nLiving allowence of Rs: 9,000 per month\n Books allowance of Rs.6,000 per annum.\nTraveling allowance of Rs.5,000 per annum.\nInitial settlement allowance of Rs.10.000 once.\n\nIMPORTANT NOTE\n\nScholarships will be awarded on merit and District\/ Agency Quota.\nCandidates will be selected on the basis of Aptitude Test score (conducted by HEC) and academic credentials.\nApplicants have to secure at least 50% marks in the test.\nThe scholarship distribution ratio for the students of Balochistan and erstwhile FATA is 50:50.\n\nHOW TO APPLY\nsubmit application online through HEC website\nLAST DATE FOR RECEIPT OF APPLICATIONS\nLast date for submission of online application form is Monday, August 05, 2019\na) Applications in hard form will not be entertained."},"8":{"tilte":"HEC Law Scholarships for Balochistan Students","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/hec-law-scholarships-for-balochistan-students-scholar-624","discription":"Baluchistan. The scholarships will be awarded for students enrolling in local and International Universities. Scholarship covers tuition fee and other living expenses.\nProposed scholarships will enhance participation of students from Baluchistan in higher education and hence strengthen the region's law and justice condition."},"9":{"tilte":"HEC USAID funded Merit and Need Based Scholarships ","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/hec-usaid-funded-merit-and-need-based-scholarships-scholar-89","discription":"The United States Agency for International Development (USAID) in partnership with Higher Education Commission (HEC) is offering scholarships to the financially disadvantaged students to study Business Administration, Agriculture, Veterinary Sciences, Medicine\/Nursing and Engineering & Technology programs.\nNeedy students across Pakistan are strongly encouraged to apply."},"10":{"tilte":"HEC Need Based Scholarship For University of Veterinary And Animal","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/hec-need-based-scholarship-for-university-of-veterinary-and-animal-sciences-uvas-students-scholar-621","discription":"University of Veterinary and Animal Sciences UVAS HEC Need Based Scholarship Program 2018\nHEC Has Announced Need Based Scholarship for the students of University of Veterinary and Animal Sciences. UVAS student are advised to apply for this scholarship if they are eligible to the requirements of the HEC Need Based Scholarship.\nUniversity of Veterinary and Animal Science UVAS is offering HEC Need Based Scholarship Program 2018 for those candidates who cannot afford their educational expenses. So if you are among those candidates then this is the time to avail this golden opportunity as you can get your scholarships and for this purpose you have to first of all download the application form and then complete the other application process according to the rules and regulations restricted by the officials of UVAS. Well candidates this Scholar ships will only granted to those candidates who are eligible for this and deserve this scholarship as they are enrolled in the session of 2018. You are suggested to read this entire article with full attention so that you can avail this opportunity and can determine yourself that either you eligible for this scholarship or not. The Eligibility criteria are also discussed in points down. So if you also want to get UVAS HEC Need Based Scholarship Program 2018 Form Download then scroll down this page and follow the important instructions issued by the officials of HEC for UVAS.\nUVAS HEC Need Based Scholarship Program 2018\nEligibility Criteria for UVAS HEC Scholarship 2018\nWell if you also want to get this scholar ship then you first have to analyze yourself either you are eligible for his scholarship or not. Then you have to download the application form from the official site of UVAS or also can collect from the admission office of UVAS. The eligibility criteria is discussed here bellow in this advertisement issued by the officials. Have a look down this advertisement.\nUVAS HEC Need Based Scholarship Program 2018 Form Download\nUniversity of Veterinary and Animal Sciences UVAS was established in 1882 by the Government of Punjab as a public type University located in Lahore Punjab Pakistan. The UVAS is one of the oldest and top ranked University in the animal sciences and animal health food irradiation. The University from the time of its establishment is providing the best quality education and now has maintained its sub campuses for the different medical faculties related to the animal health. Some faculties of UVAS are mentioned\nFaculty of Veterinary Science\nFaculty of Pharmaceutical Sciences.\nFaculty of Animal Production and Technology\nFaculty of Bio Science\nFaculty of Life Science and Business Management\nWell these are the faculties of UVAS which are being teaches in the different of its institutes as one of the most famous institute of UVAS is the College of Veterinary and Animal Sciences. The UVAS is affiliated with the HEC Higher Educational Council and the HEC providing the facility of Scholarship for the UVAS candidates to fill the gap of education for the deserving candidates. The HEC provide the UVAS HEC Need Based Scholarship Program 2018 Form Download for all of the eligible candidates."},"11":{"tilte":"HEC Undergraduate Indigenous Scholarships for students of Balochistan & Fata","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/hec-undergraduate-indigenous-scholarships-for-students-of-balochistan-fata-scholar-606","discription":"The Higher Education Commission HEC announces Indigenous Scholarships Batch-III of ‘Provision of Higher Education Opportunities for the students of balochistan & FATA (Phase-II) for Undergraduate Studies in All Disciplines.\nApplications are invited from candidates having local Certificate\/Domicile of balochistan or federally administered tribal areas FATA for award of Scholarships for Undergraduate Studies in HEC-Recognized Public Sector Universities degree Awarding Institutions or W-Category Private Universities of Pakistan.\nUndergraduate Indegenous Scholarships Eligibility Criteria:\n\nApplicants Must Possess local Certificate\/Domicile of Balochistan\/FATA.\nCandidates must have completed 12-year education with 60% marks in FA\/FSc\/ICom\/ICS\/DAE or equivalent.\nMaximum age limit is 22 years as on august 19, 2018.\nCandidates must acquired the requisite academic qualifications on or before the closing date.\nCandidates who are already availing any other HEC\/Government Scholarship are NOT eligible to apply.\n\nUndergraduate Indegenous Scholarships Programme Covers:\n\nAverage tution fee and other charges including hostel fee up to Rs. 60,000 per semester\/year.\nLiving allowance of Rs. 6,000 per month with Rs. 500 annual increment.\nBook allowance of Rs. 5,000 per anum.\nTravel allowance of Rs. 5,000 per anum.\nInitial settlement allowance of Rs. 10,000 once during entire study period.\n\nHow to Apply:\nApplicants are required to submit application in hard form. Application form is available on HEC website hev.gov.pk. please download the application form, fill in and send to sr. project manager, human resource development division, Higher Education commission H-9 Islamabad. Incomplete application forms will not be entertained."},"12":{"tilte":"HEC Need Based Scholarships","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/hec-need-based-scholarships-scholar-18","discription":"Pakistan has no shortage of talented youth, but in several instances, lack of resources prevents them from realizing their potential. This is a particularly problematic when it comes to accessing higher education. The Government of Pakistan acknowledges these constraints, and has tasked the Higher Education Commission with facilitating needy and deserving students through Need Based Scholarships. This year, over 10,000 scholarships have been announced for financially disadvantaged　students all over Pakistan including 61 public sector universities of Pakistan (list attached). It aims to elevate the socio-economic status of the students by enabling their access to modern education and career opportunities towards a brighter future.\nEligiblity criteria:\nFinancial assistance & scholarships are available for study at Undergraduate level in all disciplines at HEC selected public sector Pakistani universities and degree awarding institutions.\nStudents need to compete for securing admission at the participating institution as per admission policy of the institution and be enrolled in Undergraduate (4 years) programs.\nStudents in financial need who are already enrolled in participating institutions are also eligible to apply.\nThe eligibility of a candidate is linked to his\/her financial needs as assessed by the Institutional Scholarship Award Committee. The financial background of the family of the applicant will be kept in view in this regard.\nThe number of slots will be decided by the universities.\nFunding for slots will continue for the complete duration of the program. In case any students drop out, they will be replaced by other candidates on the waiting list.\nAll disciplines will be kept open. The selected university will decide whether to include or exclude any discipline keeping in view its grant, program cost, and number of allocated slots, etc.\nIn the case of Medicine, Pharm-D and other five year programs, funding will be made available for the complete program.\nConsidering the allocated grant, the university may adjust the total number of scholarships to an extent in order to cover the tuition fees.\nIn addition to the tuition fee, every grantee will be paid Rs.6000\/- stipend per month for the complete program.\nHow to apply:\nInterested applicants can receive the Scholarship Application Form from the Financial Aid Office (FAO) at the participating University\/Institution. The form can also be Downloaded Here.\nThe Scholarship Form will be submitted along with　supporting documents to the same　Financial Aid　office (at university only) after completion. (HEC will not accept any application form directly)\nStudents need to secure admission to any one of the approved disciplines at the participating Universities\/Institutions as per their admission criteria.\nPlease note that this scholarship program also considers partial scholarship for students already enrolled at the selected university\/DAI.\nPlease note that under this scholarships scheme, the funds are not transferred directly to students by HEC. The payment is made to the students through participating universities\/institutions."},"13":{"tilte":"Prime Ministers Fee Reimbursement Scheme for Less Developed Areas","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/prime-ministers-fee-reimbursement-scheme-for-less-developed-areas-scholar-74","discription":"The Federal Government, in move to support the educational sector of less developed areas of Balochistan, Gilgit\/ Baltistan, FATA, Interior Sindh, South Punjab, Malakand, Kohistan and D.I. Khan areas of Khyber Pakhtunkhwa has decided to pay the tuition fee of all the students of these areas studying in Masters, M.Phil in the Public Sector Universities of their respective area of domicile and for PhD all Public Sector Universities of Pakistan.\n\nELIGIBILITY CRITERIA\n\nDomicile: The Students having valid domicile\/local certificates of areas included in the scheme i.e Balochistan, Gilgit Baltistan, FATA, Interior Sindh, Multan, Bahawalpur, D.G. Khan, Malakand, Kohistan and Dera Ismail Khan.\n\nEnrolment:All onboard students who are enrolled on merit in the academic institutions located in their area of domicile are eligible. The students from FATA, Malakand, Kohistan and Dera Ismail Khan studying in institutions located in Khyber Pakhtunkhwa will be considered.\n\nInstitutions: Public sector universities, affiliated government colleges and Public Sector Degree Awarding Institutes (DAIs) situated in Balochistan, KPK (for FATA, Malakand, Kohistan and Dera Ismail Khan only) Gilgit\/Baltistan, South Punjab and Interior Sindh.\n\nProgram: Tuition fee and other mandatory fees charged by the respective institutions will be paid for all students except for those admitted on self-finance basis or who are already availing any other scholarship.\n\n\nIneligibility\n1)The students who are availing scholarship from HEC, Provincial Govt. or any other organization, will be ineligible to apply.\n2)The students who secured admission on self-finance basis will not be eligible.\n3) The students who are not full time students will not be eligible.\n\nHOW TO APPLY\n1) List of students (detail mentioned below) will be collected from Public Sector academic institutions and there is no need to send any application or form to HEC.\n\n2) All candidate names would be forwarded through respective university to HEC.\n\n3) HEC will pay tuition fee (including other academic, incidental, or mandatory fees charged by educational institutions as one-off or on a per semester basis) to university directly.\n\n4) There is no last date to apply for this scheme as HEC will pay fee till the provision of funds by the Government of Pakistan.\n\nExisting students\n\nAll onboard students of Master & MS\/M.Phil who are enrolled on merit in the academic institutions located in their area of domicile are eligible. The students from FATA, Malakand, Kohistan and Dera Ismail Khan studying in institutions located in Khyber Pakhtunkhwa will be considered.\n\nPhD candidates having domicile of Balochistan, Gilgit\/ Baltistan, FATA Interior Sindh, Multan, Bahawalpur, D.G. Khan, Malakand, Kohistan and Dera Ismail Khan in any public sector university throughout Pakistan.\n\n\nNew Admissions\nA candidate has to secure admission on merit in the area of their respective domicile and HEC identified universities. (list of identified universities is available at www.hec.gov.pk\/tfp)\n\nMaster\/MS\/M.Phil candidates can take admission only in the universities located in the territory of Balochistan, Gilgit\/ Baltistan and FATA, Malakand, Kohistan and Dera Ismail Khan (KPK Universities) with respect to their domicile.\n\nPhD candidates having domicile of Balochistan, Gilgit\/ Baltistan, FATA Interior Sindh, Multan, Bahawalpur, D.G. Khan, Malakand, Kohistan and Dera Ismail Khan are allowed to secure admission in any public sector university throughout Pakistan.\n\n\nSubsequent Payments\n\n1) Subsequent Payments will require satisfactory progress report\/result of students.\n\n2) For continuation of free education, the students will maintain minimum Percentage\/GPA which is necessary to retain his\/her admission for the respective university.\n\n3) During the period, the student must be a full time student and he\/she will take full load of subjects\/credits during each semester\/term\/year.\n\nList of Universities\/Colleges\n\nStudents enrolled on merit in Masters, MS\/M.Phil and PhD in the academic institutions located in the territory of Balochistan, FATA (enrolled in KPK Institutions only) and Gilgit\/Baltistan are eligible. The students enrolled in affiliated Postgraduate Government Colleges and Public Sector Degree Awarding Institutes (DAIs) situated in Balochistan, FATA, KPK and Gilgit\/Baltistan will also be provided tuition fee waiver.\n\nBalochistan Universities:\n1. Balochistan University of Engg & Technology (BUET), Khuzdar\n2. BUITEMS Quetta\n3. University of Balochistan, Quetta\n4. Sardar Bahadur Khan Women's University, Quetta\n5. Lasbela University of Agriculture, Water and Marine Sciences, Balochistan\n6. NUML ,Quetta Campus\n\nGilgit\/Baltistan Universities:\n1. Karakoram International University, Gilgit\n\nKPK Universities:\n1. Gomal University (GU), D.I.Khan\n2. Hazara University (HU), Mansehra\n3. Kohat University of Science & Technology (KUST), Jarma,Kohat\n4. KPK Agricultural University, Peshawar\n5. KPK University of Engg. & Technology, Peshawar\n6. University of Malakand (UM), Malakand\n7. University of Peshawar (PUP), Peshawar\n8. Institute of Management Sciences, Peshawar\n9. University of Science & Technology, Bannu\n10. Frontier Women University, Peshawar\n11. Khyber Medical University,Peshawar\n12. Islamia College of University, Peshawar\n13. Abdul Wali Khan University, Mardan\n14. Shaheed Benazir Bhutto University, Dir Upper\n15. University of Swat, Swat\n16. NUML, Peshawar Campus\n17. UET Peshawar (Abbottabad Campus,Abbottabad, Mardan Campus, Mardan, Bannu Campus, Bannu,Jalozai Campus, Jalozai)\n18. Hazara University,Haripur Campus, Haripur\n19. COMSATS University, Abbottabad\n20. Bacha Khan University, Charsadda"},"14":{"tilte":"NTS Pakistan Announced Need Based Scholarship Program","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/nts-pakistan-announced-need-based-scholarship-program-scholar-114","discription":"NTS Pakistan Announced Need Based Scholarship Program For NTS Associated Universities\/Institutions\nNational Testing Service(NTS) is the leading testing and assessment organization in Pakistan offering services to government\/non-government agencies institutions of higher education. NTS is committed to ensuring a culture of merit and quality education at the college and university level in Pakistan\nScholarship Coverage\n-Tuition Fee\n-Stipend(Rs.5000\/-per month during the period of study)\n\nHow to Apply\nDeserving students can obtain NTS Need-based Scholarship Application Form from the Financial and Office(FAO) at the NTS Associated Universities\/Institutions can download it from NTS Website(www.nts.org.pk).\nThe complete Scholorship Form along with Supporting documents is to be submitted to the relevant office of the University\/Institution for further processing\n\nList of NTS Associted Universities\/Institutions is available on www.nts.org.pk"},"15":{"tilte":"HEC starts ELTR Sponsored Indigenous Scholarships","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/hec-starts-eltr-sponsored-indigenous-scholarships-scholar-37","discription":"Islamabad, Higher Education Commission (HEC) has announced ELTR Sponsored Indigenous Scholarships 2013-14. Last date for submission of application form and fee is March 15, 2013 at 03:00 PM.\n\nThe Indigenous Scholarships are available under English Language Teaching Reforms (ELTR) Phase-ll for in-service English teachers of public sector colleges and universities of the country in these programs:\n\nM. Phil \/MS in Applied Linguistics and related disciplines (Up to 02 year), Masters in Applied Linguistics, TEFL, TESL, ELT (Up to 02 year), PGD, ADP in TEFL, TESL, ELT (Up to 01 year)\n\nApplicants are Eligible who are Pakistani \/ AJK nationals, Fulltime\/ permanent English faculty (Lecturer & above) of public sector colleges and universities. Teaching English at the graduate and postgraduate level.\n\nTeachers with maximum 50 years of age, with minimum 16 years of education and with at least one year experience of teaching English as a subject, are eligible for the Scholarships. Fresh \/ already enrolled candidates fulfilling the criteria and studying in the specified programs may also apply for the fellowships. They will get funding for the remaining period of their study.\n\nThe candidate can get admission in any HEC recognized public or private sector universities offering the specified programs.\n\nCandidates have to send application form along with required documents (Academic, Agreement, NOC) and admission letter (in case of already enrolled) to ELTR Phase-ll, HEC.\n\nAll correspondence will be done through e-mail. Mention a valid e-mail ID. The details of application procedure and terms & conditions are available on HEC website.\n\nThe amount would be submitted in Original online Bank deposit slip of Rs. 400\/- (non-refundable) in favor of the Director General Finance, Higher Education Commission, on Account No 17427900133401, Habib Bank Ltd, Shalimar Recording Company Branch, H-9, Islamabad as processing fee.\n\nHEC reserves the right to accept or reject any application without giving any reason.\n\nThe Scholarship covers only full tuition fee up-to Rs. 100,000\/- and a stipend of Rs. 2000\/- per month as per Semester Schedule.\n\nLast date for submission of applications and fee is March 15, 2013 at 03:00 PM.\n\nThe filled application forms must reach via courier\/ registered mail to: Syed Musa Hassan Project Manager, ELTR Phase-ll, Learning Innovation Division, C &T Building, H-8 Higher Education Commission, Islamabad Ph: 051-90400811-90400823"},"16":{"tilte":"HEC Announces Indigenous Scholarships for Balochistan Province","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/hec-announces-indigenous-scholarships-for-balochistan-province-scholar-69","discription":"Islamabad: Higher Education Commission (HEC) has announced Indigenous scholarships for MS\/MPhil and PhD level for students of Balochistan.\n\nHow to Apply:\n\nApplications are invited from Local\/Domicile Balochistan for the award of local scholarships for MS\/MPhil leading to PhD \/ PhD:\n\nDocuments required with Application\n\nThe following documents are required to be submitted along with the printed copy of online application form:\n-Attested Photocopies of all educational testimonials.\n-Attested Photocopy of CNIC, and Domicile.\n-Copy of PEC Registration for engineering discipline. (if applicable)\n-Copy of PMDC Registration for Medical discipline. (if applicable)\n-In-Service (only for Government employees) candidates need to apply through proper channel with assurance from their\nemployer that if scholarship is awarded, they will be released immediately and after completion of the studies, they will serve at parent Department\/Universities\/Colleges. Advance copies will be accepted however NOC from the organization must be provided before 20th Oct, 2013.\n-Original deposit slip\/ Bank Draft\/ ATM Transfer Slip of Rs.200\/- as application processing fee in favor of Director Finance, HEC can be deposited at Habib Bank limited, on Account Number 17427900133401\n\nLAST DATE OF RECEIPT OF APPLICATIONS:\nPrinted copy of online application form completed in all respects should reach the undersigned latest by October 20th, 2013 through registered mail or courier service. By hand \/ incomplete (in any respect) application received after due date will not be entertained.\nApplications must be received in the office of Dy. Project Director till 20th Oct, 2013\n\nNote: For any assistance please visit HEC Regional Center, Quetta.\n\nOffice Location: House # 53\/7 , Zarghoon Road, Opposite Engineering Building, Quetta"},"17":{"tilte":"Edcon Asia announces 2000 scholarships for Pakistani Students","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/edcon-asia-announces-2000-scholarships-for-pakistani-students-scholar-95","discription":"Edcon Asia has announced 2000 scholarships for school and college students.\n\nStudents availing these scholarships will be able to continue their education in leading educational institutions of Islamabad.\n\nEligibility Criteria\nPakistani or AJK Nationals\nStudents seeking admission in Class 6th to 9th\nCollege students seeking admission in First Year\n\nEntry test shall be held on April 20, 2014. Last date to submit application for scholarship is March 31, 2014."},"18":{"tilte":"The Punjab Educational Endowment Fund Lahore Offering Master Level Scholarships","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/the-punjab-educational-endowment-fund-lahore-offering-master-level-scholarships-programme-2014-scholar-115","discription":"The Punjab Educational Endowment Fund(PEEF) is an initiative of the Government of Punjab. PEEF is established with a vision to support the talented and needy students so that they can realize their dream of attaining higher education and play vital role in the progress and welfare of Pakistan\n\nHow can Apply\n-Students having Punjab domicile and secured at least 60% marks or minimum CGPA 2.5 In BA\/B.Sc\/BBA\/BCS\/B.COM etc examination held in 2014(annual) in Punjab\n-Students having secured admission as a full time student in the current academic year(2014-15)in one of the partner Universities\n(list may be seen at http:\/\/www.peef.org.pk\/MasterLevelScholarship.scp)\n-Students enrolled in spring\/fall session and morning\/afternoon\/evening sessions(where applicable)are also eligible to apply for PEEF scholarships\n-Students whose declared monthly income of parents from all sources is equal to or less than Rs 30,000\/-\n-Children of Government employees in BPS-14 are exempt from condition of monthly income.If Salary is the only source of income\n-Students note receiving any other scholarship for Master's Level Studies\n\nNote\n-Students who have already passed\/possessed MA\/M.Sc\/M.S\/M.Phil\/Ph.D etc degree are not eligible for PEEF Master's Level Scholarship\n-The prospective students must qualify the criteria of financial and of the respective University"},"19":{"tilte":"PMAS Arid Agriculture University Rawalpindi Announces PAK-USAID Merit and Need","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/pmas-arid-agriculture-university-rawalpindi-announces-pak-usaid-merit-and-need-based-scholarship-program-session-scholar-116","discription":"Applications are invited for the award of Pak-USAID Merit and Need Base Scholarship to the highly talented and deserving students, Securing admission at Under and Post Graduate level during Fall Semester 2014-15 in the following disciplines for the award of subject scholarship(50% of the total scholarships are reserved for female students)\n\nEligibility Criteria\n-Admitted in above mentioned program on merit\n-Belongs to low income families of the Society\n-Monthly income equal or less than Rs.35,000\/-\n\nHow to Apply\n\nIt is compulsory to apply online(www.uaar.edu.pk) after carefully reading the instructions and submit hard copy of online application in Directorate of Financial Assistance and University Advancement along with all required documents\n\nLast date to Apply 15th October, 2014"},"20":{"tilte":"HEC-CRBC Scholarship Program","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/hec-crbc-scholarship-program-scholar-557","discription":"Introduction:\nThe Higher Education Commission. Pakistan in collaboration with China Road and Bridge Corporation (CRBC) is offering fully-funded Scholarships for outstanding Pakistani engineers having valid Pakistan engineering council (PEC) registration to study masters of Engineering (transportation and its sub-fields) at south east university, China.\nNote:\nNOC from Parent Organisation is mandatory for all prospective candidates applying for the scholarship.\nDeadline:\nLast Date for Submission of applications 02-07-2018.\nContact:\nE-Mail: loo@hec.gov.pk"}}