{"0":{"tilte":"LHC takes up social media rules case tomorrow\n","link":"https:\/\/www.dawn.com\/news\/1536138\/lhc-takes-up-social-media-rules-case-tomorrow","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e5202af5d5f1.jpg","discription":"LAHORE: Lahore High Court Chief Justice Mamoon Rashid Sheikh will hear on Monday an application assailing the legitimacy of new social media regulations published by Ministry of Information, Technology and Telecommunication (MoITT).“The regulations prima facie appear to be illegal and ultra vires for contravening and exceeding the scope of Pakistan Telecommunication Reorganization Act, 1996 and the Prevention of Electronic Crime Act, 2016 (Peca) and [in] violation of fundamental constitutional rights,” argued the application moved by digital rights activist Ms Jannat Ali. Through her counsel Usama Khawar Ghumman, the applicant pleaded that the Peca, the parent law, conferred limited powers to “remove or block or issue directions for removal or blocking of access to information through any information system.She said the parent law did not give the Pakistan Telecommunication Authority (PTA) the power to sub-delegate any of its powers, including the delegation of rules to National Coordinator – a person appointed by the federal government.The applicant further contended that the federal government had very limited rule-making powers under the sections of the Peca and the PTA Act.“Neither these sections confer powers upon the federal government to frame rules that can empower its delegated functionaries to frame rules having the effect of law, nor the power to delegate is to be read as a part of the power to frame rules,” she said, adding the constitutional courts of the country also did not allow such excessive delegation and already declared such practices to be an exercise in excessive delegation liable to be struck down.She pleaded that the sub-statutory rules could not impose or create new restrictions beyond the scope of the parent law. However, she said, the impugned “Online Harm Rules” introduced a new extremely broad and vague definition of “extremism” with penal consequences infringing upon the fundamental rights of citizens.Ms Ali pointed out that the remedy for review and appeal provided under the impugned regulations was very limited and narrow. She said a high court, under the regulations, while hearing an appeal would be limited to adjudication upon grounds of the review, and not the entirety of the record.This limitation, she believed, had the effect of not providing a right of appeal to citizens whose fundamental rights, including freedom of expression, right to access to information, right to dignity and privacy, would have been infringed upon. She said this limitation would also be a blatant violation of the citizens’ rights to fair trial and access to justice.Through the application, the activist also sought the court’s permission to become a party to a pending petition in favour of the impugned regulations and urged the court to dismiss the same.Published in Dawn, February 23rd, 2020"},"1":{"tilte":"Govt remains befuddled over how to deal with online harm\n","link":"https:\/\/www.dawn.com\/news\/1535943\/govt-remains-befuddled-over-how-to-deal-with-online-harm","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e50a0a558f2b.jpg","discription":"It has been four years since the draconian Prevention of Electronic Crimes Act (Peca) was passed, but confusion still reigns in the country over how to deal with harmful content on social media. On Feb 15, the Asia Internet Coalition (AIC) — a group of internet companies, including giants such as Facebook, Twitter and Google — wrote a letter to Prime Minister Imran Khan, warning him that new rules to regulate social media activity would make it “extremely difficult” for digital companies to operate in Pakistan. Amid criticism, Prime Minister Khan said “all stakeholders” would be taken on board before implementing the new rules. Without delving into details of the process, he hoped that all internet companies would continue to work in Pakistan and that the government would address their grievances. Uncertainty persists because some officials maintain the new rules were “approved” by the federal cabinet on Jan 28, but not notified. Sources said the rules were not being implemented right now and the upcoming consultation would be focused on overall content management and ways to generate revenue. According to PM’s Focal Person on Digital Media Arslan Khalid, a working document on the consultation will be drafted by the Pakistan Telecommunication Authority (PTA) and will be made available to the public soon. The PTA says modalities regarding the process will be shared once finalised. Mr Khalid said the stakeholders, including technology firms, civil society activists, parliamentarians, lawyers and media persons, would be consulted on regulating content relating to blasphemy, child pornography, extremism, hate speech, character assassination and fake news. Under the new rules, the internet firms are required to establish permanent offices in the federal capital. About the government’s move, Science and Technology Minister Fawad Chaudhry said that “it is an economic decision which will increase advertising revenue”. However, in a recent interview with Dawn, head of the PM’s Digital Pakistan initiative Tania Aidrus said the country was not ready to invite global platforms. “Global firms, including Facebook and Google, have a defined mechanism that decides requirements to enter a country. They are incredibly cautious as they should be,” she had said, adding that the aim was to offer “comfort, legal framework, security and policy before expecting these companies to work in Pakistan”. A glance at the digital landscape reflects the same. Just over a third of Pakistan’s population or around 76 million people are online in 2020 (17pc growth from 2019). Of the total internet users, only 37m are active social media users. According to the 2020 digital report by We Are Social and Hootsuite, out of the total users the number of people who can be reached with advertising on Facebook is 33m, 6.4m for Instagram and 1.83m for Twitter. If the government is serious about attracting investment, it should demonstrate commitment towards improving the investment climate, which includes financial inclusion, supporting physical and regulatory infrastructure, lowering cost of starting a business, trading across borders, fast tracking of business transactions and resolving commercial disputes. Although Pakistan has improved its global ease of doing business ranking to 108 for 2020, it is still behind other emerging markets. Pakistan’s investment level for instance is almost half the volume attracted by growing economies like Vietnam, India, Bangladesh and Sri Lanka. There are 17pc Pakistanis who have accounts with financial institutions (but only 1pc of the citizens have credit cards) as opposed to 80pc financial inclusion in India and 41pc in Bangladesh. Pakistan spent $856m on digital advertising in 2019 as compared to India’s $6.62bn, according to the digital report. Besides, there is already an ongoing global movement to tax tech giants that supply services over internet to their citizens. A framework, released by the Organisation for Economic Cooperation and Development (OECD), would allow countries to tax large multinationals even if they did not operate inside their borders. Under the negotiations, involving over 135 countries, including Pakistan, companies will pay taxes — largely based on where their sales occur. The OECD hopes to reach a consensus-based solution with all member countries by the end of this year. Objectionable contentUnder various provisions of Peca, the “priority” categories highlighted by the government (with the exception of fake news) are deemed unlawful. In fact, the PTA has reported content to social media companies under those provisions that are related to blasphemy, sectarianism, hate speech, anti-state activity, defamation and impersonation. The government’s concern is that platforms are mostly entertaining the requests in accordance with their own community guidelines — although those guidelines overlap with most specified categories such as child pornography and extremism. Take Facebook’s example. According to the PTA, the authority has reported a total of 14,296 URLs to Facebook, out of which the platform has removed 12,226 (6,535 for violation of its own community standards).The problem, according to PTA, lies with regulating defamatory and blasphemous content that is reported in high volumes by both the public and over 30 stakeholders that can report content for removal\/blocking. “Through the e-portal, the Ministry of Religious Affairs alone has so far reported 24,725 links containing blasphemous, pornographic and sectarian material,” the PTA told Dawn. Another popular concern is protecting women, children and minorities online. For authorities investigating and pursuing these cases offline, the reality is different. According to digital rights advocacy group Bolo Bhi’s data, as of Aug 2019, 54 cases under Peca were pending in Karachi. These cases include charges under Section 21 (offences against modesty of a natural person and minority) and Section 20 (offences against dignity of a natural person). In terms of breakdown, seven accused in the cases are in jail custody, 34 are on bail, eight accused have been acquitted while there has been only one conviction. In two cases, the accused have absconded. The new rules are meant to streamline online regulation not amplify it. Unless the government is headed on the same path as its predecessor that approved Peca, the consultation is a chance to set things right.Published in Dawn, February 22nd, 2020"},"2":{"tilte":"Journalists, lawyers, rights bodies to resist move against social media\n","link":"https:\/\/www.dawn.com\/news\/1535722\/journalists-lawyers-rights-bodies-to-resist-move-against-social-media","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e4f52e9df492.jpg","discription":"ISLAMABAD: As the clamour against the government’s move to regulate social media becomes louder, the Pakistan Federal Union of Journalists (PFUJ), lawyers and civil society members have decided to launch a nationwide movement for getting the Citizens Protection (Against Online Harm) Rules revoked.Journalist unions, lawyers, and civil society organisations termed the recently notified rules unacceptable and urged the government to revoke these immediately and hold consultations over the regulation.The demands were put forward at a press conference at National Press Club here on Thursday.Representatives from the Human Rights Commission of Pakistan, the Islamabad High Court Bar Association and Media Matters for Democracy atte­nded the press conference.Nasir Zaidi, PFUJ’s secretary general, read out a joint statement contending that the rules exceeded the mandate given by the 2016 Prevention of Electronic Crimes Act.“The rules [to regulate social media] were approved by the cabinet without any debate,” Mr Zaidi said. “The clampdown on online content is the final extreme in a long series of restrictions on freedom of expression and press freedom in Pakistan.”He outlined a “plan of action” thrashed out by the PFUJ, in concert with the three “partner organisations”, to launch a countrywide drive against enforcement of the rules.“Press conferences will be held at press clubs in Karachi, Lahore, Peshawar and Quetta,” Mr Zaidi said. A national conference will be held at Islamabad’s press club on Feb 27 to work out a joint declaration on social media regulation.Speakers at the press conference said the proposed social media rules posed a severe threat to freedom of expression, media independence, and the country’s digital economy.Harris Khalique, the HRCP secretary general, said the rules framed by the federal cabinet were based on “malicious intent”.The speakers said rights guaranteed by the Constit­ution should form the basis for any law regarding social media.The Asia Internet Coalition, whose members include Facebook, Google and Twitter, has said the rules can “severely cripple” Pakistan’s digital economy and make it difficult for internet companies to offer their services to Pakistanis.The Committee to Protect Journalists and Reporters without Borders have also condemned the rules.A number of senior journalists, including M. Ziauddin and Hamid Mir, spoke on the occasion.Sadaf Khan, co-founder of Media Matters For Dem­ocracy, said claims being spread by official quarters that internet was unregulated in this country were incorrect.At the same time, the speakers welcomed a statement by the prime minister that the government would hold consultations with all stakeholders before enforcing the rules, but insisted that the proposed rules be de-notified.Published in Dawn, February 21st, 2020"},"3":{"tilte":"BJP shared deepfake video during Delhi elections: report\n","link":"https:\/\/www.dawn.com\/news\/1535619\/bjp-shared-deepfake-video-during-delhi-elections-report","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e4e9caec9408.jpg","discription":"One of the videos of Bharat Janatya Party (BJP) leader Manoj Tiwari that went viral earlier this month during the Delhi elections is deepfake, reported online publication Vice.Deepfake videos use a form of artificial intelligence called deep learning to create fake images of people and events. One of the videos had Tiwari speaking in English while the other one showed him using the same facial expressions and gestures but speaking in Haryanvi. An analysis of the two 44-second videos by Vice on Tuesday showed that the Haryanvi video is fake. Neelkant Bakshi, co-incharge of social media and IT for BJP Delhi, told Vice that the BJP IT cell had partnered with Chandigarh-based political communications firm The Ideaz Factory to create \"positive campaigns using deepfakes to reach different linguistic voter bases. \"The Haryanvi videos let us convincingly approach the target audience even if the candidate didn’t speak the language of the voter.\"The Haryanvi video was aimed primarily at Haryanvi-speaking migrant workers in Delhi to dissuade them from voting for Arvind Kejriwal's Aam Aadmi Party (AAP), according to Vice. Bakshi added that the videos were distributed across 5,800 WhatsApp groups in Delhi and the National Capital Region, reaching approximately 15 million people.However, the efforts were not successful as Kejriwal's AAP won 62 out of 70 seats in the legislative elections held in Delhi on February 8."},"4":{"tilte":"PM wants all stakeholders on board over social media rules\n","link":"https:\/\/www.dawn.com\/news\/1535362\/pm-wants-all-stakeholders-on-board-over-social-media-rules","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e4c9ea6cd462.jpg","discription":"ISLAMABAD: Amid growing criticism of newly introduced “curbs” on social media, Prime Minister Imran Khan on Tuesday directed the authorities concerned to take all stakeholders on board before implementing the new rules.Presiding over a meeting, the prime minister expressed the hope that all international social media and internet companies would continue to work in Pakistan and the government would address their grievances.“The meeting decided that all local and international stakeholders will be taken on board on new laws before their implementation,” Information Techno­logy Secretary Shoaib Siddiqui told Dawn.Mr Siddiqui, who attended the meeting, said the government was in close contact with international internet firms and soon their representatives would be invited to a meeting to apprise them of the laws and seek their suggestions for effective regulation of social media in Pakistan.Meanwhile, the Repor­ters Without Borders (RSF) has demanded of the government to rescind its rules aimed at regulating social media, saying that regulation of social media is necessary but it should not become a disguised form of censorship.Pressing ahead with its brazen attempts to bring the internet to heel, Prime Minister Imran Khan’s government adopted the new rules — called the Citizens Protection (Against Online Harm) Rules, 2020 — in a secret memo dated Jan 28, the RSF said in a statement issued on Tuesday.According to these rules, a copy of which was leaked last week, a “national coordinator” will be appointed by the ministry of information technology and telecommunications and, by way of “regulating” social media, he\/she will be empowered to arbitrarily demand the removal or blocking of any content deemed to be “harmful”, and the deactivation of the user data encryption, it said.“The vague and ambiguous wording used in these regulations testifies to the arbitrary nature of measures planned by the government,” said Daniel Bastard, the head of RSF’s Asia-Pacific desk.“We urge federal authorities to rescind these rules, which pose a major threat to journalists’ work and to respect for the confidentiality of their sources. Regulation of social media is necessary, but it should not become a disguised form of censorship.”The RSF said that rules provided for other measures designed to step up government control over social media companies. They, it added, would have to open offices in Pakistan and could be fined up to Rs500 million for every failure to remove or block content within the stipulated deadline.The statement highlighted that last month the Pakistan Electronic Media Regulatory Authority (Pemra) issued what it called a “Consultation on Regulating the Web TV and Over the Top TV (OTT) Content Services”. The RSF said that in reality it was designed to extend the government’s media censorship to online video content, but was rejected as unconstitutional by the Senate Human Rights Committee, which said that Pemra did not have the authority to do this.On Feb 15, the Asia Internet Coalition (AIC) — a group of several internet companies, including Facebook, Twitter, Google, Amazon, Airbnb, Apple, Booking.com, Expedia Group, Grab, LinkedIn, LINE, Rakuten, and Yahoo (Oath) — wrote a letter to the prime minister on Feb 15, warning him that new rules to regulate social media activity would make it “extremely difficult” for digital companies to operate in Pakistan.Under the new rules, social media companies will be obliged to disclose any information or data to a designated investigation agency, when sought. Failure to abide by any of the provisions will entail a fine of up to Rs500 million.In the letter, AIC managing director Jeff Paine expressed concern that unless revoked, “these rules would severely cripple the growth of Pakistan’s digital economy”.The group pointed out that as no other country had announced such a “sweeping set of rules”, Pakistan risked becoming a global outlier, needlessly isolating and depriving Pakistani users and businesses of the growth potential of the internet economy.The letter noted that the government had approved the rules without consultation or feedback from stakeholders and had caused international companies to “re-evaluate” their plans to operate in the country. “The way in which these rules were passed is causing international companies to re-evaluate their view of the regulatory environment in Pakistan, and their willingness to operate in the country,” it said.Besides the AIC, the Human Rights Commission of Pakistan (HRCP) and the Pakistan Federal Union of Journalists (PFUJ) have urged the government to reconsider its decision.The HRCP has expressed concern over the rules under which curbs on social media will enable the designated authorities to control freedom of expression and opinion in the guise of protecting ‘religious, cultural, ethnic and national security sensitivities”. It supported the PFUJ over its criticism of the government move and called for withdrawal of these curbs.Published in Dawn, February 19th, 2020"},"5":{"tilte":"SpaceX re-useable rocket misses landing ship\n","link":"https:\/\/www.dawn.com\/news\/1535197\/spacex-re-useable-rocket-misses-landing-ship","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e4b5bca27631.jpg","discription":"WASHINGTON: SpaceX successfully launched its latest cluster of high-speed internet satellites into orbit on Monday, but was unable to land its rocket booster on an autonomous ship, missing a key milestone.The private company founded by billionaire Elon Musk has revolutionised spaceflight in recent years by developing rockets capable of delivering their payload in space then flying back to Earth and landing upright on a target zone, ready to be-reused.It has successfully landed its booster 49 times previously and Monday’s mission would have been the 50th.“We had an on-time liftoff this morning, a good stage separation, first stage made its way back to Earth,” manufacturing engineer Jessica Anderson said during a live feed of the mission, which launched from Cape Canaveral, Florida at 10:05am.“Unfortunately, we did not land the first stage on our drone ship, but it did make a soft landing on the water right next to the drone ship, so it does look like it might be in one piece,” she added.The mission delivered the fifth load of 60 satellites of SpaceX’s broadband Starlink constellation, part of its plans to control a huge share of the future internet space market.There are now around 300 Starlink satellites in orbit and that number could one day grow to thousands.Several rivals have the same ambition, including London-based startup OneWeb and giant US retailer Amazon, whose Project Kuiper is far less advanced.These have sparked concern among astronomers that they could obscure our view of the night sky, both visually and through radio interference.Re-using rockets drastically lowers the cost of missions, and the Falcon 9 used in Monday’s launch was being flown for the fourth time.Published in Dawn, February 18th, 2020"},"6":{"tilte":"Cloud computing: invisible, versatile and highly profitable\n","link":"https:\/\/www.dawn.com\/news\/1534975\/cloud-computing-invisible-versatile-and-highly-profitable","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e4a109f0e1f6.jpg","discription":"SAN FRANCISCO: With each passing quarter, Amazon, Microsoft and Google have been setting new records, while cloud computing has become the invisible backbone supporting much of our daily lives. Its potential to become an even bigger part of people’s daily existence is sky-high.The rising popularity of the cloud has gone hand-in-hand with that of 4G broadband technology and of smartphones: The combined power of the network and of servers makes it possible for us to listen to music, to watch videos, to work remotely, to post on social media or to request a ride and watch it arrive, in real time, on a smartphone map.Companies and individuals can buy not just cloud-based storage but also processing power, Internet services and software, all of it situated not in one’s computer or smartphone but in huge data centres.There are now even cloud services for video games, which require enormous amounts of data and extremely rapid response times.“Cloud gaming,” as with other uses, lets users dispense with expensive and fast-outdated equipment.Most big companies and institutions now access the cloud either through their own private servers or as a client of a public cloud provided by a company such as Amazon, Microsoft or Google.These big providers offer an array of options, from simple hosting to ultra-complete online services, with an a la carte menu of tools and software, and with programmes ensuring maintenance and security.The public cloud can thus provide savings while also allowing greater flexibility as users’ needs evolve.In practice, many companies choose a hybrid approach, melding the lower cost, greater power and high adaptability of the public cloud with the comforting security of a private cloud.“Companies on average use about three different public-cloud providers,” said Bob O’Donnell, president and chief analyst at TECHnalysis Research.While some companies grew up in the data world, he added, “let’s not forget that lots of companies have been moving slowly and cautiously; plenty of companies are just getting started.” In 2020, the market for the public cloud is expected to reach $266 billion, a 17 percent increase over 2019, according to Gartner Consulting.And market research firm IDC (International Data Corporation) predicts a near-doubling of the market by 2023, to $500 billion.The 2006 launch of Amazon Web Services (AWS) gave the online giant a huge lead over its competitors. Analysts put its current share of the global public-cloud market at 30 to 50 percent.AWS had 2019 revenues of $35 billion and claims millions of users worldwide.It did suffer one setback last year: In October, the Pentagon awarded a mega-contract worth $10 billion to Microsoft, the second largest player in the market.Against a backdrop of hostility between US President Donald Trump and Amazon boss Jeff Bezos, the company is taking legal action in an attempt to block the Microsoft contract.A federal court on Thursday ordered the Pentagon to temporarily halt its work with Microsoft while the matter is reviewed.Microsoft, meanwhile, has not released precise figures on the success of Azure, its public cloud, making comparisons difficult. But the company’s cloud division has turned in Microsoft’s best performances, quarter after quarter. Azure controls approximately 15 percent of the market.Trailing it are Google Cloud and China’s Alibaba, each with a five or six percent share.For Google, the American leader in internet research, the cloud is a growing priority: It showcases the company’s capacity for very large-scale data analysis as well as the ability for users of the hybrid cloud or of multiple clouds to easily shift data from one provider to ano­ther. Google Cloud took in $9 billion in 2019 (up 53 per cent in a year).Published in Dawn, February 17th, 2020"},"7":{"tilte":"PTA’s mobile phone registration system fails to lessen street crimes\n","link":"https:\/\/www.dawn.com\/news\/1534948\/ptas-mobile-phone-registration-system-fails-to-lessen-street-crimes","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e4a0c6e34978.jpg","discription":"KARACHI: A technology-driven initiative launched by the federal authorities a year ago to curb the risks associated with the use of illegal mobile phone sets in the country has failed to make any impact on curbing street crimes — one of the key sources behind trade of second-hand sets — as the number of snatching\/theft incidents in 2019 touched three-year high.Data compiled by the Karachi police and the Citizens-Police Liaison Committee (CPLC) raised questions on effectiveness of the much-publicised Device Identification, Registration & Blocking System (DIRBS), which was launched in January 2019 as the authorities had claimed that the new technology would curb the risks associated with the use of illegal mobile handsets in the country that would ultimately lead to curb street crimes.The data said in 2019 — when DIRBS was put in place — 45,034 mobile phones were snatched or stolen in Karachi.However, a total of 35,458 such incidents were reported in 2018 and in 2017 total 30,814 crimes of that nature were reported.“DIRBS was launched in order to curb the risks associated with the use of illegal mobile handsets in country by the PTA [Pakistan Telecommunication Authority] and enforced its implementation through cellular mobile operators,” said an industry source. “The system was intended to verify, detect and discourage illegal, non-compliant, non-tax paid handsets and devices by authenticating currently active devices on cellular networks and ensuring continual monitoring as new devices are activated. Before the introduction of DIRBS, handsets with valid and invalid IMEIs were brought into Pakistan through legal and grey channels.”He said that several problems emerged after the implementation of the system including high taxation, negative impact on used handset retail industry and affordability of handsets on the back of discouraging business environment and lack of awareness among the people. But apart from the dent to the cellular industry and handset trade, it was a new phenomenon, which was identified recently that the system had not even helped curbing street crimes as originally envisaged by the authorities.The question emerged about the reason behind the rise in street crimes despite the system was in place to curb such illegal activities.Investigators cite some surprising facts, which they have found during the course of their job, claiming that it’s no more a secret that the handsets being snatching and stolen in the city, are being trafficked to neighbouring countries through illegal channels.“I am not sure about Iran but definitely we have found in our investigations of multiple cases that these handsets [snatched and stolen in Karachi] are trafficked to Afghanistan,” said Raja Umar Khattab of the Counter Terrorism Department (CTD). “It’s an organised crime so the people involved in the trade have made proper arrangements. What we need to do is to check where and who is breaching this system.”He said that the handsets which were not useable due to DIRBS after they were snatched or stolen in Karachi were packed to be sent to Afghanistan but he was not convinced that the new system was fully effective even within the country.“It needs to be checked and checked again. I think if the number of cellphone snatching is still increasing and such business is still effective despite the system is in place, we need to do a technical audit of the entire exercise and the system and fix issues where required,” he added.Published in Dawn, February 17th, 2020"},"8":{"tilte":"Sarmayacar bets on mobile gaming by investing in Revolving Games\n","link":"https:\/\/www.dawn.com\/news\/1534007\/sarmayacar-bets-on-mobile-gaming-by-investing-in-revolving-games","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e438b6416e6e.jpg","discription":"Revolving Games, a brainchild of brothers Ammar Zaeem and Shayan Zaeem who have a decade of mobile game development experience under their belt, is set to launch its first game next year, said Sarmayacar — a venture capital firm for tech startups — in a press statement. Revolving Games is developing a massively multiplayer online game, bringing together some of the world’s best gaming leadership, with development and design capabilities from a San Francisco office while benefiting from cost advantages that come with operations being primarily based out of Lahore, said the statement. Kyle Bricker, the executive producer at the San Francisco Studio, brings 25 years of experience in product and software. After an injection of $12 million from a global publishing giant and a seed investment led by Sarmayacar, Revolving Games is moving towards the launch of its first game in 2021.“Pakistan’s young engineering talent has the potential to make the country into a game development hub within the global gaming ecosystem,\" said Rabeel Warraich, founder and CEO of Sarmayacar.\"Revolving Games is a startup that has 10 years of hard work behind it [...]. Our team consists of veteran rock stars that have designed, engineered and produced games that generated over $3 billion in lifetime revenue,” said Ammar.Shayan, who is the president of Worldwide Studios, added, “We have spent almost a decade training talent in Pakistan, this type of a boutique game studio model is helping our Pakistan team grow at 5x the rate than it previously did in any other partnership.\" Ammar and Shayan, along with their brother Saad previously founded Caramel Tech Studios, a leading game studio that originated in Pakistan.Sarmayacar is a Netherlands-based venture capital firm that invests in budding tech-based startups with the aim to help build \"scalable, market-transforming enterprise and consumer technology businesses in Pakistan\", according to its website. The company's clients include local startups like Bykea, Dot & Line and Patari, among others."},"9":{"tilte":"Year-end review: Uber or Careem, which works better for Pakistan?","link":"https:\/\/www.dawn.com\/news\/1301230\/year-end-review-uber-or-careem-which-works-better-for-pakistan","img":"https:\/\/i.dawn.com\/i.dawn.com\/medium\/2016\/12\/584937053207b.jpg?r=778008166","discription":"The days of standing at the corner of a street and waiting for a rickshaw or taxi may soon be coming to an end.On-demand transport can now be availed with a few swipes on a smart phone, thanks to ride-sharing services like Uber and Careem. Over the past few years, such services have made a big mark as they look to challenge the conventional taxi business. In the cities where they operate, users can hail a ride from almost any corner or from the comfort of their own home. Careem does not operate in some areas of Karachi but is available in Islamabad and Lahore. Uber, on the other hand, is only available in Lahore and Karachi. Let's take a look at both services and analyse some of their advantages and shortcomings.Currently, Uber offers two services to travellers: cars and rickshaws.The rickshaw rides Uber offers are quite cheap, with a base fare of Rs35 and an additional charge of Rs3 per kilometre. If the rickshaw is made to wait, you may be charged an additional Rs1 per minute. The minimum charges are Rs50 and if the booking is cancelled the same amount has to be paid. In the car, the minimum cost is Rs100 while the charges for making the driver wait are Rs2 per minute. The variable fare stands at Rs9.38 per kilometer and the minimum charges are Rs150 which have to be paid even if the ride is cancelled.Careem offers users four options: Go, Economy, Wifi Cars and Business.For 'Go,' Careem charges at least Rs150 while the basic fare is Rs100. The variable fare stands at Rs11 per kilometre. For 'economy,' the minimum charges are Rs175, whereas for 'business' and 'wifi cars' the the minimum charge is Rs250.\nUber and Careem both allow their users to pay by either credit card or cash. Additionally Careem also allows users to preload credit to their accounts and automatically deducts the cost of each ride.In both Uber and Careem, just like in a taxi, it is a stranger driving the car. Therefore, the issue of safety is of prime concern. Both companies are taking precautions in this regard, when it comes to signing drivers, to ensure safety of their customers.It is a fact that Uber's service has faced criticism in many parts of the world due to incidents of sexual assault involving drivers and customers. This appears to be one explanation for why women in Pakistan prefer Careem’s service.After talking with some male Uber users, it seems that while they use the service themselves they advise family members, especially female, to opt for Careem, citing the incidents of assault from around the world.Although it’s not possible to comprehensively rate one company over another just because of what some people say, most women we spoke to for this story said they would choose Careem over Uber because of “well-behaved drivers”, “better service”, and “a sense of security.” On the other hand, most male users had similar impressions of both services. Some of the male users we spoke to did agree that Careem stands out because of their “well-trained and courteous drivers.” To them, despite the fact that Uber is a relatively low cost alternative to Careem, its drivers lack the level of professionalism one expects and there is a perception that they are hired without sufficient background checks. This does not mean that Careem is free of any shortcomings. Browsing through its Facebook page, you find complaints about drivers’ bad behavior; some people also claimed that they were charged for making the captain wait even though it was the captain who had arrived late. On Uber’s Facebook page, one is more likely to see positive comments and feedback. Some of the user complaints on the page are related to cars arriving late and customers still being charged for the wait. Some people have also complained about Uber Auto rickshaw drivers’ attitudes and lack of proper training when it comes to using the App provided to them.\nUber’s Facebook presence is robust and almost every individual comment on their page is responded to with instructions for lodging a complaint. On the other hand, Careem’s Facebook page is not as active if one draws a comparison.  Although these services are relatively new in Pakistan, they are sure to reduce public transport woes by a significant margin and mark the end of traditional taxi and rent-a-car business’ dominance in the long run. As smartphone penetration increases, taxi and rickshaw drivers that struggle to adopt new technologies may find themselves in trouble. This is due to the fact that both companies have become immensely popular in such a short time and are widely used by young, employed people who are most likely to be smartphone users. It appears that these companies are focusing more and more on this demographic, in the hope of positive experiences and reviews that translate to rapid growth in the near future. However, it is likely that these companies face resistance and backlash from local transport unions whose businesses could be adversely affected. This story was originally published on Dawnnews.tv and has been translated by Bilal Karim Mughal and Sameyah Said.\n"},"10":{"tilte":"Internet services disrupted across Pakistan as submarine cables go offline\n","link":"https:\/\/www.dawn.com\/news\/1513609\/internet-services-disrupted-across-pakistan-as-submarine-cables-go-offline","img":"https:\/\/i.dawn.com\/medium\/2019\/10\/5db858cde1281.jpg","discription":"Internet services across the country were impacted on Tuesday evening, following a fault that developed in international submarine cables that connect Pakistan.\"We regret to inform you that due to international submarine cable fault, internet services are impacted across Pakistan,\" said Pakistan Telecommunication Company Limited (PTCL) in a post on Twitter.\"Our technical teams are working on fully restoring internet services. We apologise for any inconvenience caused and thank you for your patience.\" Pakistan Telecommunication Authority, in a statement, said: \"Due to a fault in the international submarine cable, internet services have been affected.\"\"Since today evening, some areas of Pakistan experienced a disruption in services,\" said the PTA spokesperson.The telecom authority said that PTCL, along with international organisations, \"are working to ascertain the location where the fault has developed\".According to ProPakistani, two submarine cables have gone offline, disrupting internet in Pakistan.\"IMEWE and SEAMEWE 4, that carry almost 50 per cent of Pakistan’s internet traffic, went offline due to a fault at a location that’s yet not determined,\" it said.Internet users across the country will experience downgraded speeds until the fault is fixed, ProPakistani reported, adding that, internet service providers \"are in the process of shifting the load to other submarine systems, that will balance the load to an extent\".An internet outage also occurred earlier this year, in June, when services were disrupted due to \"multiple cable cuts\"."},"11":{"tilte":"In line with digital vision, PM Imran invites tech firms to invest in Pakistani youth\n","link":"https:\/\/www.dawn.com\/news\/1529881\/in-line-with-digital-vision-pm-imran-invites-tech-firms-to-invest-in-pakistani-youth","img":"https:\/\/i.dawn.com\/medium\/2020\/01\/5e2837723a537.jpg","discription":"Prime Minister Imran Khan on Wednesday met with several heads of digital and technology firms, including Christian Klein, the chief operating officer of SAP — a European software cooperation, Susan Wojcicki, CEO of YouTube and Joe Kaeser, CEO of Siemens.In the meeting held on the sidelines of the World Economic Forum (WEF), Klein \"expressed SAP's commitment to train young software engineers in Germany and using them for software development in Pakistan\", a tweet from the Prime Minister's office said. Klein made the comment after Prime Minister Imran offered SAP to establish software labs in Pakistan. Adviser on Finance Dr. Abdul Hafeez Sheikh, Adviser on Commerce Abdul Razaq Dawood, Special Adviser to Prime Minister Syed Zulfiqar Abbas Bukhari, Special Adviser to Prime Minister Dr. Moeed Yusuf and Ambassador at Large on Foreign Investment Ali Jehangir Siddiqui were also present in the meeting.Prime Minister Imran is in Davos to attend this year's WEF. Earlier today, he spoke at the Pakistan Strategy Dialogue, where he said that Pakistan was considered one of the most dangerous places in the world when his government took over but that \"we had decided to partner with peace\".According to the Foreign Office, the prime minister will speak to senior international media persons and editors during a session with the Forum’s international media council.This year marks the 50th anniversary of the WEF where political leaders, business executives, heads of international organisations and civil society representatives will deliberate on contemporary economic, geopolitical, social and environmental issues.Joe Kaeser, CEO of Siemens called on Prime Minister Imran Khan at Davos, on the sidelines of WEF.Adviser on Commerce Abdul Razaq Dawood, SAPM Syed Zulfiqar Abbas Bukhari, Ambassador at Large on Investments Ali Jehangir Siddiqui were also present.While appreciating the long association of Siemens with Pakistan's energy sector, Prime Minister Imran stated that skills development of youth is among top priorities of the government. In this regard, the prime minister expressed his desire for Siemens to introduce high technology skills training programs for Pakistani engineers under the 'Hunarmand Jawan' programme.The prime minister emphasised that skills development will ultimately lead to employment generation and economic growth in the country. He also invited Siemens to support Pakistani universities. Prime Minister Imran also extended an invitation to the CEO of Siemens to visit Pakistan.Susan Wojcicki, CEO of YouTube also called on Prime Minister Imran Khan in Davos.SAPM Syed Zulfiqar Abbas Bukhari and Ambassador at large on Investments Ali Jehangir Siddiqui, Head of Digital Pakistan Tania Aidrus were also present during the exchange.According to a press release, discussions on utilising digital platforms for building Pakistan's image were held. The Pakistani entourage also discussed the possibilities of promoting tourism, education and attracting investment through digital platforms."},"12":{"tilte":"Apple takes smartphone sales crown from Samsung\n","link":"https:\/\/www.dawn.com\/news\/1531865\/apple-takes-smartphone-sales-crown-from-samsung","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e35798ca4169.jpg","discription":"Apple was the top smartphone seller in the final quarter of last year, seizing the crown from Samsung, according to market trackers.Apple shipped an estimated 73.8 million iPhones during the fourth quarter, driven by the popularity of its newest models in the US and Europe and lower-priced handsets in other parts of the world, International Data Corporation reported this week.Apple, which has been below Samsung for some time, \"is recovering, due to cheaper iPhone 11 pricing and healthier demand in Asia and North America,\" said Neil Mawston of Strategy Analytics, whose separate survey also showed Apple on top in the past quarter.South Korean consumer electronics giant Samsung delivered some 69.4 million handsets as it slipped to the number two position, according to IDC.Chinese smartphone powerhouse Huawei remained a strong player in its home market, but saw sales of premium models take a hit in Western Europe in the wake of US sanctions, according to IDC analyst Melissa Chau.\"Things will continue to look challenging for Huawei given that the trade war is still not yet resolved, while new uncertainty raised around the Wuhan coronavirus could potentially have adverse effects on not just Huawei, but all players reliant on the China smartphone supply chain,\" Chau said.Huawei shipped 56.2 million smartphones during the quarter, a decline of about seven percent from the same period a year earlier, IDC reported.IHS Markit senior analyst Anna Ahrens said Huawei faces headwinds because of US sanctions which have prevented it from getting key components and software.\"In markets like Western Europe, the lack of Google services will make Huawei phones a hard sell for consumers, especially considering that the company's Mate series is positioned squarely in the premium price segment,\" Ahrens said.Samsung remained the top smartphone seller overall last year, and the broader market is expected to get a boost as 5G telecom networks get established and new smartphones synched to them are launched.For the full year, overall smartphone sales were down around one percent despite an improving trend in the fourth quarter, according to IDC and Strategy Analytics surveys.IDC reported shipments of 368 million handsets in 2019 compared with 373 million a year earlier, marking a third consecutive yearly decline."}}