{"0":{"tilte":"Iranian deputy health minister, lawmaker test positive for coronavirus as death toll climbs to 16\n","link":"https:\/\/www.dawn.com\/news\/1536603\/iranian-deputy-health-minister-lawmaker-test-positive-for-coronavirus-as-death-toll-climbs-to-16","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e553ce61d30c.jpg","discription":"\nIran's Deputy Health Minister Iraj Harirchi and a member of parliament tested positive for the coronavirus as the death toll inside the country rose to 16 on Tuesday as Iranians worry that authorities could be underestimating the scale of outbreak.\nIran has the highest number of coronavirus deaths outside China, where the virus emerged in December and more than 2,600 have died.\n \n“My corona test is positive [...] I don't have a lot of hope of continuing life in this world,” Mahmoud Sadeghi, the parliamentarian from Tehran, wrote on Twitter.\nAlso among the infected was the deputy health minister, who posted a video online announcing his infection which was shown on state media.\n“Among those who had been suspected of the virus, 35 (new cases) have been confirmed and two died of the coronavirus infection,” said Health Ministry spokesman Kianush Jahanpur. He said 95 people had been infected across Iran.\nJahanpur put the death toll at 15, but the state news agency later said one person infected by the virus had died in the city of Saveh. Some unconfirmed reports gave a higher death toll.\nThe outbreak in Iran has coincided with mounting US pressure on Iran's clerical rulers that has hit the economy hard. In 2018, the United States exited Tehran's nuclear deal with major powers and reimposed sanctions.\nWorried that official numbers could underestimate the scale of Iran's outbreak, many Iranians took to social media to accuse authorities of concealing facts.\nPopular anger has been high for months over the handling of a Ukrainian passenger plane crash in January, which the military took three days to admit was caused by an Iranian missile fired in error.\nThe incident revived anti-government protests that rocked the country in November against a hike in fuel prices, which swiftly turned political with calls for Iran's rulers to step down, before authorities cracked down.\nThe head of the Medical Science University in the holy city of Qom, Mohammad Reza Ghadir, expressed concern over “the spread of those people infected by the virus across the city”, adding the health ministry had banned releasing figures linked to the coronavirus.\nAuthorities on Tuesday ordered the nationwide cancellation of concerts and soccer matches and the closure of schools and universities in many provinces, and urging Iranians to stay home.\nIran said on Monday 900 cases were suspected, dismissing claims by a lawmaker from Qom who said 50 people had died in the city, the epicentre of the new coronavirus outbreak.\n“It is an uninvited and inauspicious visitor. God willing we will get through [...] this virus,” said Iranian President Hassan Rouhani in a televised speech.\nIran, which confirmed its first two deaths last week in Qom, has yet to say how many people it has quarantined, but the semi-official Mehr news agency said 320 people had been hospitalised.\nThe virus outbreak threatens to isolate Iran further, with several countries suspending flights after coronavirus cases in travellers from Iran were confirmed in Canada, Lebanon, the United Arab Emirates, Afghanistan and Iraq.\nSome neighbouring countries closed their borders. United Arab Emirates state media said Dubai airport had suspended all flights to and from Iran.\nOman's Khasab port is suspending the import and export of goods to and from Iran from Wednesday, operator Marafi said on Twitter.\nUS State Secretary Mike Pompeo on Tuesday said the United States was “deeply concerned” Iran may have covered up details about the spread of coronavirus, and he called on all nations to “tell the truth.”\n“The US is deeply concerned by information indicating the Iranian regime may have suppressed vital details about the outbreak in that country,” Pompeo told reporters, as he also criticised Beijing for what he characterised as the censorship of media and medical professionals.\n“All nations, including Iran, should tell the truth about the coronavirus and cooperate with international aid organisations,” he said. "},"1":{"tilte":"New social media regulations could hamper freedom of expression, digital economy: Alice Wells\n","link":"https:\/\/www.dawn.com\/news\/1536604\/new-social-media-regulations-could-hamper-freedom-of-expression-digital-economy-alice-wells","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e554a1f08c40.jpg","discription":"\nChief US diplomat for South Asian affairs, Alice Wells, on Tuesday expressed concern over the Pakistan government's new social media regulations, adding that they \"could be a setback to freedom of expression and development of digital economy\".\nTaking to Twitter, she stated: \"Unfortunate if Pakistan discourages foreign investors and stifles domestic innovation in such a dynamic sector. Encourage discussion with stakeholders.\"\n \nOn February 12, the federal cabinet had approved a set of rules to regulate social media in the country, under which social media companies will be obliged to disclose any information or data to a designated investigation agency, when sought, and failure to abide by any of the provisions will entail a fine of up to Rs500 million.\nThe information to be provided may include subscriber information, traffic data or content data.\nUnder the rules, social media platforms will be required to remove any ‘unlawful content’ pointed out to them in writing or electronically signed email within 24 hours, and in emergency cases within six hours.\nThese firms will have to establish registered offices with a physical address located in Islamabad within the next three months. These companies will also be required to appoint a Pakistan-based focal person for coordination with the relevant authorities within three months and establish one or more database servers in Pakistan within 12 months to record and store data and online content.\nThe move drew criticism from all quarters, as critics voiced the concern the curbs would enable the designated authorities to control freedom of expression and opinion under the guise of protecting ‘religious, cultural, ethnic and national security sensitivities’.\nResponding to the uproar, Special Assistant to the Prime Minister on Information and Broadcasting Firdous Ashiq Awan had defended the policy, stating that the new rules had been created for the protection of citizens.\n\"There was no mechanism that protected our citizens' interests [... or] our national integrity,\" she had said, adding that after the enactment of the new policy, social media companies would be mindful of hurting Pakistan's national interests.\nThe new rules, Awan had said, would not only expose Pakistan's opponents but would also enable authorities to stop extremists who spread hate on the basis of religion and race."},"2":{"tilte":"In New Delhi, Trump reiterates offer to mediate on Kashmir\n","link":"https:\/\/www.dawn.com\/news\/1536601\/in-new-delhi-trump-reiterates-offer-to-mediate-on-kashmir","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e551b4da2063.jpg","discription":"\nChief US diplomat for South Asian affairs, Alice Wells, on Tuesday expressed concern over the Pakistan government's new social media regulations, adding that they \"could be a setback to freedom of expression and development of digital economy\".\nTaking to Twitter, she stated: \"Unfortunate if Pakistan discourages foreign investors and stifles domestic innovation in such a dynamic sector. Encourage discussion with stakeholders.\"\n \nOn February 12, the federal cabinet had approved a set of rules to regulate social media in the country, under which social media companies will be obliged to disclose any information or data to a designated investigation agency, when sought, and failure to abide by any of the provisions will entail a fine of up to Rs500 million.\nThe information to be provided may include subscriber information, traffic data or content data.\nUnder the rules, social media platforms will be required to remove any ‘unlawful content’ pointed out to them in writing or electronically signed email within 24 hours, and in emergency cases within six hours.\nThese firms will have to establish registered offices with a physical address located in Islamabad within the next three months. These companies will also be required to appoint a Pakistan-based focal person for coordination with the relevant authorities within three months and establish one or more database servers in Pakistan within 12 months to record and store data and online content.\nThe move drew criticism from all quarters, as critics voiced the concern the curbs would enable the designated authorities to control freedom of expression and opinion under the guise of protecting ‘religious, cultural, ethnic and national security sensitivities’.\nResponding to the uproar, Special Assistant to the Prime Minister on Information and Broadcasting Firdous Ashiq Awan had defended the policy, stating that the new rules had been created for the protection of citizens.\n\"There was no mechanism that protected our citizens' interests [... or] our national integrity,\" she had said, adding that after the enactment of the new policy, social media companies would be mindful of hurting Pakistan's national interests.\nThe new rules, Awan had said, would not only expose Pakistan's opponents but would also enable authorities to stop extremists who spread hate on the basis of religion and race.\nUS President Donald Trump on Tuesday reiterated his earlier offer to mediate between India and Pakistan on Kashmir, adding that his relationship with the leaders of both the countries is strong.\nThe US president made the comments while addressing a press conference in the Indian capital on the last day of his two-day visit, after holding meetings with the Modi administration. \nTrump's remarks came in response to a question on terrorism in Pakistan.\n\"We talked a lot about it at length today. No question it is a problem. They are working on it. I said I will do whatever I can do to help because my relationship with both gentlemen [Prime Minister Imran Khan and Indian PM Narendra Modi] is so good. Anything I can do to mediate, I would do,\" he said.\n\"They [Pakistan] are working on Kashmir. Kashmir has been a thorn in lots of people's sides for a long time. There are two sides to every story. We discussed terrorism at length today,\" he added.\nHowever, when pressed further by another reporter about India's past rejection of his offers, the publication quoted Trump as saying: \"I didn't say anything about that [being a mediator]. Kashmir obviously is a big problem between India and Pakistan, they are going to work out their problem. They have been doing it for a long time.\"\nTrump has offered to mediate between the two countries on Kashmir on multiple occasions. Earlier this year, he reiterated the same during a meeting with Imran on the sidelines of the World Economic Forum assembly in Davos, Switzerland.\nHowever, India has categorically rejected the offer to mediate, calling the issue an internal matter. Most recently, Indian Ministry of External Affairs Spokesperson Raveesh Kumar said: \"There is no role for any third party in the Kashmir issue. It is a bilateral issue between India and Pakistan.\"\nElsewhere in the Indian capital, new violence erupted a day after at least seven people, including a police officer, were killed and nearly 100 others reportedly injured in clashes between hundreds of supporters and opponents of a new Indian citizenship law, police said.\nProtesters in several areas of northeast Delhi defied orders prohibiting the assembly of more than five people and threw stones and set some shops and vehicles on fire, a police officer said. Some homes were attacked with rocks.\nHowever, on Tuesday, Trump declined to comment on India's new citizenship law. \"I don't want to discuss that. I want to leave that to India,\" he said. But he added that he privately had raised the issue of religious freedom with Modi and that \"Modi was incredible on the subject\".\n\"He wants people to have religious freedom,\" said Trump, who proposed temporarily barring all Muslims from entering the US during his 2016 campaign and successfully implemented a travel ban that targets travelers from certain Muslim countries"},"3":{"tilte":"Citizenship law protests overshadow Trump visit as over a dozen killed in Delhi\n","link":"https:\/\/www.dawn.com\/news\/1536576\/citizenship-law-protests-overshadow-trump-visit-as-over-a-dozen-killed-in-delhi","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e54ac82ca7f5.jpg","discription":"\nChief US diplomat for South Asian affairs, Alice Wells, on Tuesday expressed concern over the Pakistan government's new social media regulations, adding that they \"could be a setback to freedom of expression and development of digital economy\".\nTaking to Twitter, she stated: \"Unfortunate if Pakistan discourages foreign investors and stifles domestic innovation in such a dynamic sector. Encourage discussion with stakeholders.\"\n \nOn February 12, the federal cabinet had approved a set of rules to regulate social media in the country, under which social media companies will be obliged to disclose any information or data to a designated investigation agency, when sought, and failure to abide by any of the provisions will entail a fine of up to Rs500 million.\nThe information to be provided may include subscriber information, traffic data or content data.\nUnder the rules, social media platforms will be required to remove any ‘unlawful content’ pointed out to them in writing or electronically signed email within 24 hours, and in emergency cases within six hours.\nThese firms will have to establish registered offices with a physical address located in Islamabad within the next three months. These companies will also be required to appoint a Pakistan-based focal person for coordination with the relevant authorities within three months and establish one or more database servers in Pakistan within 12 months to record and store data and online content.\nThe move drew criticism from all quarters, as critics voiced the concern the curbs would enable the designated authorities to control freedom of expression and opinion under the guise of protecting ‘religious, cultural, ethnic and national security sensitivities’.\nResponding to the uproar, Special Assistant to the Prime Minister on Information and Broadcasting Firdous Ashiq Awan had defended the policy, stating that the new rules had been created for the protection of citizens.\n\"There was no mechanism that protected our citizens' interests [... or] our national integrity,\" she had said, adding that after the enactment of the new policy, social media companies would be mindful of hurting Pakistan's national interests.\nThe new rules, Awan had said, would not only expose Pakistan's opponents but would also enable authorities to stop extremists who spread hate on the basis of religion and race.\nUS President Donald Trump on Tuesday reiterated his earlier offer to mediate between India and Pakistan on Kashmir, adding that his relationship with the leaders of both the countries is strong.\nThe US president made the comments while addressing a press conference in the Indian capital on the last day of his two-day visit, after holding meetings with the Modi administration. \nTrump's remarks came in response to a question on terrorism in Pakistan.\n\"We talked a lot about it at length today. No question it is a problem. They are working on it. I said I will do whatever I can do to help because my relationship with both gentlemen [Prime Minister Imran Khan and Indian PM Narendra Modi] is so good. Anything I can do to mediate, I would do,\" he said.\n\"They [Pakistan] are working on Kashmir. Kashmir has been a thorn in lots of people's sides for a long time. There are two sides to every story. We discussed terrorism at length today,\" he added.\nHowever, when pressed further by another reporter about India's past rejection of his offers, the publication quoted Trump as saying: \"I didn't say anything about that [being a mediator]. Kashmir obviously is a big problem between India and Pakistan, they are going to work out their problem. They have been doing it for a long time.\"\nTrump has offered to mediate between the two countries on Kashmir on multiple occasions. Earlier this year, he reiterated the same during a meeting with Imran on the sidelines of the World Economic Forum assembly in Davos, Switzerland.\nHowever, India has categorically rejected the offer to mediate, calling the issue an internal matter. Most recently, Indian Ministry of External Affairs Spokesperson Raveesh Kumar said: \"There is no role for any third party in the Kashmir issue. It is a bilateral issue between India and Pakistan.\"\nElsewhere in the Indian capital, new violence erupted a day after at least seven people, including a police officer, were killed and nearly 100 others reportedly injured in clashes between hundreds of supporters and opponents of a new Indian citizenship law, police said.\nProtesters in several areas of northeast Delhi defied orders prohibiting the assembly of more than five people and threw stones and set some shops and vehicles on fire, a police officer said. Some homes were attacked with rocks.\nHowever, on Tuesday, Trump declined to comment on India's new citizenship law. \"I don't want to discuss that. I want to leave that to India,\" he said. But he added that he privately had raised the issue of religious freedom with Modi and that \"Modi was incredible on the subject\".\n\"He wants people to have religious freedom,\" said Trump, who proposed temporarily barring all Muslims from entering the US during his 2016 campaign and successfully implemented a travel ban that targets travelers from certain Muslim countries\nMore than a dozen people have been killed and hundreds injured in clashes between opposing groups of protesters in New Delhi, hospital officials said on Tuesday, as riots overshadowed US President Donald Trump's first official visit to India.\nThe clashes, the worst in the capital since unrest over a new citizenship law began in December, started at the weekend but turned deadly on Monday. \nViolence erupted again in multiple areas of northeast Delhi on Tuesday, just miles away from where Trump and Indian Prime Minister Narendra Modi met for talks.\nAfter the talks, Trump told reporters that he had heard about the violence, but did not discuss it with Modi.\nHe later declined to comment on the citizenship law. \"I don't want to discuss that. I want to leave that to India and hopefully they're going to make the right decision for the people,\" Trump said.\nAccording to the Scroll.in, angry mobs threw stones and petrol bombs at Muslim homes in Kabir Nagar, near Maujpur. Journalists were also attacked and many were forced to delete pictures and videos from their phones, the publication added.\nThe report added that Delhi Chief Minister Arvind Kejriwal had said he had a \"positive meeting\" with Home Minister Amit Shah regarding the riots in the Indian capital. Speaking to the media, he maintained that police were outnumbered and were unable to take action as they did not have orders to do so, the publication said.\nA photo posted by Instagram (@instagram) on Mar 22, 2015 at 11:21am PDT\n \nAccording to The Wire, stone-pelting and arson have continued in the Ghonda area, close to Maujpur.\nAcross the locality, The Wire saw broken and burnt vehicles, burnt shops and vehicles still on fire. There were some police standing at the edge of the Hindu-majority area, but did not intervene when vehicles were burning, the publication said. \nIn the Bhajanpur area in the city's northeast, black smoke rose into the sky after Hindu protesters set fruit and vegetable shops and a Muslim shrine on fire, witnesses said.\nMeanwhile, a mosque in Ashok Nagar neighbourhood was set on fire late on Tuesday afternoon, The Wire reported. It said a mob shouting “Jai Shri Ram” and “Hinduon ka Hindustan” paraded around the mosque, and a Hanuman flag was placed on the mosque's minaret. Shops near the mosque were looted by the mob.\nCommenting on the development, President Arif Alvi in a tweet termed the vandalising of the mosque a \"disgraceful act\". \"It seems to be a reminder to Muslims of the Babri Masjid episode. I think secular forces within India should rise against such barbaric actions,\" he wrote.\n \nThe clashes erupted in a northeastern district of the city between thousands of people demonstrating for and against the new citizenship law. \nEyewitnesses said the violence continued overnight, and several shops were broken. “There was stone pelting in the area early this morning also,” a resident was quoted as saying.\n \nTensions in parts of the city remained high on Tuesday with schools remaining shut in some areas amid news reports of fresh clashes. At least five metro stations in the city were closed.\nDeputy Chief Minister Manish Sisodia tweeted that schools in the capital's northeast would be shut on Tuesday and exams postponed.\n \nAn official at Guru Teg Bahadur Hospital in New Delhi said 13 people had died there and more than 150 injured had been treated at the hospital, many from bullet wounds.\nAn official at the Al-Hind Hospital in New Delhi said two men had died and over 200 injured had been treated there.\nA fire department official said his teams were responding to more than a dozen calls over arson attacks, despite emergency measures prohibiting any gatherings in the violence-hit areas.\n“We have sought police protection as our vehicles are being blocked from entering the affected areas. The situation is very grim,” Delhi Fire Department Director Atul Garg said.\nOne fire department vehicle was torched by protesters on Monday and a small number of firemen were injured, Garg added.\nThe joint commissioner of police, Alok Kumar, said around 3,500 police and paramilitary officers had been deployed.\nPolice fired teargas and pellets to scatter demonstrators protesting against the citizenship law in the Jafrabad neighbourhood of northeast Delhi on Tuesday. A young man suffered a pellet wound to his thigh, while another sustained injuries to his eyes, leaving his face bloodied.\nThe violence on Monday began just as Trump arrived on his maiden visit to India. \n \nAt a press conference early on Tuesday, Delhi Chief Minister Arvind Kejriwal appealed for people to maintain peace.\n \n\"Whatever problems people have can be resolved peacefully,\" he said. \"Violence will not help find a solution.\"\nIndia's capital has been a hotbed of protests against the new Citizenship Amendment Act (CAA), which eases the path of non-Muslims from three neighbouring Muslim-dominated countries to gain Indian citizenship.\nThis has led to accusations that Modi and his Hindu nationalist Bharatiya Janata Party (BJP) are undermining India's secular traditions. \nThe BJP denies any bias against India's more than 180 million-strong Muslim minority, but objectors have been holding protests and camping out in parts of New Delhi for two months.\nReuters reporters saw multiple vehicles set on fire, metal barricades torn down and thick smoke billowing as supporters of the new law clashed with opponents. A small contingent of police was vastly outnumbered.\nThe clashes stretched over a nearly kilometre-long road and lasted from early afternoon until well into the evening, leaving at least half a dozen people injured.\n \nPolice on Monday imposed an emergency law prohibiting any gatherings in the violence-hit areas.\nThe protesters appeared to be divided along religious lines, and some repeatedly hailed Hindu god Ram while pelting stones at the predominantly Muslim group opposed to the new law.\nA Reuters witness saw at least one Muslim man and a burqa-clad woman were beaten by dozens of pro-law protesters with sticks and iron rods.\nEarlier on Monday, local politician Yogendra Yadav described the violence as \"communal\" and urged police to intervene.\nBut for several hours, Reuters witnesses saw the outnumbered policemen mostly stand beside those backing the citizenship law, a majority Hindu group, and do little to quell the violence. \nThe police also stood by as a mob vandalised a store with a Muslim name, pulling out vehicles and setting them alight.\n\"Go ahead and throw stones,\" one policeman shouted to protesters backing the law, during one of the running battles.\n \nOn side streets, young boys drained fuel from motorcycles to make petrol bombs, and protesters pulled up paving stones and flung construction material at opponents.\n\"We are in support of the CAA. If they want to protest, they should go somewhere else,\" said a protester who gave his name as Amit.\nIndia's junior home minister G Kishan Reddy said the violence was a \"conspiracy to shame India globally\" during Trump's visit.\n\"We have deployed additional forces, and we will do everything to bring law and order under control,\" he told Reuters partner ANI.\nNational BJP spokesperson Gopal Krishna Agarwal echoed similar thoughts. “The timing of these riots creates suspicion about them being politically motivated. For over 60 days, people were protesting in Shaheen Bagh without any significant outcome. Our government believes that dissent has a place in democracy and they have the right to protest within the established process.\n“But indulging in such violence is not the way. Surely, when the head of a nation is in India and such violence is taking place, there is definitely a group, a politicial design behind it. This is being done to tarnish the image of India,” he said, according to The Print. \nAhead of Trump's arrival in India, a senior US administration official had said Trump would raise the issue of religious freedom in India during his meetings with Modi.\nAddressing a gathering of more than 100,000 people in Gujarat, however, Trump made no mention of the protests enveloping India over its Citizenship Amendment Act. \nAt the rally in Ahmedabad, Trump praised India’s history of religious tolerance, and “many faiths worshipping side-by-side”.\n\"India is a country that proudly embraces freedom, liberty, individual rights, the rule of law, and the dignity of every human being,\" he said.\nIn Pakistan, Special Assistant to the Prime Minister on Information and Broadcasting Dr Firdous Ashiq Awan said that the violent clashes on India's citizenship law, in President Trump's presence, have shown the world the truth.\n \n\"Has the world [now] seen who suffers from mental illnesses like prejudice, extremism and warmongering?\" Awan said in a tweet."},"4":{"tilte":"After raucous welcome in India, Trump clinches $3bn military equipment sale\n","link":"https:\/\/www.dawn.com\/news\/1536592\/after-raucous-welcome-in-india-trump-clinches-3bn-military-equipment-sale","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e54e5c13f7a9.jpg","discription":"\nUS President Donald Trump said on Tuesday that India will buy $3 billion worth of military equipment, including attack helicopters, as the two countries deepen defence and commercial ties in an attempt to balance the weight of China in the region.\n\"India and the United States were also making progress on a big trade deal,\" Trump said in New Delhi.\nNegotiators from the two sides have wrangled for months to narrow differences on farm goods, medical devices, digital trade and new tariffs.\nTrump was accorded a massive reception in Indian Prime Minister Narendra Modi's home state on Monday, with more than 100,000 people filling into a cricket stadium for a “Namaste Trump” rally.\nOn Tuesday, Trump sat down for one-on-one talks with Modi followed by delegation-level meetings to try and move forward on issues that have divided them, mainly the festering trade dispute.\nAfter those meetings, Trump said his visit had been productive with the conclusion of deals to buy helicopters for the Indian military. India is buying 24 SeaHawk helicopters from Lockheed Martin equipped with Hellfire missiles worth $2.6 billion and also plans a follow-on order for six Apache helicopters.\nIndia is modernising its military to narrow the gap with China and has increasingly turned to the United States over traditional supplier, Russia.\nTrump said the two countries were also making progress on a trade deal, which had been an area of growing friction between them.\n“Our teams have made tremendous progress on a comprehensive trade agreement and I'm optimistic we can reach a deal that will be of great importance to both countries,” said Trump in remarks made alongside Modi.\nThe two countries had initially planned to produce a “mini deal”, but that proved elusive.\nInstead both sides are now aiming for a bigger package, including possibly a free trade agreement.\nTrump said he also discussed with Modi, whom he called his “dear friend”, the importance of a secure 5G telecoms network in India, ahead of a planned airwaves auction by the country.\nThe United States has banned Huawei, arguing the use of its kit creates the potential for espionage by China — a claim denied by Huawei and Beijing — but India, where telecoms companies have long used network gear from the Chinese firm, is yet to make a call.\nTrump described Monday's rally in Ahmedabad and again praised Modi and spoke of the size of the crowd, claiming there were “thousands of people outside trying to get in [...] I would even imagine they were there more for you than for me, I would hope so,” he told Modi.\n“The people love you [...] every time I mentioned your name, they would cheer.”\nIn New Delhi, Trump was given a formal state welcome on Tuesday at the red sandstone presidential palace with a 21-cannon gun salute and a red coated honour guard on horseback on a smoggy day.\nIndia is one of the few big countries in the world where Trump's personal approval rating is above 50 per cent and Trump's trip has got wall-to-wall coverage with commentators saying he had hit all the right notes on his first official visit to the world's biggest democracy.\nThey were also effusive in their praise for Modi for pulling off a spectacular reception for Trump.\n“Modi-Trump hug gets tighter,” ran a headline in the Times of India.\nBut in a sign of the underlying political tensions in India, violent protests broke out in Delhi on Monday over a new citizenship law that critics say discriminates against Muslims and is a further attempt to undermine the secular foundations of India's democracy. They say the law is part of a pattern of divisiveness being followed by Modi's Hindu nationalist Bharatiya Janata Party.\nAt least 7 people were killed and about 150 injured in the clashes that took place in another part of the capital, away from the centre of the city where Modi is hosting Trump.\nIn his speech on Monday, Trump extolled India's rise as a stable and prosperous democracy as one of the achievements of the century. “You have done it as a tolerant country. And you have done it as a great, free country,” he said.\nDelhi has also been struggling with high air pollution and on Tuesday the air quality was moderately poor at 193 on a government index that measures pollution up to a scale of 500. The WHO considers anything above 60 as unhealthy."},"5":{"tilte":"Egypt's ousted president Hosni Mubarak dies: state TV\n","link":"https:\/\/www.dawn.com\/news\/1536598\/egypts-ousted-president-hosni-mubarak-dies-state-tv","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e54fff643b6d.jpg?r=708468","discription":"\nUS President Donald Trump said on Tuesday that India will buy $3 billion worth of military equipment, including attack helicopters, as the two countries deepen defence and commercial ties in an attempt to balance the weight of China in the region.\n\"India and the United States were also making progress on a big trade deal,\" Trump said in New Delhi.\nNegotiators from the two sides have wrangled for months to narrow differences on farm goods, medical devices, digital trade and new tariffs.\nTrump was accorded a massive reception in Indian Prime Minister Narendra Modi's home state on Monday, with more than 100,000 people filling into a cricket stadium for a “Namaste Trump” rally.\nOn Tuesday, Trump sat down for one-on-one talks with Modi followed by delegation-level meetings to try and move forward on issues that have divided them, mainly the festering trade dispute.\nAfter those meetings, Trump said his visit had been productive with the conclusion of deals to buy helicopters for the Indian military. India is buying 24 SeaHawk helicopters from Lockheed Martin equipped with Hellfire missiles worth $2.6 billion and also plans a follow-on order for six Apache helicopters.\nIndia is modernising its military to narrow the gap with China and has increasingly turned to the United States over traditional supplier, Russia.\nTrump said the two countries were also making progress on a trade deal, which had been an area of growing friction between them.\n“Our teams have made tremendous progress on a comprehensive trade agreement and I'm optimistic we can reach a deal that will be of great importance to both countries,” said Trump in remarks made alongside Modi.\nThe two countries had initially planned to produce a “mini deal”, but that proved elusive.\nInstead both sides are now aiming for a bigger package, including possibly a free trade agreement.\nTrump said he also discussed with Modi, whom he called his “dear friend”, the importance of a secure 5G telecoms network in India, ahead of a planned airwaves auction by the country.\nThe United States has banned Huawei, arguing the use of its kit creates the potential for espionage by China — a claim denied by Huawei and Beijing — but India, where telecoms companies have long used network gear from the Chinese firm, is yet to make a call.\nTrump described Monday's rally in Ahmedabad and again praised Modi and spoke of the size of the crowd, claiming there were “thousands of people outside trying to get in [...] I would even imagine they were there more for you than for me, I would hope so,” he told Modi.\n“The people love you [...] every time I mentioned your name, they would cheer.”\nIn New Delhi, Trump was given a formal state welcome on Tuesday at the red sandstone presidential palace with a 21-cannon gun salute and a red coated honour guard on horseback on a smoggy day.\nIndia is one of the few big countries in the world where Trump's personal approval rating is above 50 per cent and Trump's trip has got wall-to-wall coverage with commentators saying he had hit all the right notes on his first official visit to the world's biggest democracy.\nThey were also effusive in their praise for Modi for pulling off a spectacular reception for Trump.\n“Modi-Trump hug gets tighter,” ran a headline in the Times of India.\nBut in a sign of the underlying political tensions in India, violent protests broke out in Delhi on Monday over a new citizenship law that critics say discriminates against Muslims and is a further attempt to undermine the secular foundations of India's democracy. They say the law is part of a pattern of divisiveness being followed by Modi's Hindu nationalist Bharatiya Janata Party.\nAt least 7 people were killed and about 150 injured in the clashes that took place in another part of the capital, away from the centre of the city where Modi is hosting Trump.\nIn his speech on Monday, Trump extolled India's rise as a stable and prosperous democracy as one of the achievements of the century. “You have done it as a tolerant country. And you have done it as a great, free country,” he said.\nDelhi has also been struggling with high air pollution and on Tuesday the air quality was moderately poor at 193 on a government index that measures pollution up to a scale of 500. The WHO considers anything above 60 as unhealthy.\nEgypt's ousted former president Hosni Mubarak has died at the age of 91, state television said on Tuesday, weeks after undergoing surgery.\nMubarak ruled Egypt for 30 years until he was ousted following mass protests against his rule in 2011. \nHe was jailed for years after the uprising, but was freed in 2017 after being acquitted of most charges. "},"6":{"tilte":"WHO warns of pandemic risk after virus peaks in China; Iran confirms 2 more deaths\n","link":"https:\/\/www.dawn.com\/news\/1536586\/who-warns-of-pandemic-risk-after-virus-peaks-in-china-iran-confirms-2-more-deaths","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e54cac17c5b9.jpg","discription":"\nUS President Donald Trump said on Tuesday that India will buy $3 billion worth of military equipment, including attack helicopters, as the two countries deepen defence and commercial ties in an attempt to balance the weight of China in the region.\n\"India and the United States were also making progress on a big trade deal,\" Trump said in New Delhi.\nNegotiators from the two sides have wrangled for months to narrow differences on farm goods, medical devices, digital trade and new tariffs.\nTrump was accorded a massive reception in Indian Prime Minister Narendra Modi's home state on Monday, with more than 100,000 people filling into a cricket stadium for a “Namaste Trump” rally.\nOn Tuesday, Trump sat down for one-on-one talks with Modi followed by delegation-level meetings to try and move forward on issues that have divided them, mainly the festering trade dispute.\nAfter those meetings, Trump said his visit had been productive with the conclusion of deals to buy helicopters for the Indian military. India is buying 24 SeaHawk helicopters from Lockheed Martin equipped with Hellfire missiles worth $2.6 billion and also plans a follow-on order for six Apache helicopters.\nIndia is modernising its military to narrow the gap with China and has increasingly turned to the United States over traditional supplier, Russia.\nTrump said the two countries were also making progress on a trade deal, which had been an area of growing friction between them.\n“Our teams have made tremendous progress on a comprehensive trade agreement and I'm optimistic we can reach a deal that will be of great importance to both countries,” said Trump in remarks made alongside Modi.\nThe two countries had initially planned to produce a “mini deal”, but that proved elusive.\nInstead both sides are now aiming for a bigger package, including possibly a free trade agreement.\nTrump said he also discussed with Modi, whom he called his “dear friend”, the importance of a secure 5G telecoms network in India, ahead of a planned airwaves auction by the country.\nThe United States has banned Huawei, arguing the use of its kit creates the potential for espionage by China — a claim denied by Huawei and Beijing — but India, where telecoms companies have long used network gear from the Chinese firm, is yet to make a call.\nTrump described Monday's rally in Ahmedabad and again praised Modi and spoke of the size of the crowd, claiming there were “thousands of people outside trying to get in [...] I would even imagine they were there more for you than for me, I would hope so,” he told Modi.\n“The people love you [...] every time I mentioned your name, they would cheer.”\nIn New Delhi, Trump was given a formal state welcome on Tuesday at the red sandstone presidential palace with a 21-cannon gun salute and a red coated honour guard on horseback on a smoggy day.\nIndia is one of the few big countries in the world where Trump's personal approval rating is above 50 per cent and Trump's trip has got wall-to-wall coverage with commentators saying he had hit all the right notes on his first official visit to the world's biggest democracy.\nThey were also effusive in their praise for Modi for pulling off a spectacular reception for Trump.\n“Modi-Trump hug gets tighter,” ran a headline in the Times of India.\nBut in a sign of the underlying political tensions in India, violent protests broke out in Delhi on Monday over a new citizenship law that critics say discriminates against Muslims and is a further attempt to undermine the secular foundations of India's democracy. They say the law is part of a pattern of divisiveness being followed by Modi's Hindu nationalist Bharatiya Janata Party.\nAt least 7 people were killed and about 150 injured in the clashes that took place in another part of the capital, away from the centre of the city where Modi is hosting Trump.\nIn his speech on Monday, Trump extolled India's rise as a stable and prosperous democracy as one of the achievements of the century. “You have done it as a tolerant country. And you have done it as a great, free country,” he said.\nDelhi has also been struggling with high air pollution and on Tuesday the air quality was moderately poor at 193 on a government index that measures pollution up to a scale of 500. The WHO considers anything above 60 as unhealthy.\nEgypt's ousted former president Hosni Mubarak has died at the age of 91, state television said on Tuesday, weeks after undergoing surgery.\nMubarak ruled Egypt for 30 years until he was ousted following mass protests against his rule in 2011. \nHe was jailed for years after the uprising, but was freed in 2017 after being acquitted of most charges. \nThe new coronavirus has peaked in China but could still grow into a pandemic, the World Health Organisation warned, as infections mushroom in other countries.\nFinancial markets have gone into a tailspin after grim news of deaths and outbreaks in the Middle East, Europe and Asia, even as the Chinese epicentre appeared to be calming, with the death toll at its lowest for almost three weeks.\nBut the situation is worsening in other countries, with more than 2,000 cases and around 30 \ndeaths reported abroad, prompting a raft of restrictions on travellers from infected nations.\nSouth Korea, Italy and Iran have logged particularly sharp increases in infections and deaths, while several countries in the Middle East reported their first cases of the novel coronavirus.\nBut WHO chief Tedros Adhanom Ghebreyesus insisted the virus could still be contained, praising China's drastic quarantine measures in several cities for helping to prevent an even bigger spread.\n\"For the moment we are not witnessing the uncontained global spread of this virus and we are not witnessing large-scale deaths,\" Tedros told reporters in Geneva on Monday.\nHe added, however, that countries should be \"doing everything we can to prepare for a potential pandemic\".\nThe term \"pandemic\" is used to describe an illness that spreads across numerous communities.\nThe White House plans to spend $2.5billion to combat the epidemic, according to US media. There are 53 cases in the United States so far.\n \nSouth Korea, which has the largest number of cases outside China, reported 60 more infections and one more fatality on Tuesday, raising its death toll to eight and total patients to nearly 900.\nSouth Korea's outbreak has centred around a religious sect in Daegu, the country's fourth largest city.\nThe country is on its highest \"red\" alert. As part of the containment efforts, school holidays were extended nationally while the 2.5 million people of Daegu were told to remain indoors.\nThe United States and South Korea may scale back a spring military drill because of the outbreak.\nThe US Centers for Disease Control raised its caution level to warn Americans against \"all nonessential travel to South Korea\".\nItaly, which has reported seven deaths and over 200 cases, has locked down 11 towns, while upcoming football matches in its Serie A and the Europa League will be played behind closed doors.\nWith police manning checkpoints to enforce a blockade, Prime Minister Giuseppe Conte has said that residents could face weeks of lockdown.\nProduction of the latest film in the \"Mission: Impossible\" series starring Tom Cruise has been stopped before it was scheduled to shoot in Venice.\nIn Japan, a fourth former passenger of the coronavirus-stricken Diamond Princess cruise ship died, according to local media. The man was in his 80s.\nThe disease — officially known as COVID-19 — spread to new countries including Afghanistan, Bahrain, Iraq, Kuwait and Oman.\nTwo more Iranians infected with a coronavirus have died, media website Eghtesaonline said on Tuesday, taking the toll in the Islamic Republic to 14, which has the highest tally of deaths outside China, where the virus emerged late last year.\n\"Tests showed they had the new coronavirus,\" the head of the Medical Science University of Saveh said, according to the website.\nThe semi-official ILNA news agency quoted one local lawmaker in hard-hit Qom — a religious centre — who said 50 people had died there.\nThe Iranian government denied the report, and pledged transparency.\nEven so, authorities have only reported 64 infections in Iran, an unusually small number that would mean an extremely high mortality rate.\nMichael Ryan, head of WHO's health emergencies programme, said a team from the UN agency would arrive in Iran on Tuesday.\nSeveral countries have taken measures to prevent arrivals from Iran.\nIn China, 508 new cases were reported, with all but nine at the epicentre in central Hubei province. \nAlthough that was up from 409 on Monday it was much lower than new infections being reported just a week ago.\nChina's death toll reached 2,663 on Tuesday, after 71 more people died.\nReassured by the official numbers, the country is gingerly getting back to business.\nBeijing is seeing more cars on the street, factories are resuming work, Apple is reopening several of its stores, and some regions are relaxing traffic restrictions.\nBut schools remain closed, Beijing has a mandatory 14-day quarantine for people returning to the capital, and authorities are keeping some 56 million in Hubei and its capital under lockdown.\nOn Monday China declared an immediate and \"comprehensive\" ban on the trade and consumption of wild animals, a practice believed responsible for the coronavirus outbreak.\nWHO's Tedros said the epidemic peaked in China between January 23 and February 2.\nBruce Aylward, leader of a WHO mission of international experts, said late Monday it was time for China to start lifting some of the restrictions.\n\"Obviously they want to get society back to a more normal semblance of what probably is the new normal, because this virus may be around [...] for months,\" Aylward said.\nReflecting the disquiet, global markets plunged on Monday, with Wall Street off 3.6 per cent.\nBargain buying helped some Asian markets into the green on Tuesday, but disquiet remained, with Tokyo closing down more than 3pc."},"7":{"tilte":"Bahrain temporarily stops Dubai, Sharjah flights over virus\n","link":"https:\/\/www.dawn.com\/news\/1536584\/bahrain-temporarily-stops-dubai-sharjah-flights-over-virus","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e54bf653bb12.jpg","discription":"\nUS President Donald Trump said on Tuesday that India will buy $3 billion worth of military equipment, including attack helicopters, as the two countries deepen defence and commercial ties in an attempt to balance the weight of China in the region.\n\"India and the United States were also making progress on a big trade deal,\" Trump said in New Delhi.\nNegotiators from the two sides have wrangled for months to narrow differences on farm goods, medical devices, digital trade and new tariffs.\nTrump was accorded a massive reception in Indian Prime Minister Narendra Modi's home state on Monday, with more than 100,000 people filling into a cricket stadium for a “Namaste Trump” rally.\nOn Tuesday, Trump sat down for one-on-one talks with Modi followed by delegation-level meetings to try and move forward on issues that have divided them, mainly the festering trade dispute.\nAfter those meetings, Trump said his visit had been productive with the conclusion of deals to buy helicopters for the Indian military. India is buying 24 SeaHawk helicopters from Lockheed Martin equipped with Hellfire missiles worth $2.6 billion and also plans a follow-on order for six Apache helicopters.\nIndia is modernising its military to narrow the gap with China and has increasingly turned to the United States over traditional supplier, Russia.\nTrump said the two countries were also making progress on a trade deal, which had been an area of growing friction between them.\n“Our teams have made tremendous progress on a comprehensive trade agreement and I'm optimistic we can reach a deal that will be of great importance to both countries,” said Trump in remarks made alongside Modi.\nThe two countries had initially planned to produce a “mini deal”, but that proved elusive.\nInstead both sides are now aiming for a bigger package, including possibly a free trade agreement.\nTrump said he also discussed with Modi, whom he called his “dear friend”, the importance of a secure 5G telecoms network in India, ahead of a planned airwaves auction by the country.\nThe United States has banned Huawei, arguing the use of its kit creates the potential for espionage by China — a claim denied by Huawei and Beijing — but India, where telecoms companies have long used network gear from the Chinese firm, is yet to make a call.\nTrump described Monday's rally in Ahmedabad and again praised Modi and spoke of the size of the crowd, claiming there were “thousands of people outside trying to get in [...] I would even imagine they were there more for you than for me, I would hope so,” he told Modi.\n“The people love you [...] every time I mentioned your name, they would cheer.”\nIn New Delhi, Trump was given a formal state welcome on Tuesday at the red sandstone presidential palace with a 21-cannon gun salute and a red coated honour guard on horseback on a smoggy day.\nIndia is one of the few big countries in the world where Trump's personal approval rating is above 50 per cent and Trump's trip has got wall-to-wall coverage with commentators saying he had hit all the right notes on his first official visit to the world's biggest democracy.\nThey were also effusive in their praise for Modi for pulling off a spectacular reception for Trump.\n“Modi-Trump hug gets tighter,” ran a headline in the Times of India.\nBut in a sign of the underlying political tensions in India, violent protests broke out in Delhi on Monday over a new citizenship law that critics say discriminates against Muslims and is a further attempt to undermine the secular foundations of India's democracy. They say the law is part of a pattern of divisiveness being followed by Modi's Hindu nationalist Bharatiya Janata Party.\nAt least 7 people were killed and about 150 injured in the clashes that took place in another part of the capital, away from the centre of the city where Modi is hosting Trump.\nIn his speech on Monday, Trump extolled India's rise as a stable and prosperous democracy as one of the achievements of the century. “You have done it as a tolerant country. And you have done it as a great, free country,” he said.\nDelhi has also been struggling with high air pollution and on Tuesday the air quality was moderately poor at 193 on a government index that measures pollution up to a scale of 500. The WHO considers anything above 60 as unhealthy.\nEgypt's ousted former president Hosni Mubarak has died at the age of 91, state television said on Tuesday, weeks after undergoing surgery.\nMubarak ruled Egypt for 30 years until he was ousted following mass protests against his rule in 2011. \nHe was jailed for years after the uprising, but was freed in 2017 after being acquitted of most charges. \nThe new coronavirus has peaked in China but could still grow into a pandemic, the World Health Organisation warned, as infections mushroom in other countries.\nFinancial markets have gone into a tailspin after grim news of deaths and outbreaks in the Middle East, Europe and Asia, even as the Chinese epicentre appeared to be calming, with the death toll at its lowest for almost three weeks.\nBut the situation is worsening in other countries, with more than 2,000 cases and around 30 \ndeaths reported abroad, prompting a raft of restrictions on travellers from infected nations.\nSouth Korea, Italy and Iran have logged particularly sharp increases in infections and deaths, while several countries in the Middle East reported their first cases of the novel coronavirus.\nBut WHO chief Tedros Adhanom Ghebreyesus insisted the virus could still be contained, praising China's drastic quarantine measures in several cities for helping to prevent an even bigger spread.\n\"For the moment we are not witnessing the uncontained global spread of this virus and we are not witnessing large-scale deaths,\" Tedros told reporters in Geneva on Monday.\nHe added, however, that countries should be \"doing everything we can to prepare for a potential pandemic\".\nThe term \"pandemic\" is used to describe an illness that spreads across numerous communities.\nThe White House plans to spend $2.5billion to combat the epidemic, according to US media. There are 53 cases in the United States so far.\n \nSouth Korea, which has the largest number of cases outside China, reported 60 more infections and one more fatality on Tuesday, raising its death toll to eight and total patients to nearly 900.\nSouth Korea's outbreak has centred around a religious sect in Daegu, the country's fourth largest city.\nThe country is on its highest \"red\" alert. As part of the containment efforts, school holidays were extended nationally while the 2.5 million people of Daegu were told to remain indoors.\nThe United States and South Korea may scale back a spring military drill because of the outbreak.\nThe US Centers for Disease Control raised its caution level to warn Americans against \"all nonessential travel to South Korea\".\nItaly, which has reported seven deaths and over 200 cases, has locked down 11 towns, while upcoming football matches in its Serie A and the Europa League will be played behind closed doors.\nWith police manning checkpoints to enforce a blockade, Prime Minister Giuseppe Conte has said that residents could face weeks of lockdown.\nProduction of the latest film in the \"Mission: Impossible\" series starring Tom Cruise has been stopped before it was scheduled to shoot in Venice.\nIn Japan, a fourth former passenger of the coronavirus-stricken Diamond Princess cruise ship died, according to local media. The man was in his 80s.\nThe disease — officially known as COVID-19 — spread to new countries including Afghanistan, Bahrain, Iraq, Kuwait and Oman.\nTwo more Iranians infected with a coronavirus have died, media website Eghtesaonline said on Tuesday, taking the toll in the Islamic Republic to 14, which has the highest tally of deaths outside China, where the virus emerged late last year.\n\"Tests showed they had the new coronavirus,\" the head of the Medical Science University of Saveh said, according to the website.\nThe semi-official ILNA news agency quoted one local lawmaker in hard-hit Qom — a religious centre — who said 50 people had died there.\nThe Iranian government denied the report, and pledged transparency.\nEven so, authorities have only reported 64 infections in Iran, an unusually small number that would mean an extremely high mortality rate.\nMichael Ryan, head of WHO's health emergencies programme, said a team from the UN agency would arrive in Iran on Tuesday.\nSeveral countries have taken measures to prevent arrivals from Iran.\nIn China, 508 new cases were reported, with all but nine at the epicentre in central Hubei province. \nAlthough that was up from 409 on Monday it was much lower than new infections being reported just a week ago.\nChina's death toll reached 2,663 on Tuesday, after 71 more people died.\nReassured by the official numbers, the country is gingerly getting back to business.\nBeijing is seeing more cars on the street, factories are resuming work, Apple is reopening several of its stores, and some regions are relaxing traffic restrictions.\nBut schools remain closed, Beijing has a mandatory 14-day quarantine for people returning to the capital, and authorities are keeping some 56 million in Hubei and its capital under lockdown.\nOn Monday China declared an immediate and \"comprehensive\" ban on the trade and consumption of wild animals, a practice believed responsible for the coronavirus outbreak.\nWHO's Tedros said the epidemic peaked in China between January 23 and February 2.\nBruce Aylward, leader of a WHO mission of international experts, said late Monday it was time for China to start lifting some of the restrictions.\n\"Obviously they want to get society back to a more normal semblance of what probably is the new normal, because this virus may be around [...] for months,\" Aylward said.\nReflecting the disquiet, global markets plunged on Monday, with Wall Street off 3.6 per cent.\nBargain buying helped some Asian markets into the green on Tuesday, but disquiet remained, with Tokyo closing down more than 3pc.\nThe tiny island nation of Bahrain on Tuesday suspended flights to the world's busiest airport for international travel in Dubai over fears about the spread of the new virus.\nThe move by Bahrain, a small island off the coast of Saudi Arabia, suggested its monarchy had doubts about screenings of incoming passengers in Dubai and nearby Sharjah in the United Arab Emirates. It said the ban was immediate and would last at least 48 hours.\nBahrain counted its first case of the coronavirus that causes the COVID-19 illness on Monday in a school bus driver who transited Dubai while coming from Iran. Later, it confirmed a second case, also a traveller from Iran via Dubai.\nDubai International Airport did not immediately respond to a request for comment. Officials at Sharjah's airport could not be immediately reached.\nDubai has been screening passengers on incoming flights from China, where the outbreak began. \nLong-haul carriers Emirates and Etihad are among the few international airlines still flying to Beijing. The outbreak in Iran, however, only became public in recent days.\nIran's government said on Monday that 12 people had died nationwide from the new coronavirus, rejecting claims of a much higher death toll of 50 by a lawmaker from the city of Qom that has been at the epicentre of the virus in the country. \nThe conflicting reports raised questions about the Iranian government's transparency concerning the scale of the outbreak.\nAfghanistan, Kuwait, Iraq and Oman also announced their first cases of the virus on Monday and connected them to travel with Iran.\nThe UAE, a federation of seven sheikhdoms on the Arabian Peninsula, has reported 13 cases of the new virus. Most of those were connected to Chinese travel.\nMeanwhile, Kuwait raised the number of its infected cases from three to five people. All five were passengers returning on a flight from the Iranian city of Mashhad, where Iran's government has not yet announced a single case of the virus.\nThe state-run Kuwait News Agency reported the two latest cases on Monday evening in two women whose nationalities were not disclosed. Kuwait had halted over the weekend transport links with Iran and was evacuating its citizens from Iran.\nAlso, Oman, which has good ties with Iran, has halted flights with its Persian Gulf neighbour."},"8":{"tilte":"Qatar invites Pakistan to attend signing of US-Taliban peace deal\n","link":"https:\/\/www.dawn.com\/news\/1536589\/qatar-invites-pakistan-to-attend-signing-of-us-taliban-peace-deal","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e54de48e0152.jpg?r=1388089388","discription":"\nQatar has invited Pakistan to the signing of the US-Taliban peace deal set to take place on February 29, Radio Pakistan reported on Tuesday.\nLast week, the US and the Taliban announced they were set to sign a historic agreement in Doha, Qatar, on Saturday, that would pave the way to ending America’s longest war. \nDuring a meeting today, Qatar's ambassador to Pakistan Saqr bin Mubarak Al-Mansouri, on behalf of the Qatari government, extended an invitation to Foreign Minister Shah Mahmood Qureshi, Radio Pakistan reported.\nQureshi said Pakistan and Qatar had both played a \"pivotal role\" in the Afghan reconciliation process. \nHe welcomed the peace deal and said Pakistan had always held the view that there was no military solution to the Afghan conflict, adding that now the world was accepting this stance.\nAccording to Radio Pakistan, Qureshi expressed confidence that the peace deal would lead to intra-Afghan dialogue.\nThe foreign minister had on Saturday said Pakistan played its role and \"fulfilled all promises\" with America after reports of the US-Taliban deal emerged.\nRead: Pakistan helped construct roadmap for US-Taliban peace deal, says FM Qureshi\nQureshi went on to say now it was the responsibility of the Afghan government to take the peace process forward.\nHe said Pakistan wanted to see the formation of an inclusive delegation for advancing towards intra-Afghan dialogue.\n\"My experience shows that the people of Afghanistan want peace. It is now up to their elite whether they take forward the peace efforts or waste it by indulging in power games. All responsibility will be on them [the Afghan government] and not on Pakistan,\" the foreign minister had said.\nThe US and the Taliban are set to sign a historic agreement that would pave the way to ending Ame­rica’s longest war, the bitter foes announced on Fri­day, hours after Kabul said a week-long partial truce across Afghanistan would kick off over the weekend.\nIf the so-called \"reduction in violence\" holds, it would mark a major turning point in the gruelling conflict and set the conditions for a deal that could, ultimately, pull US troops out after more than 18 years and launch Afghanistan into an uncertain future.\nBoth US Secretary of State Mike Pompeo and the Taliban issued statements saying they had agreed to sign the accord on Feb 29 in Doha, following the one-week partial truce.\n“Upon a successful implementation of this understanding, signing of the US-Taliban agreement is expected to move forward,” Pompeo said, adding that negotiations between the Taliban and the Afghan government would “start soon thereafter”."},"9":{"tilte":"Greta met Malala: young activists pictured together in Oxford\n","link":"https:\/\/www.dawn.com\/news\/1536605\/greta-met-malala-young-activists-pictured-together-in-oxford","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e555af53a942.jpg","discription":"\nQatar has invited Pakistan to the signing of the US-Taliban peace deal set to take place on February 29, Radio Pakistan reported on Tuesday.\nLast week, the US and the Taliban announced they were set to sign a historic agreement in Doha, Qatar, on Saturday, that would pave the way to ending America’s longest war. \nDuring a meeting today, Qatar's ambassador to Pakistan Saqr bin Mubarak Al-Mansouri, on behalf of the Qatari government, extended an invitation to Foreign Minister Shah Mahmood Qureshi, Radio Pakistan reported.\nQureshi said Pakistan and Qatar had both played a \"pivotal role\" in the Afghan reconciliation process. \nHe welcomed the peace deal and said Pakistan had always held the view that there was no military solution to the Afghan conflict, adding that now the world was accepting this stance.\nAccording to Radio Pakistan, Qureshi expressed confidence that the peace deal would lead to intra-Afghan dialogue.\nThe foreign minister had on Saturday said Pakistan played its role and \"fulfilled all promises\" with America after reports of the US-Taliban deal emerged.\nRead: Pakistan helped construct roadmap for US-Taliban peace deal, says FM Qureshi\nQureshi went on to say now it was the responsibility of the Afghan government to take the peace process forward.\nHe said Pakistan wanted to see the formation of an inclusive delegation for advancing towards intra-Afghan dialogue.\n\"My experience shows that the people of Afghanistan want peace. It is now up to their elite whether they take forward the peace efforts or waste it by indulging in power games. All responsibility will be on them [the Afghan government] and not on Pakistan,\" the foreign minister had said.\nThe US and the Taliban are set to sign a historic agreement that would pave the way to ending Ame­rica’s longest war, the bitter foes announced on Fri­day, hours after Kabul said a week-long partial truce across Afghanistan would kick off over the weekend.\nIf the so-called \"reduction in violence\" holds, it would mark a major turning point in the gruelling conflict and set the conditions for a deal that could, ultimately, pull US troops out after more than 18 years and launch Afghanistan into an uncertain future.\nBoth US Secretary of State Mike Pompeo and the Taliban issued statements saying they had agreed to sign the accord on Feb 29 in Doha, following the one-week partial truce.\n“Upon a successful implementation of this understanding, signing of the US-Taliban agreement is expected to move forward,” Pompeo said, adding that negotiations between the Taliban and the Afghan government would “start soon thereafter”.\nTeen climate activist Greta Thunberg met Nobel Peace Prize winner Malala Yousafzai at Britain's University of Oxford on Tuesday and posed for a photo together.\nYousafzai, widely known by her first name, Malala, is a student at the University of Oxford. The 22-year-old posted a photo on Instagram of herself and Thunberg sitting on a bench with their arms around each other, with a caption “Thank you, @gretathunberg” and a heart emoji.\nIn a tweet, Malala said Thunberg is \"the only friend I’d skip school for\". \nA photo posted by Instagram (@instagram) on Mar 22, 2015 at 11:21am PDT\n \nThunberg, 17, is in the United Kingdom to join a school strike in Bristol on Friday.\nBoth women shot to worldwide fame after standing up for major global issues: climate change and women's education.\nThunberg became a household name after skipping school in Sweden to protest against climate change, while Malala was shot in the head by the Tehreek-i- Taliban Pakistan (TTP) in Swat for campaigning for girls to be allowed to go to school.\nIn 2014, Malala became the youngest recipient of the Nobel Peace Prize for her advocacy of education. She became a global symbol of the resilience of women in the face of oppression.\nThunberg was nominated for a Nobel Peace Prize in 2019 and 2020.\nThe pair met to discuss their activism at Lady Margaret Hall, Malala's Oxford college. Thunberg also talked to some of the students about climate change and protest.\nThe college's master, Alan Rusbridger, posted a photo of Thunberg on his own Instagram and Twitter, saying that he was honoured to host Thunberg and grateful that she found time to talk to the students."},"10":{"tilte":"Greta met Malala: young activists pictured together in Oxford\n","link":"https:\/\/www.dawn.com\/news\/1536605\/greta-met-malala-young-activists-pictured-together-in-oxford","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e555af53a942.jpg","discription":"\nTeen climate activist Greta Thunberg met Nobel Peace Prize winner Malala Yousafzai at Britain's University of Oxford on Tuesday and posed for a photo together.\nYousafzai, widely known by her first name, Malala, is a student at the University of Oxford. The 22-year-old posted a photo on Instagram of herself and Thunberg sitting on a bench with their arms around each other, with a caption “Thank you, @gretathunberg” and a heart emoji.\nIn a tweet, Malala said Thunberg is \"the only friend I’d skip school for\". \nA photo posted by Instagram (@instagram) on Mar 22, 2015 at 11:21am PDT\n \nThunberg, 17, is in the United Kingdom to join a school strike in Bristol on Friday.\nBoth women shot to worldwide fame after standing up for major global issues: climate change and women's education.\nThunberg became a household name after skipping school in Sweden to protest against climate change, while Malala was shot in the head by the Tehreek-i- Taliban Pakistan (TTP) in Swat for campaigning for girls to be allowed to go to school.\nIn 2014, Malala became the youngest recipient of the Nobel Peace Prize for her advocacy of education. She became a global symbol of the resilience of women in the face of oppression.\nThunberg was nominated for a Nobel Peace Prize in 2019 and 2020.\nThe pair met to discuss their activism at Lady Margaret Hall, Malala's Oxford college. Thunberg also talked to some of the students about climate change and protest.\nThe college's master, Alan Rusbridger, posted a photo of Thunberg on his own Instagram and Twitter, saying that he was honoured to host Thunberg and grateful that she found time to talk to the students."},"11":{"tilte":"Mission Impossible's Italy shoot delayed due to coronavirus outbreak\n","link":"https:\/\/www.dawn.com\/news\/1536579\/mission-impossibles-italy-shoot-delayed-due-to-coronavirus-outbreak","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e54b6ec1bd55.jpg","discription":"\nA planned three-week shoot in Italy for Tom Cruise’s new Mission: Impossible film has been postponed due to the coronavirus outbreak, movie studio Paramount Pictures said on Monday.\nFilming was due to have started on Monday in Venice, where the final two days of the lagoon city’s annual Carnival festival was canceled on Sunday. New coronavirus cases climbed above 220 on Monday as Italy shut down much of its wealthy north to curb the disease’s spread.\n“Out of an abundance of caution for the safety and well-being of our cast and crew, and efforts of the local Venetian government to halt public gatherings in response to the threat of coronavirus, we are altering the production plan for our three week shoot in Venice, the scheduled first leg of an extensive production for Mission: Impossible 7,” Paramount Pictures, a unit of ViacomCBS, said in a statement.\nThe studio said it was allowing the film crew to return home during the delay and that it would “continue to monitor this situation” in Italy.\nThe studio did not say when it now expects production to start.\nThe 7th installment of the lucrative action movie franchise is expected to be released in July 2021, with an eighth set for 2022. Cruise will reprise his role as secret agent Ethan Hunt in both movies with Christopher McQuarrie returning as director.\nThe Mission: Impossible movies are one of the biggest franchises in Hollywood, with 2018’s Mission: Impossible-Fallout taking more than $791 million at the worldwide box office."},"12":{"tilte":"Twitter celebrates the bittersweet victory that is Harvey Weinstein's conviction\n","link":"https:\/\/www.dawn.com\/news\/1536594\/twitter-celebrates-the-bittersweet-victory-that-is-harvey-weinsteins-conviction","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e54eccdbfbd3.jpg","discription":"\nAfter what seemed like a tedious, elongated trial, survivors in the Harvey Weinstein case finally get the justice they deserve as the disgraced producer is officially found guilty for two out of the five counts he was charged for.\nSurprisingly, despite the accusations of nearly 100 women, he was only convicted for third-degree rape and a first-degree criminal sexual act; he was acquitted for the more serious charges. That said, two steps forward and one step back is still one step forward.\nPeople, including celebrities and survivors, took to Twitter to share there thoughts on the matter.\nThey thanked the women who risked their lives and showed great strength and courage by speaking out \n \n \n \n \n \nMany commented on the victory being bittersweet \n \n \n \n \nHowever, soon after the film producer was convicted, lawyers reported their client was suffering from high blood pressure and palpitations due to which he had to be hospitalised. \nSome are not buying it\n \n \nWhile others are just angry \n \n \n \n \nAnd some, even regretful\n \nRegardless, Weinstein is proof that in this decade, the world is extending no empathy to sex offenders. If you assault an individual, you will be held responsible and you will be called out. \n \nWe offer the survivors our empathy and congratulate them for this win. #Timesup "},"13":{"tilte":"Firm seeks to recover Titanic’s iconic telegraph machine\n","link":"https:\/\/www.dawn.com\/news\/1535980\/firm-seeks-to-recover-titanics-iconic-telegraph-machine","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e50b02f8f541.jpg","discription":"\nNORFOLK: The salvage firm that has plucked silverware, china and gold coins from the wreckage of the Titanic now wants to recover the Marconi Wire­less Telegraph Machine that transmitted the doomed ship’s increasingly frantic distress calls.\nLawyers for the company, R.M.S. Titanic, Inc., called witnesses before a federal judge on Thursday to explain why the company should be allowed to possibly cut into the rapidly deteriorating ship to recover the device before it’s irretrievable.\nIt’s one of those iconic artefacts, like the signal flares (that the sinking ship launched), testified David Gallo, an oceanographer who retired from Woods Hole Oceanographic Insti­tution and is now a paid consultant for the firm.\nGallo, who testified in federal court in Norfolk, Virginia, said that salvaging the device would not be grave robbery but a way to connect people to the ship’s legacy and honor its passengers.\nUS District Judge Rebecca Beach Smith, the maritime jurist who presides over Titanic salvage matters, said it was too early for her to make any decisions on the proposal. She said she needed more details and proposed scheduling another hearing sometime in the future.\nThe Titanic was traveling from England to New York when it struck an iceberg at 11:40 pm on April 14, 1912. The large and luxurious ocean liner sent out distress signals using the relatively new Marconi wireless radio system.\nThe messages in Morse code were picked up by other ships and onshore receiving stations. They included: We require immediate assistance ...  “Have struck iceberg and sinking” ...  “We are putting women off in boats.” The ship sank in less than three hours, with the loss of all but 700 of the 2,208 passengers and crew.\nAn international team led by oceanographer Robert Ballard located the wreckage in 1985 on the North Atlantic seabed, about 400 miles (645 kilometers) off Newfoundland, Canada.\nRMS Titanic Inc., oversees a collection of thousands of items recovered from the site over the years as the court-recognized salvor, or steward of the artefacts.\nThe company has argued that time is running out to retrieve the telegraph machine.\nIt has been referred to as the voice of the Titanic, which also delivered the ship’s last words.\nThe device is located in a room on the ship’s deck. A gymnasium on the other side of the grand staircase has already collapsed. The roof above the telegraph machine has begun to perforate.\nI’m not sure if we go in 2020 that the roof won’t be collapsed on everything, testified Paul Henry Nargeolet, director of the company’s underwater research program.\nThe company is already facing resistance from the National Oceanic and Atmospheric Admin­istration, which represents the public’s interest in the wreck site.\nThe US Attorney’s Office in Virginia represents NOAA. Its attorneys argued in court documents that the proposed retrieval runs contrary to prior court orders that prohibit the firm from cutting holes or taking items from the wreck.\nThe items that the firm has salvaged came from a debris field outside the ship.\nIt seems clear that this is not simply a one-off proposal for the Marconi Wireless Telegraph, but a placeholder for future requests to take similar actions in order to recover other artifacts from inside the wreck, federal attorney Kent P. Porter wrote.\nPorter also wrote that the court must consider international agreements involving the wreck as well as archaelogical standards to determine whether the retrieval is justified. \nHe cited the United Kingdom-based Joint Nautical Archaeology Policy Committee, which said the company has failed to adequately justify its proposal.\nPublished in Dawn, February 22nd, 2020"},"14":{"tilte":"BTS says new album is all about conquering doubts and fears\n","link":"https:\/\/www.dawn.com\/news\/1536599\/bts-says-new-album-is-all-about-conquering-doubts-and-fears","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e5501f08deab.jpg","discription":"\nThe young stars in South Korean boy band BTS said on Monday the theme of their new album dealt with how they overcame doubts and fears encountered since they burst on the K-Pop scene seven years ago.\nHaving performed at the Grammy Awards in Los Angeles last month, BTS stands at the forefront of South Korean pop music and has helped gather an international audience for the genre.\nOn Friday, the band released Map of the Soul: 7, its fourth album. The 20 tracks include collaborations with Sia and Troye Sivan.\nPlans for a large media event in Seoul for the album were ditched due to the coronavirus health scare in South Korea, but the band instead livestreamed a news conference based on preregistered questions.\n“Sometimes we were uncertain, sometimes we were lost. Every time that happened, the shadows and fear inside us grew,” rapper Suga told the news conference aired via YouTube.\n“But it’s been seven years. I think we have grounded ourselves now, and we learned how to do that, the difficulties and wounds we face and fight them.”\nThough several young K-Pop stars have struggled with cyber bullying and depression, Suga did not elaborate on what difficulties BTS faced.\nBut the group, whose seven members are in their Twenties, took an unexpectedly long vacation last year to “recharge”.\nWhen asked about the comment by Bong Joon-ho, director of the Oscar-winning Parasite, who recently said BTS was 3,000 times more influential than him, Suga said he was an avid fan of Bong’s work and hoped more South Korean artists would be introduced to the world.\nLeader and rapper RM likened K-pop to a “giftbox” integrating music, dance, video and interaction with fans, saying the personal elements the band infuses in its music might have boosted its global popularity.\n“We try to instil personal stories in our music and dance and I think the concerns and feelings that we have resonate with people around the world,” he said.\nBut making music is a “constant battle to show your weakness and fight the fear of expressing your fear,” he added.\nBTS broke into the U.S. market in 2017 and was the first Korean group to win a Billboard music award. It is set to launch a new world tour in April, kicking off in Seoul."},"15":{"tilte":"Everything we know about HBO’s Friends reunion special\n","link":"https:\/\/www.dawn.com\/news\/1536387\/everything-we-know-about-hbos-friends-reunion-special","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e535ec5a9dea.jpg","discription":"\nWarnerMedia is reuniting its Friends cast for an untitled, unscripted special for its upcoming streaming service, HBO Max, the company said on Friday.\nThe series that stars Jennifer Aniston, Courteney Cox, Lisa Kudrow, Matt LeBlanc, Matthew Perry and David Schwimmer will return to the hit comedy's original soundstage, Stage 24, on the Warner Bros studio lot in Burbank, California.\nThere have been a flurry of media reports about a potential reunion since Aniston hinted last year that something might be underway.\nAniston spoke to talk show host Ellen DeGeneres about a possible new “Friends” project saying, “We would love for there to be something, but we don’t know what that something is. So we’re just trying. We’re working on something.”\nChandler Bing (Mathew Perry) took to Instagram to confirm this news, and fans can't wait! \nA photo posted by Instagram (@instagram) on Mar 22, 2015 at 11:21am PDT\n \nThe unscripted cast reunion special, which will be directed by Ben Winston, along with all 10 seasons of the Emmy-winning series, will be available to subscribers at the launch of HBO Max in May.\nEarlier this month, the Wall Street Journal said the six stars would receive between $2.25 million and $2.5 million as part of the deal. "},"16":{"tilte":"After raucous welcome in India, Trump clinches $3bn military equipment sale\n","link":"https:\/\/www.dawn.com\/news\/1536592\/after-raucous-welcome-in-india-trump-clinches-3bn-military-equipment-sale","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e54e5c13f7a9.jpg","discription":"\nUS President Donald Trump said on Tuesday that India will buy $3 billion worth of military equipment, including attack helicopters, as the two countries deepen defence and commercial ties in an attempt to balance the weight of China in the region.\n\"India and the United States were also making progress on a big trade deal,\" Trump said in New Delhi.\nNegotiators from the two sides have wrangled for months to narrow differences on farm goods, medical devices, digital trade and new tariffs.\nTrump was accorded a massive reception in Indian Prime Minister Narendra Modi's home state on Monday, with more than 100,000 people filling into a cricket stadium for a “Namaste Trump” rally.\nOn Tuesday, Trump sat down for one-on-one talks with Modi followed by delegation-level meetings to try and move forward on issues that have divided them, mainly the festering trade dispute.\nAfter those meetings, Trump said his visit had been productive with the conclusion of deals to buy helicopters for the Indian military. India is buying 24 SeaHawk helicopters from Lockheed Martin equipped with Hellfire missiles worth $2.6 billion and also plans a follow-on order for six Apache helicopters.\nIndia is modernising its military to narrow the gap with China and has increasingly turned to the United States over traditional supplier, Russia.\nTrump said the two countries were also making progress on a trade deal, which had been an area of growing friction between them.\n“Our teams have made tremendous progress on a comprehensive trade agreement and I'm optimistic we can reach a deal that will be of great importance to both countries,” said Trump in remarks made alongside Modi.\nThe two countries had initially planned to produce a “mini deal”, but that proved elusive.\nInstead both sides are now aiming for a bigger package, including possibly a free trade agreement.\nTrump said he also discussed with Modi, whom he called his “dear friend”, the importance of a secure 5G telecoms network in India, ahead of a planned airwaves auction by the country.\nThe United States has banned Huawei, arguing the use of its kit creates the potential for espionage by China — a claim denied by Huawei and Beijing — but India, where telecoms companies have long used network gear from the Chinese firm, is yet to make a call.\nTrump described Monday's rally in Ahmedabad and again praised Modi and spoke of the size of the crowd, claiming there were “thousands of people outside trying to get in [...] I would even imagine they were there more for you than for me, I would hope so,” he told Modi.\n“The people love you [...] every time I mentioned your name, they would cheer.”\nIn New Delhi, Trump was given a formal state welcome on Tuesday at the red sandstone presidential palace with a 21-cannon gun salute and a red coated honour guard on horseback on a smoggy day.\nIndia is one of the few big countries in the world where Trump's personal approval rating is above 50 per cent and Trump's trip has got wall-to-wall coverage with commentators saying he had hit all the right notes on his first official visit to the world's biggest democracy.\nThey were also effusive in their praise for Modi for pulling off a spectacular reception for Trump.\n“Modi-Trump hug gets tighter,” ran a headline in the Times of India.\nBut in a sign of the underlying political tensions in India, violent protests broke out in Delhi on Monday over a new citizenship law that critics say discriminates against Muslims and is a further attempt to undermine the secular foundations of India's democracy. They say the law is part of a pattern of divisiveness being followed by Modi's Hindu nationalist Bharatiya Janata Party.\nAt least 7 people were killed and about 150 injured in the clashes that took place in another part of the capital, away from the centre of the city where Modi is hosting Trump.\nIn his speech on Monday, Trump extolled India's rise as a stable and prosperous democracy as one of the achievements of the century. “You have done it as a tolerant country. And you have done it as a great, free country,” he said.\nDelhi has also been struggling with high air pollution and on Tuesday the air quality was moderately poor at 193 on a government index that measures pollution up to a scale of 500. The WHO considers anything above 60 as unhealthy."}}