{"1":{"tilte":"theParkingSpot Scholarship","link":"https:\/\/www.scholarshipportal.com\/scholarship\/the-parking-spot-scholarship","discription":"HomeScholarshipstheParkingSpot ScholarshiptheParkingSpot ScholarshipBachelor$1,00031 May 2020Visit Scholarship WebsiteThe Parking Spot is awarding a $1,000 scholarship to a prospective college student that submits a winning essay on the topic:\n“If you could travel anywhere, where would you go and why?”\nThis is a scholarship byThe Parking SpotThe Parking Spot makes long-term near-airport parking a superior experience. Pre-pay to reserve your affordable and comfortable spot with us today.Eligibility\nYou must be a legal U.S. resident.\nYou must be a current high school student with a cumulative high school GPA of 3.0 or higher on a 4.0 scale or the equivalent.\nYou must plan to enroll in an accredited two- or four-year college, university or vocational-technical school in the United States in 2020.\nYou must not be a current The Parking Spot employee or directly related to an employee.\nYour Entry must be received by May 31, 2020. Entries received after the deadline will not be considered.\n\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >IELTSTo apply for most scholarships, you have to speak English. To test your English language proficiencySchedule an IELTS test >Benefits$1,000 scholarship.\nApplicationEssay submissions must be 500 words or less. All entries must be electronically sent to us, please visit the website for our contact details.\nIn the email, please also include:\n• Full name\n• Phone number\n• Address\n• Proof of high school GPA. A current, complete high school transcript of grades must be included. Unofficial transcripts must include the student’s name, school name, grades and all credit hours for each course.\n• Proof of college acceptance including a letter from admissions or acceptance letter on a school letterhead\nPrinted copies of the essay submission (“Entry”) should not be sent to The Parking Spot. Limit one entry per person.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"2":{"tilte":"NSTY Scholarship 2020","link":"https:\/\/www.scholarshipportal.com\/scholarship\/nsty-scholarship-2020","discription":"HomeScholarshipsNSTY Scholarship 2020NSTY Scholarship 2020Master, Bachelor, Phd, CourseRs. 3.5 crores31 May 2020Visit Scholarship WebsiteNational Scholarship Test for Youth is a merit based scholarship test conducted by Flurosis Communication Pvt. Ltd. with the assistance of various Educational Institutions, trusts and NGOs from all over India.\nEligibility\nThe student should have secured not less than 50% marks or equivalent in class 10th\/SSC examination.\nThe student should have Indian citizenship\n\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >IELTSTo apply for most scholarships, you have to speak English. To test your English language proficiencySchedule an IELTS test >Benefits\nsupports in fee reduction up to 10,000 students through PAN INDIA\nprovides up to 50% Fee concession depending on their Rank \/ University \/ Course of admission.\nto motivate meritorious and talented students and resolve financial problems in their family which restrain them from obtaining quality education in reputed institutions.\nWith the help of NSTY scholarship they will be able to enroll in their dream courses and create a better future for themselves and their family.\n\nApplicationFor more information about the application process, please visit our website.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"3":{"tilte":"Coventry University National Hero Award for Chinese Students","link":"https:\/\/www.scholarshipportal.com\/scholarship\/coventry-university-national-hero-award-for-chinese-students","discription":"HomeScholarshipsCoventry University National Hero Award for Chinese StudentsCoventry University National Hero Award for Chinese StudentsBachelor, MasterWorth your full tuition fee for 1 year31 July 2020Visit Scholarship WebsiteThe courage, commitment and professionalism of healthcare workers fighting the Coronavirus (COVID-19) is a beacon of inspiration across the world. Many of these heroes have risked their own health to support patients and communities as professional caregivers, nurses, doctors and emergency staff. So we’re proud to be able to pay tribute for their service and bravery with the brand new National Hero Award.\nWe will fully fund the first year of tuition fees for successful students who qualify for this significant award. They will start their studies as an undergraduate or postgraduate student with us in September 2020. Depending on their course, students will study at either the Coventry or London campus of Coventry University.\nWe will consider each application on its merits, but can only consider applications made through the process below.\nThis is a scholarship byCoventry UniversityCoventry University is a public teaching focused university in Coventry, England.EligibilityWe welcome scholarship applications from health professionals who want to enroll on a healthcare course run by our Faculty of Health and Life Sciences. But we know that many heroes may want to broaden their skills and knowledge outside traditional healthcare, and many ‘unsung heroes’ may not fit into traditional healthcare roles. So if your personal statement shows that you have gone above and beyond the call of duty during the 2020 Coronavirus outbreak, we can consider your scholarship application on its own merits.\nIn addition, you must:\n\nSuccessfully enroll in the September 2020 intake at Coventry University or Coventry University London in order to receive the award.\nHold a conditional offer to study a course at Coventry University or Coventry University London.\nHave applied as a self-funded student paying international tuition fees.\nNot be progressing to us through our partnership with Cambridge Education Group or ISC London.\nBe a Chinese national, and be living in China when you apply.\n\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >IELTSTo apply for most scholarships, you have to speak English. To test your English language proficiencySchedule an IELTS test >BenefitsWorth your full tuition fee for 1 year.\nApplicationTo apply for this scholarship, complete the application form and return by email or post. Please visit the website for our contact details.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"4":{"tilte":"Vice-Chancellor’s Academic Excellence undergraduate financial aid for International Students","link":"https:\/\/www.scholarshipportal.com\/scholarship\/vice-chancellors-academic-excellence-undergraduate-financial-aid-for-international-students","discription":"HomeScholarshipsVice-Chancellor’s Academic Excellence undergraduate financial aid for International StudentsVice-Chancellor’s Academic Excellence undergraduate financial aid for International StudentsBachelor, Master$7,500 Visit Scholarship WebsiteWestern Sydney International is offering $7,500 and $5,000 multi-year scholarships to new commencing international students enrolling in undergraduate degree coursework programs at Western Sydney University in 2020.\nThis is a scholarship byWestern Sydney UniversityWestern Sydney University, formerly the University of Western Sydney, is an Australian multi-campus university in the Greater Western region of Sydney, Australia.Eligibilitycholarships are granted on academic achievement in a completed Year 12 qualification or equivalent recognised by Western Sydney University for admission.\nApplicants must:\n\nbe an international student and not an Australian citizen, New Zealand citizen or permanent resident of Australia. If your visa status changes to one of these during the study period, the scholarship will discontinue.\ncommence a new course of study in 2020 for the first time\nbe applying to study in a CRICOS registered undergraduate degree program\nsatisfy the academic eligibility requirements for either the $7,500 or $5,000 multi-year scholarship\nsatisfy all other admission requirements and accept their admission offer.\n\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >IELTSTo apply for most scholarships, you have to speak English. To test your English language proficiencySchedule an IELTS test >Benefits\n$7,500 per year contribution towards tuition fees (up to three years maximum) or\n$5,000 per year contribution towards tuition fees (up to three years maximum)\n\nThe value awarded will be dependent on your level of academic achievement in previous studies.\nThe scholarship is a tuition fee waiver and does not cover costs associated with living expenses, accommodation, transport, overseas student health cover or other costs associated with study.\nApplicationNo application is necessary. All new applications for admission will be automatically considered for a scholarship. If you are successful, your scholarship offer will be outlined in your Offer of Admission letter.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"5":{"tilte":"One-year Entrance Scholarships at McGill University","link":"https:\/\/www.scholarshipportal.com\/scholarship\/one-year-entrance-scholarships-at-mcgill-university","discription":"HomeScholarshipsOne-year Entrance Scholarships at McGill UniversityOne-year Entrance Scholarships at McGill UniversityBachelor$12,000Visit Scholarship WebsiteOverview of centrally-administered entrance scholarships\nMcGill's Scholarships and Student Aid Office offers merit-based entrance scholarships to first-time university students entering a full-time undergraduate degree program.\nTransfer, Mature, Diploma, Exchange, Special, Part-time and Visiting students are not eligible for entrance scholarships.\nThere are two types of centrally-administered entrance scholarships:\n\nOne-year Scholarships, valued at $3,000 (non-renewable)\nMajor Scholarships, valued between $3,000 and $12,000 (renewable annually up to 3 or 4 years provided criteria for renewal are met)\n\nThis is a scholarship byMcGill UniversityMcGill University is a public research university in Montreal, Quebec, Canada.EligibilityOur office offers merit-based entrance scholarships to first-time university students entering a full-time undergraduate degree program.\nTransfer, Mature, Diploma, Exchange, Special, Part-time and Visiting students are not eligible for entrance scholarships.\nRecipients of McGill centrally-administered entrance scholarships can receive only one scholarship. If you receive more than one offer, the final entrance scholarship will be that of the highest eligible value. This will not impact Faculty-specific Entrance Scholarships–please see below.\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >IELTSTo apply for most scholarships, you have to speak English. To test your English language proficiencySchedule an IELTS test >BenefitsAll Entrance Scholarship awardees entering university in September are guaranteed their first or second choice of residence building, provided they apply by the residence application deadline. Should one of the smaller residence buildings fill up before all scholarship winners are placed in their first choice, scholarship awardees will be guaranteed their second choice of residence.\nApplicationMajor entrance scholarships (value: $3,000, $5,000, $10,000 or $12,000 renewable)\n$12,000 scholarships are only available to Canadian citizens or legal permanent residents of Canada.\nMajor entrance scholarships are determined by selection committees and awarded on the basis of academic achievement and outstanding leadership in school or community activities. Emphasis is placed on academic excellence as the first priority, followed by demonstrated leadership. Please note that \"leadership\" constitutes more than simple participation in extracurricular activities.\nApplying:\nA seperate application is required soon after submission of your application for admission. Please consult the deadline dates.\nTo determine if you may qualify, please review the minimum academic requirements.\nStudents who apply for, but do not receive a major scholarship will automatically be considered for a one-year entrance scholarship.\nMajor entrance scholarships are renewable up to 3 or 4 years provided criteria for renewal are met.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"6":{"tilte":"Sasahkt Scholarship for Women","link":"https:\/\/www.scholarshipportal.com\/scholarship\/sasahkt-scholarship-for-women","discription":"HomeScholarshipsSasahkt Scholarship for WomenSasahkt Scholarship for WomenBachelorRs.80000\/annum15 August 2020Visit Scholarship WebsiteDr. Reddy’s Foundation launched the Sashakt scholarship in March 2018 and has awarded scholarships to 41 students in the past 2 years\nThe online application process for the year 2020-21 batch has commenced from 1 March 2020. The last date for applications is 15 August 2020.\nThe Scholarship is applicable to girl students in first year graduation in 2020-21 academic session in the listed colleges and enrolled in basic\/ natural science courses. The scholarship also offers these students mentorship opportunities.\nEligibility\nGirls in the firtst year graduation in 2020-21 academic session\nHave applied\/received admission in the listed 20 colleges\nDoing courses in basic\/natural sciences (not applied sciences)\nShould be Indian Nationals\n\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >IELTSTo apply for most scholarships, you have to speak English. To test your English language proficiencySchedule an IELTS test >Benefits\nWill receive a scholarship of Rs.80000\/annum for 3 years (Rs. 2,40,000 over 3 years)\nMentorship support from women scientists\nGuidance on c future study options in Science and especially research.\n\nApplicationFor more information in general and about the application process please visit our website.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"7":{"tilte":"IB Diploma Program funding for International Students in Thailand","link":"https:\/\/www.scholarshipportal.com\/scholarship\/ib-diploma-program-funding-for-international-students-in-thailand","discription":"HomeScholarshipsIB Diploma Program funding for International Students in ThailandIB Diploma Program funding for International Students in ThailandBachelor, Master 770,000 THB1 May 2020Visit Scholarship WebsiteOur school is excited to offer generous scholarship opportunities for incoming grade 11 students (enrolling August 2020) who demonstrate strong potential for success as IB Diploma candidates at one of Thailand’s leading IB Diploma Program (IBDP) schools.\nEligibilityTo be eligible, the applicants must meet all the following criteria:\n\nEnglish proficiency\nExperience and interest in an additional language(s)\nAdvanced and successful studies in multiple academic disciplines\nManagement of time and resources\nInterest and participation in elements of Creativity, Activity, and Service (CAS)\nOpen for incoming grade 11 students\n\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >IELTSTo apply for most scholarships, you have to speak English. To test your English language proficiencySchedule an IELTS test >BenefitsHow to Apply: In order to apply for the award, applicants are required to fill the application for admission here.\nSupporting Documents: Three years of academic transcripts External exam scores (SAT, PSAT, MAP, or others)\nAn academic writing sample (e.g., copy of a writing assignment, essay, paper, etc.) completed for any current or previous course that best demonstrates the applicant’s academic writing abilityAn outline of the applicant’s preferred academic program. What course(s) the student would be most interested in taking in each of the 6 IBDP groups? (This can be in a narrative or list form.)Writing response #1: How do you exemplify the IB Learner Profile? (max. 500 words)Writing response #2: What are your academic goals after high school? (max. 300 words)\nLanguage Requirement: Students need to demonstrate that they have a good level of written and spoken English.\nApplicationTo apply, please complete the following:\n1. Submit a full application for admission here\n2. Submit the supplemental IB Diploma Program application materials listed below\nApplications will be accepted through May 1, 2020, with priority given to early applicants. Consideration will include and priority will be given to students with an academic record and learning profile that demonstrates potential success in the IBDP at RIS. Successful applicants will demonstrate strengths in the following areas:\n\nEnglish proficiency\nExperience and interest in an additional language(s)\nAdvanced and successful studies in multiple academic disciplines\nManagement of time and resources\nInterest and participation in elements of Creativity, Activity, and Service (CAS)\n\nApplications will be reviewed by a committee and decisions made on a rolling basis. Admitted students will receive a scholarship of up to 50% tuition for two years—valued at up to 770,000 THB—not including registration, application, IB exam and other standard fees.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"8":{"tilte":"Valuewalk Business Studies Scholarship Program","link":"https:\/\/www.scholarshipportal.com\/scholarship\/valuewalk-business-studies-scholarship-program","discription":"HomeScholarshipsValuewalk Business Studies Scholarship ProgramValuewalk Business Studies Scholarship ProgramBachelor, Course$200031 May 2020Visit Scholarship WebsiteThe scholarship is made available to any student accepted or enrolled into a college or university degree program. Participants enrolled in a higher learning degree granting program from any country may apply for the scholarship program.\nThis is a scholarship byValueWalkValueWalk is a news website responsible for breaking the worldwide news on Business, Politics and Technology.EligibilityApplicants must be currently enrolled or accepted in a University or College as a full-time student.\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >IELTSTo apply for most scholarships, you have to speak English. To test your English language proficiencySchedule an IELTS test >BenefitsA total award of $2000 is granted to the winner directly to the applicant’s college\nApplicationSubmission Requirements\nApplicants must be currently enrolled or accepted in a University or College as a full-time student.\nThere will be 2 contest submission dates. To be eligible for the contest submit your essay by one the submission dates.\n\nRound 1: Accepting entries December 1st 2019 -May 1st 2020. Winners announced 6\/01\/20\nRound 2 : Accepting entries June 1st -November 1st 2020, Winners announced 12\/01\/20\nPlease remember that the word requirement is 750.\n\nAlong with your submission please include a picture of yourself or an image relating to the essay topic, which we can post on our site to go along with your essay.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"9":{"tilte":"2020 Essay Scholarships for Undergraduate Students","link":"https:\/\/www.scholarshipportal.com\/scholarship\/2020-essay-scholarships-for-undergraduate-students","discription":"HomeScholarships2020 Essay Scholarships for Undergraduate Students2020 Essay Scholarships for Undergraduate StudentsBachelor, CourseFrom $50030 October 2020Visit Scholarship WebsiteWe are happy to announce a yearly Kid at School Scholarship Program. We value the importance of education, which is why we’d like to offer an eligible student the opportunity to win one of $500 - $1500 scholarships in an effort to assist with the costs of continued education.\nEligibilityStudents of high schools and colleges, including undergraduate and graduate candidates, can take part in our scholarship essay contest.\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >IELTSTo apply for most scholarships, you have to speak English. To test your English language proficiencySchedule an IELTS test >BenefitsThree authors from the winning essays will get cash prizes:\n\n1st place $1500\n2nd place $1000\n3rd place $500\n\nApplicationMake sure you have discovered our rules before taking part in the scholarship essay contest:\n\nSubmit your finished essay on our website with Essay Writing Contest 2020 in the email’s subject to participate.\nYour paper must be written in English only.\nPlease make sure your essay contains 500-700 words.\nWe can accept only one essay from one applicant.\nIf your document contains any kind of plagiarism, it’s a reason to disqualify a candidate from our competition immediately.\n\nCheck our website for more details.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"10":{"tilte":"Richard E. Morley Industrial Automation Scholarship","link":"https:\/\/www.scholarshipportal.com\/scholarship\/richard-e-morley-industrial-automation-scholarship","discription":"HomeScholarshipsRichard E. Morley Industrial Automation ScholarshipRichard E. Morley Industrial Automation ScholarshipMaster, Bachelor20% reduction on your overall course tuition fees31 December 2020Visit Scholarship WebsiteThere are multiple scholarships available. Please visit the website for more detailed information.\nThe value is a 20% reduction in your overall course tuition fees.\nThe scholarships are available for the following pathways:\n\nBachelor of Science (Industrial Automation Engineering)\nMaster of Engineering (Industrial Automation)\n\nEligibility\nMust be a commencing student studying the Bachelor of Science (Industrial Automation Engineering) or Master of Engineering (Industrial Automation) course with EIT online or on-campus.\nMust meet or exceed the English Language Proficiency requirement for the specific course of study.\nMust meet all other entry requirements for the course + at least a minimum result of 70% in all Mathematics units achieved in the highest level of education completed.\nMust be a full fee-paying student, without existing scholarships. Students can apply for multiple scholarships, but will only be awarded one scholarship.\n\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >IELTSTo apply for most scholarships, you have to speak English. To test your English language proficiencySchedule an IELTS test >Benefits\nThe scholarship value is equal to a 20% reduction on the total course tuition.\nThe scholarship discount will be divided evenly across the total amount of units in the course and applied each semester to each unit being undertaken, not in a lump sum.\nThe scholarship only covers tuition fees and does not cover any other non-tuition fees or expenses.\nStudents must successfully pass all units attempted each semester\/term otherwise the scholarship will be revoked by EIT.\n\nApplicationPlease complete and submit the Scholarship Application form along with your course application\nCut-off date for scholarship applications is 1 month prior to the start date of the course.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"11":{"tilte":"Attorneys.org Legal Scholarship – 2020","link":"https:\/\/www.scholarshipportal.com\/scholarship\/attorneys-org-legal-scholarship-2020","discription":"HomeScholarshipsAttorneys.org Legal Scholarship – 2020Attorneys.org Legal Scholarship – 2020Master, Bachelor$1,00011 December 2020Visit Scholarship WebsiteAttorneys.org is proud to offer a $1000 scholarship for those interested in learning more about the law and our legal system. Please write a 500 word essay telling us why you are interested in the law, criminal justice or forensics. Your essay can include life events and other key influences, career plans or anything else that contributes to your interest.\nEligibilityRequirements\n\nOpen to high school, college and grad school students interested in or currently studying law, criminal justice or forensics\nMinimum 3.0 GPA\nSend us an email with your transcript and essay, please find the email address online.\nYou accept that your name and\/or essay may be published on our website and social media if chosen as the recipient\n\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >IELTSTo apply for most scholarships, you have to speak English. To test your English language proficiencySchedule an IELTS test >BenefitsThe $1,000 scholarship will go to a student's educational expenses.\nApplicationPlease visit the website for more information about the application process.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"12":{"tilte":"2020 CIMON INC. SCHOLARSHIP","link":"https:\/\/www.scholarshipportal.com\/scholarship\/2020-cimon-inc-scholarship","discription":"HomeScholarships2020 CIMON INC. SCHOLARSHIP2020 CIMON INC. SCHOLARSHIPMaster, Bachelor, Phd$10001 December 2020Visit Scholarship WebsiteAt CIMON Inc, we are proud to offer a scholarship program for students in the process of pursuing a college degree. The awarded student will receive $1,000 to be used towards expenses for his or her degree.\nEligibilityU.S. citizen accepted to or currently attending a college or university within the United States obtaining a degree in the STEM field. The winner will be required to provide proof of acceptance to your college or university, or a college transcript.\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >IELTSTo apply for most scholarships, you have to speak English. To test your English language proficiencySchedule an IELTS test >BenefitsThe awarded student will receive $1,000 to be used towards expenses for his or her degree.\nApplicationPlease visit our website for more information.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"13":{"tilte":"$1000 Essay Scholarship Program","link":"https:\/\/www.scholarshipportal.com\/scholarship\/1000-essay-scholarship-program","discription":"HomeScholarships$1000 Essay Scholarship Program$1000 Essay Scholarship ProgramMaster, Bachelor, CourseZouton is offering $1000 scholarship20 September 2020Visit Scholarship Website$1000 Scholarship shall be available to all the students looking to pursue further in the USA for a graduate or post-graduate program.\n\nThe scholarship would be awarded annually, and students will be shortlisted based on their performance in the essay.\nThe content should be original and a non-plagiarised piece.\nThe applicant can submit only one application form.\nThe decision of the sponsor will be the final binding.\n\nEligibility\nThe applicant should be 18 years or older at the time of enrolment.\nCandidate should be enrolled in an approved undergraduate\/ post-graduate course in a reputed US educational institute.\nThe applicant should submit an essay that is void plagiarism and includes the following points.\n\n\nWhy do you want to study in the US?\nWhy do you need this scholarship?\nHow will the scholarship benefit you?\nHow are you better than other applicants?\n\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >IELTSTo apply for most scholarships, you have to speak English. To test your English language proficiencySchedule an IELTS test >Benefits\nValue of scholarship to be awarded - $1000\nOnly one winner will be selected for awarding the scholarship prize.\nThe scholarship prize is a cash-only scholarship and no cash equivalent.\nEase the finances of studying in the USA with this scholarship by simply enrolling yourself for the competition and submitting your best creative inputs in the form of the essay.\n\nApplicationPlease visit our website and fill in the form given online.\nThe scholarship will be available on the following conditions:\n\nTaxes will be deducted as per section 194B of the Income Tax Act, India.\nThe submission of application form implies that the applicant has agreed upon the terms and conditions along with the official rules set by the sponsor.\nThe applicant needs to submit an essay that is original with regard to the content and is written in English language only.\n\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"14":{"tilte":"International Stellar Scholarships - Alliance Manchester Business School","link":"https:\/\/www.scholarshipportal.com\/scholarship\/international-stellar-scholarships-alliance-manchester-business-school","discription":"HomeScholarshipsInternational Stellar Scholarships - Alliance Manchester Business SchoolInternational Stellar Scholarships - Alliance Manchester Business SchoolBachelor£2,000 per year31 August 2020Visit Scholarship WebsiteAlliance Manchester Business School will award two international stellar scholarships to talented international students in 2020.\nThese awards are worth £2,000 per year across three years of study.\nThis is a scholarship byThe University of ManchesterPart of the prestigious Russell Group of universities, The University of Manchester is the largest single-site university in the UK, with the biggest student community.EligibilityEligibility criteria: International students (classified as overseas for tuition fee purposes) who are residents of Singapore, Malaysia or Norway and achieve AAA at A-level (or equivalent).\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >IELTSTo apply for most scholarships, you have to speak English. To test your English language proficiencySchedule an IELTS test >BenefitsThese awards are worth £2,000 per year across three years of study (students will not receive the scholarship while on placement or exchange).\nApplicationSuccessful applicants will be identified via both:\n\nacademic performance and;\na written application (maximum 400 words)\n\nYour written application should outline your commitment to academic studies and extra-curricular pursuits. Our Director of Undergraduate Studies will award the scholarships after assessing all eligible statements.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"15":{"tilte":"Social Responsibility Scholarships - Alliance Manchester Business School","link":"https:\/\/www.scholarshipportal.com\/scholarship\/social-responsibility-scholarships-alliance-manchester-business-school","discription":"HomeScholarshipsSocial Responsibility Scholarships - Alliance Manchester Business SchoolSocial Responsibility Scholarships - Alliance Manchester Business SchoolBachelor£2,000 per year31 August 2020Visit Scholarship WebsiteWe will award five undergraduate social responsibility scholarships to UK\/EU students and three undergraduate social responsibility scholarships to international students in 2020. These awards are worth £2,000 per year.\nYour application should outline your previous involvement in, for example, community-based projects, volunteering opportunities and\/or fundraising activities and how you hope to continue this at Alliance MBS.\nThis is a scholarship byThe University of ManchesterPart of the prestigious Russell Group of universities, The University of Manchester is the largest single-site university in the UK, with the biggest student community.EligibilityUK\/EU and international students achieving AAA at A-level (or equivalent) who are able to demonstrate a significant contribution and commitment to social responsibility.\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >IELTSTo apply for most scholarships, you have to speak English. To test your English language proficiencySchedule an IELTS test >BenefitsThese awards are worth £2,000 per year across three years of study (students will not receive the scholarship while on placement or exchange).\nApplicationSuccessful applicants will be identified via both:\n\nacademic performance and;\na written application (maximum 1,000 words)\n\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"}}