{"1":{"tilte":"\n\t\t\tMore rain, snow expected in Southern California\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/23\/more-rain-snow-expected-in-southern-california\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/LDN-L-STORM-RAIN-RMC-01-2.jpg?w=548","discription":"\nLOS ANGELES — A storm from Canada brought showers to Southern California overnight, triggering a mudslide in Sherman Oaks and creating winter-weather conditions in the San Gabriel Mountains, authorities said Monday.\nIn addition to Monday morning’s one-and-off showers, there’s a chance of showers Monday afternoon, said National Weather Service meteorologist Todd Hall. Tuesday should be mostly dry, ahead of another system Wednesday night into Thursday. That system could drop snow on The Grapevine Thursday morning, but snow will not affect the 5 Freeway Monday, according to the NWS.\nThe mudslide in Sherman Oaks occurred sometime before 10 p.m. Sunday on the 15000 block of West Hamner Drive. Debris damaged at least one residence, but no injuries were immediately reported.\nCars splash through a rain-swollen Sherman Way near Haskell Avenue in the Van Nuys area late Sunday, March 22, 2020, as rain poured down on the San Fernando Valley. (Photo by Rick McClure\/Special to the Los Angeles Daily News)\n\nCars splash through a rain-swollen Sherman Way near Haskell Avenue in the Van Nuys area late Sunday, March 22, 2020, as rain poured down on the San Fernando Valley. (Photo by Rick McClure\/Special to the Los Angeles Daily News)\n\nLos Angeles police officers block entry to the Sepulveda Basin on Burbank Boulevard late Sunday, March 22, 2020, to keep drivers from becoming trapped in the low-lying area’s flooded roadways as rain pours down on the San Fernando Valley. (Photo by Rick McClure\/Special to the Los Angeles Daily News)\n\nLos Angeles police officers block entry to the Sepulveda Basin on Burbank Boulevard late Sunday, March 22, 2020, to keep drivers from becoming trapped in the low-lying area’s flooded roadways as rain pours down on the San Fernando Valley. (Photo by Rick McClure\/Special to the Los Angeles Daily News)\n\nLos Angeles police officers block entry to the Sepulveda Basin on Burbank Boulevard late Sunday, March 22, 2020, to keep drivers from becoming trapped in the low-lying area’s flooded roadways as rain pours down on the San Fernando Valley. (Photo by Rick McClure\/Special to the Los Angeles Daily News)\n\nLos Angeles police officers block entry to the Sepulveda Basin on Burbank Boulevard late Sunday, March 22, 2020, to keep drivers from becoming trapped in the low-lying area’s flooded roadways as rain pours down on the San Fernando Valley. (Photo by Rick McClure\/Special to the Los Angeles Daily News)\n\nLos Angeles police officers block entry to the Sepulveda Basin on Burbank Boulevard late Sunday, March 22, 2020, to keep drivers from becoming trapped in the low-lying area’s flooded roadways as rain pours down on the San Fernando Valley. (Photo by Rick McClure\/Special to the Los Angeles Daily News)\n\nLos Angeles police officers block entry to the Sepulveda Basin on Burbank Boulevard late Sunday, March 22, 2019, to keep drivers from becoming trapped in the low-lying area’s flooded roadways as rain pours down on the San Fernando Valley. (Photo by Rick McClure\/Special to the Los Angeles Daily News)\n\nCars splash through a rain-swollen Sherman Way near Haskell Avenue in the Van Nuys area late Sunday, March 22, 2020, as rain poured down on the San Fernando Valley. (Photo by Rick McClure\/Special to the Los Angeles Daily News)\n\nSnow-capped mountains create a wintry backdrop looking towards Pomona on Saturday, March 21, 2020. (Photo by Cindy Yamanaka, The Press-Enterprise\/SCNG)\n\nDrivers along the northbound 57 Freeway have a snow-capped view in Pomona on Sunday, March 22, 2020.  (Photo by Cindy Yamanaka, The Press-Enterprise\/SCNG)\n\nSnow-capped mountains create a wintery backdrop looking towards Pomona on Sunday, March 22, 2020. Pomona was partial cloudy with a pleasant 70 degree weather in the afternoon. (Photo by Cindy Yamanaka, The Press-Enterprise\/SCNG)\n\nIn the San Gabriel Mountains, a winter weather advisory, which denotes challenging traveling conditions, will be in effect until 1 p.m. Monday.\n“Moderate snow accumulations are expected over the higher elevations, which will affect the higher mountain roads,” according to an NWS statement. For now, “the snow will not affect Interstate 5.”\nAn accumulation of 6 to 10 inches of snow is expected above 6,500 feet, and less snow is expected between 4,500 and 6,500 feet, according to the statement.\nAlso expected in the mountains are southwest winds of 15 to 30 mph and 45-mph gusts, according to the NWS.\nThe heaviest snow will fall early Monday and until 1 p.m, when the winter weather advisory will expire.\n“Travel could be very difficult over higher mountain roads,” warned the NWS statement.\nThe NWS forecast rain Monday and highs of 42 on Mount Wilson; 58 in Santa Clarita; 59 in Palmdale and Lancaster; 61 in Burbank and Granada Hills; 62 in Avalon, Pasadena, North Hollywood, Van Nuys, Sherman Oaks, Studio City, Canoga Park, Winnetka, Chatsworth and Woodland Hills; 63 in San Pedro, Northridge, San Gabriel and West Covina; 64 in Long Beach, Hawthorne and Glendale; 65 in Whittier, Torrance and at LAX; and 66 in downtown LA. Tuesday and Wednesday will be mostly cloudy; and showers are forecast Thursday before two partly cloudy days amid temperatures ranging from the low 60s to the low 70s.\nPartly cloudy skies are expected in most of Orange County, though the Santa Ana Mountains will experience showers, along with highs of 41 on Santiago Peak; 51 on Ortega Highway at 2,600 feet; 57 at Fremont Canyon and Trabuco Canyon; 59 in Laguna Beach; 60 in Yorba Linda and San Clemente; 61 in Newport Beach and Mission Viejo; 62 in Anaheim; and 63 in Fullerton, Santa Ana and Irvine. Temperatures will remain about the same until a warming trend Saturday and Sunday, with showers forecast Thursday."},"2":{"tilte":"\n\t\t\tCoronavirus means a new way of daily living\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/23\/coronavirus-means-a-new-way-of-daily-living\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/OCR-L-SAFE-2-0323-1-1.jpg?w=337","discription":"\nThe message from state officials is clear: Stay home, only leave for essentials and keep 6 feet away from others to stop the spread of the coronavirus.\nBut some Southern Californians are wondering about the practicalities. Is it safe to wait in line with others to enter a grocery store? Is it best to cross the street if a neighbor is also out for a walk?\nLocal public health officials said to use common sense while practicing social distancing.\n“You cut the spread by putting people away from situations where they unconsciously end up sharing germs,” said Dr. Shruti K. Gohil, associate medical director of epidemiology and infection prevention at UC Irvine Medical Center. “I think we do need to stay rational and think about how to translate the new directives into our daily lives in a way that makes sense and allows us to live life while adhering to strict precautions. That is the hard part.”\nHealth experts have advised keeping hands and surfaces clean when going out for essentials such as groceries, gas or a prescription. When possible, pick up items in the same trip for seniors or an immunocompromised neighbor.\nThe California Department of Public Health has recommended that shoppers stay 6 feet apart and that stores limit customers as needed to reduce crowding and lines.\nDr. Emily Blodget, an infectious disease specialist at USC’s Keck School of Medicine, suggested shopping when stores are less busy to avoid long lines either outside or at checkout.\n“If you’re standing around in line it defeats the purpose of having more space in the store,” Blodget said.\nGohil said to stick to a shopping list and buy enough for a week to prevent extra trips. She said to avoid anyone who is coughing or sneezing, don’t touch your face and apply hand sanitizer frequently, especially after touching common surfaces.\n“If somebody coughs across the room and they’re visibly sick but they didn’t cough on you and they didn’t get within your 6-foot orbit, you’re not considered exposed,” Gohil said.\nEven if a shopper unknowingly touches a surface where a sick person has deposited respiratory secretions, proper hand cleaning can halt transmission.\n“If you do your hand hygiene you’ve stopped the material from getting into your mucus membranes,” Gohil said.\nBrandon Brown, an epidemiologist at UC Riverside’s School of Medicine, said if consumers haven’t been able to clean their hands throughout the course of their errands, they should use a disinfecting wipe to clean items they touched such as phones, credit cards, car door handles and keys. \n“Anything you can use to sanitize these items that we touch before we might be touching our face is definitely useful,” he said.\nBlodget said rather than simply rinsing fruits and vegetables at home, which may have been handled by other shoppers, wash them with a gentle dish soap. Washing or wiping down reusable shopping bags is also a good idea.\nWhen getting gas, Blodget suggested using a wipe to clean the keypad and pump handle. Use pharmacy drive-throughs to pick up prescriptions when possible.\nGov. Gavin Newsom’s stay-at-home order allows for visits to care for a friend or relative. As residents remain at home, they should wash their hands often and refrain from sharing utensils or drinks with any visitors, Gohil said.\nWhen walking outside, Blodget said there’s no need to cross the street if you see someone coming. It’s fine to wave and say hello to a neighbor or even chat briefly while maintaining a distance.\n“I think just walking around on the streets a little bit with your dog is probably OK,” she said. “It’s just going to be a quick enough period of time that you’re just walking and passing by.”\nBrown said as more people shop online, it’s a good idea to wash your hands after opening a box. The same goes for after receiving a food delivery.\nDespite interruptions in school and child care, now is not the time for grandparents to care for children. Doctors said to avoid visits with kids to ensure no one gets sick during these early days of social distance.\n“We’re still learning about how long you’re actually infectious after you get sick,” Blodget said.\nThe California Dental Association has recommended that dental offices temporarily suspend non-urgent dental care. Routine medical visits should also be rescheduled.\nGohil said that hospitals have processes in place to screen and isolate potentially ill patients to avoid unnecessary exposures to others needing medical care, such as chemotherapy patients or women going into labor.\n“If it’s something that’s essential for your survival, we have protections in place,” she said. “We have ways we keep our spaces in the hospital as clean as possible.”\nAs residents take precautions, Brown said he prefers the term “physical distancing” to remind people that it’s vital to remain connected through virtual communication such as video chat.\n“Since we’re social beings, we need to see each other to talk and discuss,” Brown said. “We need to tackle feelings of isolation and depression that could come at this time when we’re forced to be at home to halt the pandemic.”"},"3":{"tilte":"\n\t\t\tUCI researchers will test former Ebola drug as part of coronavirus clinical trial\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/23\/uci-researchers-will-test-former-ebola-drug-as-part-of-coronavirus-clinical-trial\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/OCR-L-VIRUS-CLINICAL-0323-lede-PB-1.jpg?w=620","discription":"\nEverybody is hoping for a miracle drug to treat COVID-19, the disease caused by the infectious novel coronavirus.\nNow, researchers at UC Irvine have a shot at helping to find it.\nAs part of a national clinical trial, the Orange County team of medical scientists are authorized to use the anti-viral drug remdesivir — once developed to treat the Ebola virus — on certain COVID-19 patients hospitalized at UCI Medical Center in Orange. The study’s goal, over an unspecified period of time, will be to determine the drug’s effectiveness against a disease that has already killed more than 11,000 people.\nThe research is being led by Dr. Alpesh N. Amin, chair of UCI School of Medicine’s Department of Medicine and executive director of the UCI Health Hospitalist Program and fellow principal investigator Dr. Lanny Hsieh, an infectious disease specialist.\n“The exciting thing is that UCI is on the cutting edge of making this available to our patients,” Amin said. “We want to be there. We want to make sure we have the right therapeutic options.”\nAs of Friday, March 20, when Amin spoke to The Orange County Register about the study, UCI Medical Center had two COVID-19 patients. In both cases, eligibility for the trial was being determined.\nThere is no known treatment at this point for COVID-19. Scientists around the world are racing to find something that can arrest the mild to severe respiratory symptoms and illness that can lead to pneumonia and, in the case of older adults and people with compromised immune systems, higher rates of death.\nRemdesivir, developed by Gilead Sciences Inc., is among the potential drug therapies highlighted in recent news briefings by the White House Coronavirus Task Force. The antiviral drug, administered intravenously, also is being studied in COVID-19 clinical trials in China, where the novel coronavirus emerged late last year.\nIt has been shown to be safe for use in humans and has had success as a coronavirus treatment.\nIn January, it was administered under “compassionate use” to a Washington state man who had developed pneumonia related to COVID-19; he recovered. In late February, doctors at UC Davis Medical Center treated a critically ill COVID-19 patient with remdesivir, also under compassionate use. In a \nAnd last week, a 79-year-old patient in Italy, where the COVID-19 death toll has exceeded that of China, was declared cured by the drug.\nGilead, headquartered in San Mateo County, developed remdesivir as a potential treatment for the West African Ebola virus, but a 2018 clinical trial found two other drugs to be more effective. Gilead’s own tests have shown the drug’s promise in treating two other coronavirus infections, Middle East respiratory syndrome, or MERS, and severe acute respiratory syndrome, or SARS.\nUCI Health — the combined clinical, medical and research arms of UC Irvine — last week joined counterparts at UC Davis and UC San Diego in research sponsored by the National Institute of Allergy and Infectious Diseases, which is part of the National Institutes of Health. The federal agency first began enrolling coronavirus patients for the study in February, at the University of Nebraska Medical Center in Omaha.\nThe trial is open only to hospitalized patients with what the NIH refers to as “laboratory-confirmed SARS-CoV-2 infection” showing evidence of “lung involvement that includes rattling sounds when breathing (rales) with a need for supplemental oxygen or abnormal chest X-rays, or illness requiring mechanical ventilation.”\nPatients who are asymptomatic, or who have only mild cold-like symptoms, are excluded from the trial.\nAmin said the investigators will assess the trial’s progress after the first 100 patients have enrolled across the 20 open sites.\nParticipants will randomly be assigned to receive the drug, or a placebo, in the double-blind study — meaning neither patient nor investigator will know which the participant is getting. Trial protocol calls for administering 200 mg of remdesivir on Day 1, followed by a daily maintenance dose of 100 mg for the duration of hospitalization, up to a total course of 10 days.\nUCI’s Dr. Amin said he did not know how many patients the trial may ultimately involve. Here are his answers to other questions.\n When does the trial start at UCI?\n It’s starting now. Currently, we’re assessing the patients in house that would potentially be part of this trial.\n Are patients giving consent themselves or is it through a family member?\n  We have an informed consent. It will either be the patient or family member, depending on the condition of the patient.\n How long will the trial last and how many patients will be involved?\n I don’t know as of right now. As we enroll patients and we start seeing the outcomes that occur, that’s going to give some directionality to the trial. Part of it also depends on how quickly we can enroll enough patients into the trial.\nWe don’t have a good sense yet of how many patients are going to be coming into the hospital and how many of those patients can actually meet the inclusion criteria of the trial.\nIt’s a little bit of a different thing than maybe other trials where you kind of have a good sense of the disease burden. We’re trying to understand the level of disease burden because it’s so new. We’re also on the cutting edge of trying to get the right therapy for managing that disease.\nSo it’s going to be a little bit of fluid decision making in terms of the length for the trial and how many patients we actually enroll across the country. If you ask me in a month or two, I might have a little bit better answer.\n Is this one of several trials going on in the U.S. or is it all one big trial in different states?\n There are other trials that are either in motion or already have started. This one is specific about using remdesivir for the treatment of acutely ill hospitalized patients, compared to a placebo.\nWe’re still trying to learn what potential therapies will actually work against COVID-19. We’re talking about other potential therapy adoptions, so those will have their own trials. It’s a dynamic situation right now.\n How is efficacy determined; how will you know the drug is working?\n Efficacy is determined by improvement of clinical symptoms and how quickly the clinical symptoms improve. Then ultimately, the efficacy is looking at the mortality. Is there a survivability difference between patients that take the drug versus patients that don’t?\n To what extent has this particular drug been used on COVID-19 patients?\n It’s been tried experimentally. I don’t know how many countries off the top of my head. While remdesivir has shown some promise, we need some clinical data to indicate some improvements for infected patients.\n If this drug shows success, how soon could it be used as a therapy? What are the next steps?\n If the study shows that (successful treatment) can be done, then it would go for FDA application. The FDA would review the data and based on the data, the FDA could give approval to the manufacturing company.\nIt’s basically breaking down some processes and barriers that would have taken longer in other situations. Given the situation that we are in collectively, I think the FDA would move very fast."},"4":{"tilte":"\n\t\t\tFed to buy as much government debt as needed to aid coronavirus-battered economy\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/23\/fed-to-buy-as-much-government-debt-as-needed-to-aid-coronavirus-battered-economy\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/AP20077545642902-1.jpg?w=525","discription":"\n | \nWASHINGTON — In its boldest effort to protect the U.S. economy from the coronavirus, the Federal Reserve says it will buy as much government debt as it deems necessary and will also begin lending to small and large businesses and local governments to help them weather the crisis.\nThe Fed’s announcement Monday removes any dollar limits from its plans to support the flow of credit through an economy that has been ravaged by the viral outbreak. The central bank’s all-out effort has now gone beyond even the extraordinary drive it made to rescue the economy from the 2008 financial crisis.\n“The coronavirus pandemic is causing tremendous hardship across the United States and around the world,” the Fed said in a statement. “Our nation’s first priority is to care for those afflicted and to limit the further spread of the virus. While great uncertainty remains, it has become clear that our economy will face severe disruptions. Aggressive efforts must be taken across the public and private sectors to limit the losses to jobs and incomes and to promote a swift recovery once the disruptions abate.”\nFinancial markets sharply reversed themselves after the announcement but then fell back again after the market opened. By mid-morning, the Dow Jones Industrial Average was down about 1.5%. The yield on the 10-year Treasury bond fell, a sign that more investors are willing to purchase the securities.\nIn unleashing its aggressive new efforts, the Fed is trying both to stabilize the economic standstill and allay panic in financial markets. Many corporations and city and state governments are in desperate need of loans to pay bills and maintain operations as their revenue from customers or taxpayers collapses. That need has escalated demand for cash. In the meantime, large businesses have been drawing, as much as they can, on their existing borrowing relationships with banks.\nThe intensifying needs for cash means that banks and other investors are seeking to rapidly unload Treasuries, short-term corporate debt, municipal bonds and other securities. The Fed’s move to step in and act as a buyer of last resort is intended provide that needed cash.\nMany economists say that whatever financial support Congress eventually provides will likely be even more important than the Fed’s intervention. And they warn that such fiscal help needs to come soon.\nThe Fed’s intervention is not a substitute for fiscal stimulus,” said Joseph Gagnon, a former Fed economist who is now senior fellow at the Peterson Institute for International Economics. “Let’s hope Congress passes something quickly.”\nIn its announcement Monday, the Fed said it will establish three new lending facilities that will provide up to $300 billion by purchasing corporate bonds, a wider range of municipal bonds and securities tied to such debt as auto and real estate loans. It will also buy an unlimited amount of Treasury bonds and mortgage-backed securities to try to hold down borrowing rates and ensure those markets function smoothly.\nThe central bank’s new go-for-broke approach is an acknowledgment that its previous plans to keep credit flowing smoothly, which included dollar limits, wouldn’t be enough in the face of the viral outbreak, which has brought the U.S. economy to a near-standstill as workers and consumers stay home. Last week, it said it would buy $500 billion of Treasuries and $200 billion of mortgage-backed securities, then quickly ran through roughly half those amounts by week’s end of the week.\nAnd on Monday, the New York Federal Reserve said it would buy $75 billion of Treasuries and $50 billion of mortgage-backed securities each day this week.\n“They’re really setting the economy up” to start functioning again when the health crisis subsides, said Donald Kohn, a former Fed vice chair who is a senior fellow at the Brookings Institution. “Part of this is about the other side of the valley: Make sure the credit is there.”\nStill, Kohn noted, “These things will take some time to set up. These are complicated” programs.\nJust knowing that the Fed is on the case should reassure businesses as the programs ramp up, Kohn said.\n“The fact that this is coming: People will know it,” Kohn said. “They know the Fed is on the job. If there are issues that come up, what you’re seeing from this Federal Reserve is: ‘We will deal with it.’ ”\nIan Shepherdson, chief economist at Pantheon Macroeconomics, said it is clear that the Fed is now doing “whatever it takes.”\n“This is an all-out effort to ensure that the business sector can continue to exist even as economic activity temporarily collapses,” Shepherdson said.\n“The steps announced today, combined with the previous ones … should substantially improve market functioning and should provide some important support for the economy,” said Roberto Perli, a former Fed economist who is now head of global policy research at Cornerstone Macro.\nBut Perli cautioned that the benefits won’t be felt immediately.\n“The next couple of quarters will still be probably bad,” he said.\nThe new programs announced Monday by the Fed include two that will buy corporate debt issued by large companies. The Fed legally can’t lend directly to companies. But it can lend to separate entities, which can then make those purchases.\nOne program will buy newly issued corporate debt. This is an effort to revive that market, which has effectively come to a standstill. The second will buy previously issued corporate debt. Both programs will include $10 billion provided by the Treasury to offset any losses.\nA third new lending program will buy securities backed by packages of auto loans, credit card loans and some small business loans. Lending in those areas hinges on the ability of banks to package those loans into securities and sell them. So the Fed’s move is critical to the ability of banks to continue to provide these loans as the economy falters.\nThe Treasury will also provide $10 billion to that program to offset any losses. All told, those three programs can lend up to $300 billion.\nThe Fed also said it will soon establish a “Main Street Business Lending Program”to support lending to small and medium-sized businesses. But it provided few details and didn’t say when that program would begin.\nThe central bank’s efforts to protect the economy could be amplified by rescue legislation moving through Congress. Senate Republicans have proposed providing roughly $500 billion to the Treasury Department that it could use to then backstop more lending by the Fed.\nMany economists say that whatever financial support Congress eventually provides will likely be even more important than the Fed’s intervention. And they warn that such fiscal help needs to come soon.\n“It is good to work with Treasury to help keep credit flowing but not a substitute for fiscal stimulus,” said Joseph Gagnon, a former Fed economist who is now senior fellow at the Peterson Institute for International Economics. “Let’s hope Congress passes something quickly.”"},"5":{"tilte":"\n\t\t\tPG&E pleads guilty in Butte County fatal fire case\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/23\/pge-pleads-guilty-criminal-charges-fatal-2018-camp-fire-butte-county-wildfire\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/SJM-L-PULGAPGE-1113-6-1.jpg?w=542","discription":"\nBay Area News Group\nPG&E on Monday disclosed it has pleaded guilty to scores of criminal charges arising from the deadly Camp Fire of 2018 that roared through Butte County, an inferno caused by the disgraced utility.\nUnder the agreement that PG&E reached with the state of California and the Butte County District Attorney’s Office, PG&E admitted its guilt in the Camp Fire, which caused 85 fatalities, according to a regulatory filing by PG&E with the Securities and Exchange Commission.\n“Subject to the terms and conditions of the Agreement, the utility has agreed to plead guilty to 84 counts of involuntary manslaughter and one count of unlawfully causing a fire,” PG&E stated in the SEC filing."},"6":{"tilte":"\n\t\t\tLAUSD to extend school closures through May, says Beutner, amid coronavirus spread\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/23\/lausd-to-extend-school-closures-through-may-says-beutner-amid-coronavirus-spread\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/LDN-L-VIRUS-LAUSD-0314-DM-08-2.jpg?w=620","discription":"\nLos Angeles Unified School District Supt. Austin Beutner announced Monday that schools will remain closed through May 1, following school closures across California last week to help hamper spread of the coronavirus outbreak.\nSince the closures, LAUSD has prioritized \n“I wish I could tell you it will all be back to normal sometime soon but it does not look like that will be the case,” said Beutner in a statement. “This past week marks the start of a new chapter for all who are part of our school community. Students are learning in different ways, teachers are teaching in different ways and families are struggling to support their children in their studies while balancing other responsibilities.”\nBeutner’s announcement comes after L.A. County Superintendent of Schools Debra Duardo \nThe superintendent will be delivering further remarks in a press briefing at 11 a.m."},"7":{"tilte":"\n\t\t\tWith distance learning off to a wobbly start, LAUSD calls out for help\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/19\/with-distance-learning-off-to-a-wobbly-start-lausd-calls-out-for-help\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/LDN-L-VIRUS-LAUSD-0320-01-1.jpeg?w=467","discription":"\nIn homes across Los Angeles, the new coronavirus pandemic has many parents clambering to facilitate home learning for their children while they balance work or newfound unemployment, but it hasn’t been smooth-going.\nJust days after teachers were directed to send students home with two weeks of schoolwork, some are asking for patience from families as they help students log in to learning management platforms or crack video conferencing tools.\nLAUSD employees Kimberly Alegria, Marcela Navarrete and Citlali Nava drop meals in the back of a pickup truck at the LAUSD ’grab and go’ center at Van Nuys High School on Wednesday, March 18, 2020. (Photo by Sarah Reingewirtz, Pasadena Star-News\/SCNG)\n\nMeals at an LAUSD’s ’grab and go’ center at Van Nuys High School on Wednesday, March 18, 2020. (Photo by Sarah Reingewirtz, Pasadena Star-News\/SCNG)\n\nZasha Salazar, 15, and her brother Andrew, 12, pick up meals at an LAUSD’s ’grab and go’ center at Van Nuys High School on Wednesday, March 18, 2020. (Photo by Sarah Reingewirtz, Pasadena Star-News\/SCNG)\n\nRed Cross volunteer Sharon Kang and LAUSD employees Kimberly Alegria and Citlali Nava bring meals to the back of a vehicle at the LAUSD ’grab and go’ center at Van Nuys High School on Wednesday, March 18, 2020. (Photo by Sarah Reingewirtz, Pasadena Star-News\/SCNG)\n\nCarlos Garcia’s children look out the back of their vehicle after receiving meals from the LAUSD ’grab and go’ center at Van Nuys High School on Wednesday, March 18, 2020. (Photo by Sarah Reingewirtz, Pasadena Star-News\/SCNG)\n\nRed Cross volunteers and LAUSD employees hand out meals at an LAUSD’s ’grab and go’ center at Van Nuys High School on Wednesday, March 18, 2020. (Photo by Sarah Reingewirtz, Pasadena Star-News\/SCNG)\n\nMaria Aldaco and her children Zasha Salazar, 15, and Andrew Salazar, 12, pick up meals at an LAUSD’s ’grab and go’ center at Van Nuys High School on Wednesday, March 18, 2020. (Photo by Sarah Reingewirtz, Pasadena Star-News\/SCNG)\n\nMeals at an LAUSD’s ’grab and go’ center at Van Nuys High School on Wednesday, March 18, 2020. (Photo by Sarah Reingewirtz, Pasadena Star-News\/SCNG)\n\nSince \nSuperintendent Austin Beutner, meanwhile, launched a district charity to reach out to private donors and foundations with an appeal to help its most vulnerable students.\n“We serve a high-needs population, and part of being able to serve them in these extraordinary times is finding the resources one needs to do that,” Beutner said Thursday about the new fund, called L.A. Students Most in Need, which now has a \n“I wound up in a conversation with a couple of foundations, including Pritzker last weekend, and he said, ‘We’d like to help.’ This crisis has presented a unique opportunity for folks like Tony Pritzker (heir to the Hyatt Hotel fortune) to step up and say, ‘Hey, we do care about public education.’”\nDonors thus far include the Anthony and Jeanne Pritzker Family Foundation, the Ballmer Group and Richard Lovett, president of Creative Artists Agency, at $250,000 each. Actor Matthew McConaughey and the Creative Artists Agency also have committed to contribute.\nBeutner, who has long talked about the dearth of philanthropic involvement at LAUSD despite being home to a city with such high concentration of wealth, said the funds will be used for daily meal distribution and to provide digital devices and other resources for \nL.A. Unified, where 80% of the 600,000 students are low-income, is certainly a district serving families in need as crisis hits. Some 17,000 of its students are homeless and 24,000 have moderate to severe disabilities, according to district figures.\nBetween Wednesday and Thursday at \nThe few past days have seen colossal developments in the future of California schools, including a \nSuperintendent Beutner said he will issue an update on closures and distance learning efforts on Monday. Meanwhile, amid state- and county-ordered “Stay at Home” directives issued Thursday, all 60 Grab and Go Food Centers operated by Los Angeles Unified will be open on Friday, March 20. The orders allow essential services like food centers to remain open.\nBusinesses have stepped up to provide broadband access and public programming for students on television, yet many educators have described the current distance learning situation as inconsistent and woefully inadequate as they confront a steep online instruction learning curve.\n“It is a disaster for everyone including, us, teachers,” said Nancy Madrid, a teacher at Vinedale College Preparatory Academy in Sun Valley, in a post to other teachers and parents on Facebook. “It’s only the first week. Kids also need to adjust as do we. I am zooming with my students and is not ideal. We are still trying to figure it out. It will get better!”\nStudents are home with homework packets, and a number of laptops and tablets have gone home with students to communicate with teachers using an online learning management system called Schoology. On social media, some teachers called the transition a “disaster” and asked for understanding as many learn Zoom or Google conferencing.\nL.A. Unified has estimated 50% of its students lack digital tools, such as a computer or tablet, to participate in online curriculum, and 25% of families lack access to the internet at home. Requests to the district for the number of devices issued to students went unanswered.\nBut as cases of COVID-19 — the sometimes deadly respiratory disease caused by the new coronavirus — climb as more tests come online and job losses mount, questions about how schools are going to teach the district’s many English learners and students with disabilities have become even more pressing.\nFormer district board member David Tokofsky called the distance learning situation, not just at L.A. Unified but such neighboring districts as Burbank, Glendale and Santa Clarita, “pathetic.”\n“It’s outrageous. If you look at the AP teachers, maybe a student figured out for the teacher how to use Zoom. And some really dedicated teachers are doing their thing,” he said. “But most of them are going to say, ‘How can I teach if all my students are at home?’ They’re getting paid to stay home through June.”\nAs one of the more fortunate educators, with some 70% of her students at home using a Chromebook, Canoga Park High School teacher Shannon Higgins-Tobar has had a more positive experience. Many students are confronting irregularities between classes and teachers, she said, but distance learning is getting easier and more streamlined every day.\n“I think more and more teachers are catching on to using things like Zoom. We’re all learning from each other,” she said. “I’m not techy at all, and I’m doing it. And now that we’re going to be doing this for more than two weeks, I think we’ll see the superintendent direct admin to get us to submit some type of curriculum.”\nDawn Hamilton, a parent of a third grade student with severe disabilities at CHIME Institute, an affiliated charter school in Woodland Hills, said she knows there will be stumbling blocks as teachers, students and families figure things out. Even with distance learning slated to begin at the school next week, lesson plans sent home have been slow going.\n“Even just in the first few days, I’ve realized I need to lower my expectations and not expect myself to get as much done as the teachers and therapists were doing at school,” she said.\n“That’s going to be the big thing, slowing down and doing the best I can because we also have to take care of ourselves too.”"},"8":{"tilte":"\n\t\t\tIs surfing OK during coronavirus order to keep your distance from others? How surfers are adapting\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/21\/is-surfing-ok-during-coronavirus-order-to-keep-your-distance-from-others-how-surfers-are-adapting\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/surf_hazmat-1.jpg?w=525","discription":"\nIt’s an aquatic exercise done in the vast ocean, where you can find solitude in the sea.\nBut when a swell hits, dueling surfers paddle close to one another to battle for peaks and often crowd together on their boards waiting for the next wave to roll in.\n has many Southern California surfers wondering where that leaves them in the line up.\nOutdoor recreation such as running and hiking that can be done with safe distancing is an exception under the order, and some surfers say they can continue to catch waves safely by opting for more remote peaks far from crowds. Others say they will be keeping out of the water all together.\nIn Spain, Italy and Portugal, where the coronavirus has hit hard, surfing and going to the beach has been banned.\nSurfrider Foundation staff scientist Katie Day, who recently attended a Coronavirus Research Update webinar hosted by the Water Research Foundation,\n“The virus has been shown to remain viable and infectious, at least temporarily, in natural freshwater environments including lakes and streams,” she wrote, noting the dilution is suspected to keep the risk low. “There was no information shared on the ability of the COVID-19 virus to remain viable in saltwater, so it’s unclear if swimming at saltwater beaches elevates the risk of contracting COVID-19. However, communal spread is a serious issue so spending time at popular beaches, if in close contact to other beachgoers, will increase your risk.”\nSome risk may come from exposure to sewage pollution that could happen with sewage spills – which could also expose surfers to fecal-borne pathogens that can cause symptoms such as stomach upset; ear, eyes, nose and throat infections; as well as more severe infections, she noted.\n“Even if recreating in sewage-polluted waterways is determined not to be a transmission route for COVID-19, it could still expose you to other pathogens which could reduce your overall immune system,” she wrote.\nDr. Matthew Waxman, associate clinical professor of emergency medicine at the David Geffen School of Medicine at UCLA who also works with Los Angeles County officials, said he believes surfing falls into the recreational activities allowed – so long as surfers can successfully distance themselves in the water.\n“I’d pick a less crowded spot, ride alone in the car and make it a small family or solo trip,” he said. “Big key would be to keep the distance in the water and not being tempted to chat in the line up.”\nBasically, keep in line with the key recommendation for safe recreating: Maintain social distancing.\nWaxman noted he would be concerned, however, about surfing after the rain in general because of known coliforms such as fecal matter and other toxins that get washed in the water. It’s unknown if fecal matter would transmit the virus in salt water.\nMany surfers surveyed on social media were torn on the question of whether to surf or not to surf.\n“We are all being called to make some sacrifices for the good of many,” said Steven Barnes. “Yes surfing is an outdoor activity, but at times it can be uncontrolled by its very nature, walking on the other hand or taking a jog is far less so. If you are walking or jogging, don’t spit on the ground for someone else to walk in. Everyone just use some common sense and we’ll get through this.\n“The ocean will be there in a few weeks,” he said. “The faster we tamp this thing down the quicker we can get back to our normal lives.”\nDon Ramsey said he’s “stayin’ out of the water,” figuring there is already a lot of bacteria increasing the chance of getting sick, “and then you get the coronavirus, and you’re older like me, my chances of survival decrease.”\nSurfing is exercise for David Olive, who also finds saltwater to be beneficial for his health. “We’ve all got to breathe fresh air!”\nSo far, Stephanie Aguilar said she has found that people seem to be “giving each other space in the water and on the beach.”\n“It’s outdoors with plenty of air flowing around everyone, and with all of the stress of this situation surfing is probably a very healthy outlet for people, as long as they are giving each other space,” she said. “It’s not the same as playground equipment where you touch contaminated surfaces or being indoors with people where you could be walking through people’s coughs and sneezes.”\nEmmy Moreau said she thinks even surfers need to heed the stay at home order.\n“I interpreted the whole exercise thing as walking around your own neighborhood alone,” she said. “Surfing is also a higher risk activity and sends some to the hospital or urgent care and we don’t need that right now.”\nBut she also added a positive message for her fellow wave riders: “We’ll get through this!”"},"9":{"tilte":"\n\t\t\tNo coronavirus cases reported by LA Metro as ridership dips 60%\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/20\/no-coronavirus-cases-reported-by-la-metro-as-ridership-dips-60\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/LDN-L-VIRUS-COMMUTERS-0318-DC-1-3.jpg?w=525","discription":"\nThe Los Angeles County Metropolitan Transportation Authority vowed to continue providing bus and train service during the \n“Our focus now is to keep the system open anyway we can,” LA Metro CEO Phil Washington said Friday, March 20, in a news briefing. “We have no plans to shut down our system.”\nIn February, the system served about 30 million passengers via bus, rail and vanpools. It’s estimated that number will drop to about 12 million in March. On Monday and Tuesday, March 16-17, the agency saw about 550,000 daily boardings, a huge drop from the 1.2 million average for weekdays. Ridership was impacted throughout the week by the growing number of workers telecommuting while others avoided exposure to the virus by obeying Gov. Gavin Newsom’s \nThe agency soon will institute between 15% to 20% service reductions to reflect the declining demand, Washington said.\nTrains will begin running less frequently during peak hours. Starting Monday, March 23, B (Red), D (Purple), A (Blue), E (Expo) and L (Gold) Lines will run every 12 minutes between 6 a.m. and 6 p.m, instead of around every six to seven minutes. The C (Green) Line will run every 12 minutes from 4 a.m. to 9 a.m. Also, Metro is suspending late-night service on Fridays and Saturdays.\nWashington said the agency had no reported cases of riders contracting COVID-19. In addition, the agency has no cases among its 11,000 employees, he said.\nBut testing for the virus has been slow to non-existent, he said. Metro is not testing its employees for COVID-19 because of the shortage of tests, officials reported. If an employee, such as a bus or rail operator, feels sick, he or she is instructed to stay home.\nAll buses are equipped with plastic barriers to separate boarding riders with the bus driver. The use of the dividers is now mandatory. Drivers have been issued rubber gloves. The agency is looking into installing hand sanitizer dispensers on buses and trains.\nIn addition, cleaning crews are disinfecting seats, moving handrails on rail station escalators and ticket vending machines — any place where mass transit riders may contact, Washington said.\nUnion Station is mostly closed, except for ticketed passengers for Amtrak and Metrolink. Riders connecting to the B Line (Red), D Line (Purple) and L Line (Gold) and bus service will be guided to turnstiles by security. Anyone without station business or valid tickets will be denied entry.\nWhen asked if a bus or rail operator can deny service to someone coughing or sneezing, Jim Gallagher, chief operations officer responded: “I’m going to rely upon their judgment to enforce social distancing and other factors on their bus.”\nMany commuters have begun working from home and have stopped taking buses or trains to work. One of those is North Hollywood resident Elsie Nwankwo, a procurement coordinator for the Los Angeles Homeless Services Authority, which has offices in downtown L.A.\nDuring the past week, she rode Metro Bus 224 and the Orange Line around her neighborhood but she is changing her transit habits.\n“I’m definitely going to limit my use of public transit,” she said during an interview Friday. “I may use Uber or Lyft and probably will not take public transportation for a while.”\nShe doesn’t want to come in contact with someone who may be a carrier of the virus. “I don’t know if I have a lot of faith in other people maintaining sanitary practices,” she said. “Plus, it’s hard to practice social distancing (on a train or bus).”\nLA Metro is funding several train-line extensions using sales tax revenues from Measure R and \nUsing sales tax dollars, LA Metro is building the Regional Connector in downtown L.A., extending the Purple Line to the Westside, building the Crenshaw Line and funding construction of the Gold Line Foothill extension to Pomona, a $2.1 billion project, being built by the Foothill Gold Line Construction Authority.\nWashington and the Construction Authority said the hit to the economy won’t stop nor delay construction of ongoing projects.\n“Design and construction of the 9.1-mile, four-station, \nWhile Washington said construction projects are not affected, he added: “We all know that can change.”"},"10":{"tilte":"\n\t\t\tHow the coronavirus has made the CDC more valuable than ever\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/22\/how-the-coronavirus-has-made-the-cdc-more-valuble-than-ever\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/cdc-top-1.jpg?w=620","discription":"\nOn July 1, 1946, the Communicable Disease Center was founded. It is still called \nThe agency was established the year after World War II ended, descended from the wartime agency, Malaria Control in War Areas and was part of the United States Public Health Service.\nThe CDC began on the sixth floor of the Volunteer Building on Peachtree Street in Atlanta, hundreds of miles from Washington, D.C., because its initial mission to combat malaria in the South. During the first year of operations, 59% of CDC’s personnel were engaged in the malaria eradication effort.\nDDT, available since 1943, was the CDC’s primary weapon against malaria, and the agency’s early challenges included obtaining enough trucks, sprayers and shovels necessary to wage the war on mosquitoes. Over 6.5 million homes were sprayed. DDT was banned by the EPA in the 1970s because of its severe environmental harm.\nIn 1947, the CDC made a token payment of $10 to Emory University for 15 acres on Clifton Road in Atlanta, where its headquarters are today.\nIn recent years, the CDC has about 22,000 employees and contractors in 171 occupations.\nThe agency says 40% of its employees have master’s degrees, 25% have Ph.Ds. and 10% are medical doctors.\nA few highlights of the organization’s history include:\nThe world has changed since the COVID-19 global pandemic. Here’s what the CDC does each year to find the right flu vaccines. The first U.S. testing of a COVID-19 vaccine began in Seattle on Monday but is not expected to be ready for mass distribution in the near future.\n are from before the pandemic was declared on March 11.\nDetecting and responding to new and emerging health threats.\nTackling the biggest health problems causing death and disability for Americans.\nPutting science and advanced technology into action to prevent disease.\nPromoting healthy and safe behaviors, communities and environment.\nDeveloping leaders and training the public health workforce, including disease detectives.\nTaking the health pulse of our nation.\nGlobal Rapid Response Team mobilizations from Sept. 2015-July 2017\n \nSources: CDC, World Health Organization Photo from Wikimedia Commons"},"11":{"tilte":"\n\t\t\tRand Paul is 1st senator to report positive coronavirus test\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/22\/rand-paul-is-1st-senator-to-report-positive-test-for-virus\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/Virus_Outbreak_Congress_89066-3-1.jpg?w=620","discription":"\nWASHINGTON (AP) — Sen. Rand Paul, R-Ky., said Sunday that he had tested positive for the disease caused by the new coronavirus, becoming the first member of the Senate to report a case of COVID-19. He said in a tweet that he was feeling fine and was in quarantine.\nPaul, a doctor, said he has not had symptoms and was tested out of an abundance of caution due to his extensive travel and events. He said he was not aware of any direct contact with any infected person.\nPaul, a deficit hawk, was among eight Senate Republicans who voted against a House-passed bill last week that provided more than $100 billion to boost testing for the coronavirus and guarantee paid sick leave for millions of workers. He also was only Republican senator who opposed an earlier bill authorizing $8.3 billion for initial response to the coronavirus.\nThe senator was on Capitol Hill on Wednesday afternoon, which was the last time the Senate held floor votes, including on one of his amendments. While Senate Republicans have lunched together as a group most days since, it is unclear if Paul was among them.\nTwo House members, Reps. Mario Diaz Balart, R-Fla., and Ben McAdams, D-Utah,, have tested positive.\nThe Senate was in session Sunday seeking a bipartisan response to the pandemic. If approved, the bill would be the third measure Congress has approved in response to the coronavirus this month.\nThe White House has increasingly emphasized that testing should prioritize the elderly and health care workers who have symptoms of the virus. While most cases of COVID-19 are mild and tens of thousands of people have recovered, older people and those with underlying health problems are at higher risk for more serious problems, such as pneumonia.\n“We don’t want everyone to go out and get a test because there’s no reason for it,” President Donald Trump told reporters in a briefing Friday.\nThe Centers for Disease Control and Prevention tells people to seek testing if they have certain symptoms of the flu-like illness caused by the coronavirus – fever, cough and trouble breathing – and if they have traveled recently to an outbreak area or have been in close contact with someone who is infected. They should first be tested for the flu and other routine infections.\nThe vast majority of people recover from the new virus. According to the World Health Organization, people with mild illness recover in about two weeks, while those with more severe illness may take three to six weeks to recover."},"12":{"tilte":"\n\t\t\tJapanese Olympic Committee board member pushes for postponement of Tokyo Games\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/19\/japanese-olympic-committee-board-member-pushes-for-postponement-of-tokyo-games\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/Greece-Tokyo-Olympics-Flame-Virus-Outbreak-1.jpg?w=525","discription":"\nA Japanese Olympic Committee board member said the Tokyo Olympic Games should be postponed, saying the International Olympic Committee is putting “athletes at risk.” \n\nThe board member, Kaori Yamaguchi, an Olympic medalist in judo, said in a newspaper interview Thursday that she will push for postponement during a JOC board meeting next Friday. \n\t\t\t\t\t\t\n“Unlike other sporting events, the Olympics symbolize the ideal that sports bring about world peace,” Yamaguchi told the Nikkei newspaper. “We should not hold [the Olympics] if people across the world can’t enjoy themselves. \n\n“What I’m most scared of is that we force an opening and have people question the Olympics, asking, ‘Why only the Olympics?’” \nYamaguchi’s statement came just two days after the \n“The situation around the COVID-19 virus is also impacting the preparations for the Olympic Games Tokyo 2020, and is changing day by day,” the IOC said in the statement released after a conference call between IOC and international sports federations officials that left several of participants confused and frustrated with IOC leadership. \n\n“The IOC remains fully committed to the Olympic Games Tokyo 2020, and with more than four months to go before the Games there is no need for any drastic decisions at this stage; and any speculation at this moment would be counter-productive.” \n\nTokyo 2020 organizing committee chief Yoshiro Mori, the country’s former prime minister, last week was even more adamant that the Games would go on as scheduled. \n\n“We are not at all thinking about changing courses or plans,” Mori said at a press conference. \nDick Pound, the IOC’s longest-serving member, said in an interview last month with the Associated Press that organizers would have to make a decision by May on whether to hold the Games as scheduled. \n\nJohn Coates, an IOC member from Australia and chairman of the IOC’s coordination for the Tokyo Games told reporters this week that the IOC does not have a deadline for making decisions on whether to postpone the Games or proceed as planned. \n\nYamaguchi, echoing a growing concern among athletes and officials globally, said COVID-19 related restrictions in the U.S. and Europe have placed some athletes in a competitive disadvantage in their preparations. \n\nTwo U.S. Olympic and Paralympic Committee training centers were closed this week. \n\n“As far as I can tell from news reports coming out of the U.S. and Europe, I don’t think the situation allows for athletes to continue training as usual,” Yamaguchi said. “By asking them to train under these conditions, the IOC is opening itself up the criticism that it is not putting athletes first.” \n  \n\t\t\t"}}