{"1":{"tilte":"\n\t\t\tWhile list of coronavirus closures grows, South Coast Botanic Garden, Arboretum remain natural respites\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/21\/while-list-of-coronavirus-closures-grows-south-coast-botanic-garden-arboretum-remain-natural-respites\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/TDB-L-VIRUS-BOTANIC-0322-1-1.jpg?w=525","discription":"\nThe South Coast Botanic Garden is a remaining open amid the Corona virus outbreak. The garden is encouraging social distancing and the enjoyment of the grounds. Hand sanitizer stations have been set up and signs encourage safe enjoyment of the garden.  (Photo by Chuck Bennett, Contributing Photographer)\n\nThe South Coast Botanic Garden is a remaining open amid the Corona virus outbreak. The garden is encouraging social distancing and the enjoyment of the grounds. Hand sanitizer stations have been set up and signs encourage safe enjoyment of the garden.  (Photo by Chuck Bennett, Contributing Photographer)\n\nThe South Coast Botanic Garden is a remaining open amid the Corona virus outbreak. The garden is encouraging social distancing and the enjoyment of the grounds. Hand sanitizer stations have been set up and signs encourage safe enjoyment of the garden.  (Photo by Chuck Bennett, Contributing Photographer)\n\nThe South Coast Botanic Garden is a remaining open amid the Corona virus outbreak. The garden is encouraging social distancing and the enjoyment of the grounds. Hand sanitizer stations have been set up and signs encourage safe enjoyment of the garden.  (Photo by Chuck Bennett, Contributing Photographer)\n\nThe South Coast Botanic Garden is a remaining open amid the Corona virus outbreak. The garden is encouraging social distancing and the enjoyment of the grounds. Hand sanitizer stations have been set up and signs encourage safe enjoyment of the garden.  (Photo by Chuck Bennett, Contributing Photographer)\n\nThe South Coast Botanic Garden is a remaining open amid the Corona virus outbreak. The garden is encouraging social distancing and the enjoyment of the grounds. Hand sanitizer stations have been set up and signs encourage safe enjoyment of the garden. Nathan Reeves and his wife Sheree Reeves enjoy an afternoon under the cherry blossoms in the garden along with their two children. (Photo by Chuck Bennett, Contributing Photographer)\n\nThe South Coast Botanic Garden is a remaining open amid the Corona virus outbreak. The garden is encouraging social distancing and the enjoyment of the grounds. Hand sanitizer stations have been set up and signs encourage safe enjoyment of the garden.  (Photo by Chuck Bennett, Contributing Photographer)\n\nThe South Coast Botanic Garden is a remaining open amid the Corona virus outbreak. The garden is encouraging social distancing and the enjoyment of the grounds. Hand sanitizer stations have been set up and signs encourage safe enjoyment of the garden.  (Photo by Chuck Bennett, Contributing Photographer)\n\nThe South Coast Botanic Garden is a remaining open amid the Corona virus outbreak. The garden is encouraging social distancing and the enjoyment of the grounds. Hand sanitizer stations have been set up and signs encourage safe enjoyment of the garden.  (Photo by Chuck Bennett, Contributing Photographer)\n\nThe South Coast Botanic Garden is a remaining open amid the Corona virus outbreak. The garden is encouraging social distancing and the enjoyment of the grounds. Hand sanitizer stations have been set up and signs encourage safe enjoyment of the garden.  (Photo by Chuck Bennett, Contributing Photographer)\n\nThe South Coast Botanic Garden is a remaining open amid the Corona virus outbreak. The garden is encouraging social distancing and the enjoyment of the grounds. Hand sanitizer stations have been set up and signs encourage safe enjoyment of the garden.  (Photo by Chuck Bennett, Contributing Photographer)\n\nThe South Coast Botanic Garden is a remaining open amid the Corona virus outbreak. The garden is encouraging social distancing and the enjoyment of the grounds. Hand sanitizer stations have been set up and signs encourage safe enjoyment of the garden.  (Photo by Chuck Bennett, Contributing Photographer)\n\nThe South Coast Botanic Garden is a remaining open amid the Corona virus outbreak. The garden is encouraging social distancing and the enjoyment of the grounds. Hand sanitizer stations have been set up and signs encourage safe enjoyment of the garden.  (Photo by Chuck Bennett, Contributing Photographer)\n\nThe South Coast Botanic Garden is a remaining open amid the Corona virus outbreak. The garden is encouraging social distancing and the enjoyment of the grounds. Hand sanitizer stations have been set up and signs encourage safe enjoyment of the garden. Gardens Ranger Dan Wieten wipes down rails with sanitizer on Saturday March 21, 2020. (Photo by Chuck Bennett, Contributing Photographer)\n\nChris Mayhew, 36, stood on a vast green lawn in the South Coast Botanic Garden on Saturday, March 21, watching as his 9-year-old son and 7-year-old daughter tossed a flying disc back and forth.\nIt seemed like just another springtime day; clouds flecked the blue sky and birds trilled nearby.\nBut for Mayhew — and the many other families permeating the 35-hectare garden on the Palos Verdes Peninsula — it was far from just another day.\n“I’m really grateful they’re still open,” the North Redondo Beach resident said. “Very, very grateful.”\nWhile the list of facilities that have closed to prevent the further spread of the novel coronavirus seems to grow by the day, a few outdoor havens, including the South Coast Botanic Garden and the Los Angeles County Arboretum, have remained open.\n“We’ve had people say, ‘There’s so much we can’t do right now,’” Richard Schulhof, director of the Los Angeles County Arboretum, said, “and still being able to come here and see the beauty of the garden and enjoy the natural world — it’s been hugely important and a source of respite and renewal that they otherwise don’t have.”\nDanielle Brown, the South Coast Botanic Garden’s chief development officer, said she’s been in touch with county officials to ensure they are in compliance with every new order that comes down — including \nThe yerba santa plant is among the California native plants that will be discussed in the Medicinal & Edible Plants of the Southwest class at the Fullerton Arboretum on March 7. (File photo)\n\nA woman purchases her ticket before she can visit the Los Angeles County Arboretum in Arcadia California on March 20, 2020. (Photo by John McCoy, Contributing Photographer)\n\nThe Los Angeles County Arboretum in Arcadia California on March 20, 2020. (Photo by John McCoy, Contributing Photographer)\n\nA photographer wears a mask while photographing flowers as he visits the Los Angeles County Arboretum in Arcadia California on March 20, 2020. (Photo by John McCoy, Contributing Photographer)\n\nPeople visit the Los Angeles County Arboretum in Arcadia California on March 20, 2020. (Photo by John McCoy, Contributing Photographer)\n\nPeople visit the Los Angeles County Arboretum in Arcadia California on March 20, 2020. (Photo by John McCoy, Contributing Photographer)\n\nPeople visit the Los Angeles County Arboretum in Arcadia California on March 20, 2020. (Photo by John McCoy, Contributing Photographer)\n\nPeople visit the Los Angeles County Arboretum in Arcadia California on March 20, 2020. (Photo by John McCoy, Contributing Photographer)\n\nPeople visit the Los Angeles County Arboretum in Arcadia California on March 20, 2020. (Photo by John McCoy, Contributing Photographer)\n\n“As long as we are open space,” she said, “and we have closed our buildings to the public, we can remain a resource for visitors who are needing to get a little bit of respite, a little bit of exercise, a little bit of vitamin D.”\nThere are hints throughout the garden that business as usual has changed; visitors must buy tickets online and flash them to the front desk from at least six feet away. Rangers throughout the garden encourage family groups to keep a safe distance from each other.\nWhile schools are closed, his son has a full curriculum of online learning; his daughter has about an hour-and-a-half of digital instruction each day. Fitting all of that in, while he and his wife have both tried to work from home, has been stressful.\nBut, for the most part, the garden’s operations continue just as they always have.\nFor families like Mayhew’s, it’s one thing to rely on even as everything else in the world is changing.\n“We’ve been indoors all week, homeschooling and working,” he said. “We have two working parents and two kids out of school.”\n“Everybody’s just been cooped up,” he said.\nNathan Reeves, 37, and Sheree Reeves, 35, felt the same way.\nTheir kids are younger; a 3-year-old and an almost-2-year-old clambered around as the Lomita couple sat on a bench, framed by the garden’s blossoming cherry trees.\n“It just provides a place for the kids and family to still get together and have some sense of normalcy,” Nathan Reeves said. “They can be able to play around a little bit more and jump around.”\nSchulhof and Brown both agreed that now, perhaps more than ever, their gardens are playing a vital role for local families.\n“Nature’s not canceled,” Brown said. “So wellness can’t be canceled.”\nAs the opportunities for normalcy continue to shrink, families took advantage Saturday of what might have been just another springtime day.\nMayhew’s daughter tossed the flying disc in the direction of her brother — and far overshot her target. It landed in a nearby tree.\nHe chuckled.\n“All right, guys,” he told his kids. “Go get it.”"},"2":{"tilte":"\n\t\t\tThese maps show food centers, other aid opportunities during the coronavirus shutdown\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/21\/these-maps-show-food-centers-other-aid-opportunities-during-the-coronavirus-shutdown\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/la-oc-1.jpg?w=620","discription":"\nThe \nThey’ve made easy-to-use maps locating food services, as well as other aid opportunities for the homeless and seniors and other residents, during the current coronavirus outbreak.\nThe maps (available in English and \nLos Angeles Unified was set to have all 60 of its Grab and Go Food Centers opened by Friday, March 20.\nFood centers are among the essential services that will continue to operate amid “stay at home” orders issues by the state and local communities.\nYou can find the maps "},"3":{"tilte":"\n\t\t\tIs surfing OK during coronavirus order to keep your distance from others? How surfers are adapting\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/21\/is-surfing-ok-during-coronavirus-order-to-keep-your-distance-from-others-how-surfers-are-adapting\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/surf_hazmat-1.jpg?w=525","discription":"\nIt’s an aquatic exercise done in the vast ocean, where you can find solitude in the sea.\nBut when a swell hits, dueling surfers paddle close to one another to battle for peaks and often crowd together on their boards waiting for the next wave to roll in.\n has many Southern California surfers wondering where that leaves them in the line up.\nOutdoor recreation such as running and hiking that can be done with safe distancing is an exception under the order, and some surfers say they can continue to catch waves safely by opting for more remote peaks far from crowds. Others say they will be keeping out of the water all together.\nIn Spain, Italy and Portugal, where the coronavirus has hit hard, surfing and going to the beach has been banned.\nSurfrider Foundation staff scientist Katie Day, who recently attended a Coronavirus Research Update webinar hosted by the Water Research Foundation,\n“The virus has been shown to remain viable and infectious, at least temporarily, in natural freshwater environments including lakes and streams,” she wrote, noting the dilution is suspected to keep the risk low. “There was no information shared on the ability of the COVID-19 virus to remain viable in saltwater, so it’s unclear if swimming at saltwater beaches elevates the risk of contracting COVID-19. However, communal spread is a serious issue so spending time at popular beaches, if in close contact to other beachgoers, will increase your risk.”\nSome risk may come from exposure to sewage pollution that could happen with sewage spills – which could also expose surfers to fecal-borne pathogens that can cause symptoms such as stomach upset; ear, eyes, nose and throat infections; as well as more severe infections, she noted.\n“Even if recreating in sewage-polluted waterways is determined not to be a transmission route for COVID-19, it could still expose you to other pathogens which could reduce your overall immune system,” she wrote.\nDr. Matthew Waxman, associate clinical professor of emergency medicine at the David Geffen School of Medicine at UCLA who also works with Los Angeles County officials, said he believes surfing falls into the recreational activities allowed – so long as surfers can successfully distance themselves in the water.\n“I’d pick a less crowded spot, ride alone in the car and make it a small family or solo trip,” he said. “Big key would be to keep the distance in the water and not being tempted to chat in the line up.”\nBasically, keep in line with the key recommendation for safe recreating: Maintain social distancing.\nWaxman noted he would be concerned, however, about surfing after the rain in general because of known coliforms such as fecal matter and other toxins that get washed in the water. It’s unknown if fecal matter would transmit the virus in salt water.\nMany surfers surveyed on social media were torn on the question of whether to surf or not to surf.\n“We are all being called to make some sacrifices for the good of many,” said Steven Barnes. “Yes surfing is an outdoor activity, but at times it can be uncontrolled by its very nature, walking on the other hand or taking a jog is far less so. If you are walking or jogging, don’t spit on the ground for someone else to walk in. Everyone just use some common sense and we’ll get through this.\n“The ocean will be there in a few weeks,” he said. “The faster we tamp this thing down the quicker we can get back to our normal lives.”\nDon Ramsey said he’s “stayin’ out of the water,” figuring there is already a lot of bacteria increasing the chance of getting sick, “and then you get the coronavirus, and you’re older like me, my chances of survival decrease.”\nSurfing is exercise for David Olive, who also finds saltwater to be beneficial for his health. “We’ve all got to breathe fresh air!”\nSo far, Stephanie Aguilar said she has found that people seem to be “giving each other space in the water and on the beach.”\n“It’s outdoors with plenty of air flowing around everyone, and with all of the stress of this situation surfing is probably a very healthy outlet for people, as long as they are giving each other space,” she said. “It’s not the same as playground equipment where you touch contaminated surfaces or being indoors with people where you could be walking through people’s coughs and sneezes.”\nEmmy Moreau said she thinks even surfers need to heed the stay at home order.\n“I interpreted the whole exercise thing as walking around your own neighborhood alone,” she said. “Surfing is also a higher risk activity and sends some to the hospital or urgent care and we don’t need that right now.”\nBut she also added a positive message for her fellow wave riders: “We’ll get through this!”"},"4":{"tilte":"\n\t\t\tSylmar Courthouse to close for 3 days after positive test for coronavirus\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/22\/sylmar-courthouse-to-close-for-3-days-after-positive-test-for-coronavirus\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/RPE-L-VIRUS-TESTING-0321-WP16-3.jpg?w=525","discription":"\nSylmar Courthouse will be closed for three days, beginning Monday, March 23, after a deputy public defender tested positive for coronavirus.\n the closure Sunday, March 22, after learning Saturday that an attorney assigned to the Public Defender’s Office last week tested positive after caring for a relative who also tested positive.\nIn accordance with public health office guidelines, affected judges and staff will self-quarantine for 14 days, the court’s  press release said.\nThe Sylmar Courthouse, which handles juvenile delinquency cases exclusively in two courtrooms, will re-open Thursday.\nBoth courtrooms have been cleaned and disinfected and it will be done again on Monday.\n and suspended all civil and criminal trials. allowing only what he called “sensitive and essential functions, including restraining orders, bail and parole review, grand jury indictments and probate guardianship.\n\/\n \n "},"5":{"tilte":"\n\t\t\tOn your own in the coronavirus era? Here’s how to cope\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/22\/on-your-own-in-the-coronavirus-era-heres-how-to-cope\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/TDB-L-VIRUS-HIKE-0321-2-1.jpg?w=544","discription":"\n is not how Regina Ford, 50, was planning to spend her Friday.\nNo. As a busy elementary school principal, she’s usually got a lot going on at the end of the week: There are the assemblies. There are the youngsters she’s got to give a talking to. The “Good Morning, Ms. Ford!” greetings are bouncing off campus walls. The “tardy parties” (rewards for good attendance). There’s just the act of solving problems.\nBut on this Friday — the day after the shut down of an entire state, following major parts of the world — there was relative silence.\nFor Ford, it was an epic reminder that, aside from her faithful canine companion, a 5-year-old Maltese called Coconut, she was on her own. Living on her own in the era of the coronovirus — which shut down operations at her school, and basically everything around her in her Long Beach neighborhood.\nOf course, she does have some work to do. After her school’s normal functions shut down last week, she’s mostly alone on a campus, making sure the students in the meal program get fed, helping with community problems — all from a distance these days. Paperwork.\n“But at the end of the day, you go home, and you’re like, wow this is really scary,” she said Friday, as she spent time with Coconut. “You don’t have anyone to kind of unwind with.”\nBeing alone is one of many struggles, of course, across the world, as the pandemic spreads. And it could be worse. You could have lost your job. You may not know if you still have a job, as many businesses shut down. You could be sick, or worse. But as the late Mother Theresa is quoted as saying: “Loneliness and the feeling of being unwanted is the most terrible poverty.”\nAnd in the storm of a pandemic, there’s a lot of people on their own at the moment — distanced from other people after governments from Orange County to the Inland Empire to Los Angeles instituted their own restrictions shutting down essential businesses and facilities. And of course, Gov. Gavin Newsom’s order for California residents to stay at home sealed the deal.\nFor now? No more eating out. No more malls. Parks and playground, no. No more movie theaters. There are prohibitions on how many can gather outside a home, and couple with social distancing, even gatherings with fewer people than that can be awkward these days.\nBottom line, the seismic social shift has left millions — many of them alone — at least physically in their homes, away from the people we work and play with.\n“I miss that. That’s my energy source. I have no energy,” said Ford, echoing many.\nBut there are other reminders of just how this is affecting people, Kita S. Curry — PhD, and president of Culver City-based \nBetween her organization’s suicide prevention and disaster distress hotlines, there were two coronavirus calls in January, 15 in March and 488 up to the middle of this month, she said.\nStill … God bless Mother Theresa, but experts say even our isolation doesn’t have to be a “terrible poverty.” You can flip it around, empowering yourself, and others — even in a world where uncertainty and illness is changing hour by hour.\nSingle myself, I reached out to Curry and to Dr. Kelly Greco, assistant director for outreach and prevention services at USC’s Counseling and Mental Health Services and clinical associate professor at Keck School of Medicine’s Department of Psychiatry — for some wisdom.\nHere are themes they shared on how to protect your mental health as we go through this thing. Note: these are good for all of us, single, family, friends, lovers, moms, dads, grandmas, grandpas.\nFirst off. Underpinning much of that wisdom was the idea of control, or the lack of it.\nFord admits it. In general, she likes to be out doing stuff, and these days it’s not easy.\n“I’m anxious as all can be,” she said of her zest for being out of the house.\nA bit of a wanderer, she’d planned a trip to Paris that she’s canceled. She’s the one at the local restaurant, making conversations and meeting people.  She’s still getting used to not doing that.\nThe anxiety is there.\n“Admittedly I spent three hours hitting refresh on Twitter last night,” she said. “That’s not healthy.” She’s been trying to knock it down her screen time in the new normal.\nI can totally relate.\nBut she’s also smiling. She still relishes the chance to wave to parents and students, when she’s at the campus. She’s calling her mom every day. She’s even planning a virtual happy hour next week with friends.\nShe’s doing stuff that Curry said is healthy in the anxious moment we’re in.\n“… You’re standing up to the isolation that we need to follow by finding ways to touch people,” Curry said. “And there are other ways to touch people (even if not physical). You can touch their heart.”\nFord — like many of us on the single end of the spectrum — are working on it. But, after all that, strange to say it, we’re not alone.\n“It’s lonely. It’s scary. But I think were all frightened,” she said. People all don’t want to say it. The other day I just drove to work and I just started crying.. It’s just the reality of where we’re at.”\nI’m no expert, but I’m thinking it’s OK to cry.\n "},"6":{"tilte":"\n\t\t\tMore rain, snow expected in Southern California\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/23\/more-rain-snow-expected-in-southern-california\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/LDN-L-STORM-RAIN-RMC-01-2.jpg?w=548","discription":"\nLOS ANGELES — A storm from Canada brought showers to Southern California overnight, triggering a mudslide in Sherman Oaks and creating winter-weather conditions in the San Gabriel Mountains, authorities said Monday.\nIn addition to Monday morning’s one-and-off showers, there’s a chance of showers Monday afternoon, said National Weather Service meteorologist Todd Hall. Tuesday should be mostly dry, ahead of another system Wednesday night into Thursday. That system could drop snow on The Grapevine Thursday morning, but snow will not affect the 5 Freeway Monday, according to the NWS.\nThe mudslide in Sherman Oaks occurred sometime before 10 p.m. Sunday on the 15000 block of West Hamner Drive. Debris damaged at least one residence, but no injuries were immediately reported.\nCars splash through a rain-swollen Sherman Way near Haskell Avenue in the Van Nuys area late Sunday, March 22, 2020, as rain poured down on the San Fernando Valley. (Photo by Rick McClure\/Special to the Los Angeles Daily News)\n\nCars splash through a rain-swollen Sherman Way near Haskell Avenue in the Van Nuys area late Sunday, March 22, 2020, as rain poured down on the San Fernando Valley. (Photo by Rick McClure\/Special to the Los Angeles Daily News)\n\nLos Angeles police officers block entry to the Sepulveda Basin on Burbank Boulevard late Sunday, March 22, 2020, to keep drivers from becoming trapped in the low-lying area’s flooded roadways as rain pours down on the San Fernando Valley. (Photo by Rick McClure\/Special to the Los Angeles Daily News)\n\nLos Angeles police officers block entry to the Sepulveda Basin on Burbank Boulevard late Sunday, March 22, 2020, to keep drivers from becoming trapped in the low-lying area’s flooded roadways as rain pours down on the San Fernando Valley. (Photo by Rick McClure\/Special to the Los Angeles Daily News)\n\nLos Angeles police officers block entry to the Sepulveda Basin on Burbank Boulevard late Sunday, March 22, 2020, to keep drivers from becoming trapped in the low-lying area’s flooded roadways as rain pours down on the San Fernando Valley. (Photo by Rick McClure\/Special to the Los Angeles Daily News)\n\nLos Angeles police officers block entry to the Sepulveda Basin on Burbank Boulevard late Sunday, March 22, 2020, to keep drivers from becoming trapped in the low-lying area’s flooded roadways as rain pours down on the San Fernando Valley. (Photo by Rick McClure\/Special to the Los Angeles Daily News)\n\nLos Angeles police officers block entry to the Sepulveda Basin on Burbank Boulevard late Sunday, March 22, 2020, to keep drivers from becoming trapped in the low-lying area’s flooded roadways as rain pours down on the San Fernando Valley. (Photo by Rick McClure\/Special to the Los Angeles Daily News)\n\nLos Angeles police officers block entry to the Sepulveda Basin on Burbank Boulevard late Sunday, March 22, 2019, to keep drivers from becoming trapped in the low-lying area’s flooded roadways as rain pours down on the San Fernando Valley. (Photo by Rick McClure\/Special to the Los Angeles Daily News)\n\nCars splash through a rain-swollen Sherman Way near Haskell Avenue in the Van Nuys area late Sunday, March 22, 2020, as rain poured down on the San Fernando Valley. (Photo by Rick McClure\/Special to the Los Angeles Daily News)\n\nSnow-capped mountains create a wintry backdrop looking towards Pomona on Saturday, March 21, 2020. (Photo by Cindy Yamanaka, The Press-Enterprise\/SCNG)\n\nDrivers along the northbound 57 Freeway have a snow-capped view in Pomona on Sunday, March 22, 2020.  (Photo by Cindy Yamanaka, The Press-Enterprise\/SCNG)\n\nSnow-capped mountains create a wintery backdrop looking towards Pomona on Sunday, March 22, 2020. Pomona was partial cloudy with a pleasant 70 degree weather in the afternoon. (Photo by Cindy Yamanaka, The Press-Enterprise\/SCNG)\n\nIn the San Gabriel Mountains, a winter weather advisory, which denotes challenging traveling conditions, will be in effect until 1 p.m. Monday.\n“Moderate snow accumulations are expected over the higher elevations, which will affect the higher mountain roads,” according to an NWS statement. For now, “the snow will not affect Interstate 5.”\nAn accumulation of 6 to 10 inches of snow is expected above 6,500 feet, and less snow is expected between 4,500 and 6,500 feet, according to the statement.\nAlso expected in the mountains are southwest winds of 15 to 30 mph and 45-mph gusts, according to the NWS.\nThe heaviest snow will fall early Monday and until 1 p.m, when the winter weather advisory will expire.\n“Travel could be very difficult over higher mountain roads,” warned the NWS statement.\nThe NWS forecast rain Monday and highs of 42 on Mount Wilson; 58 in Santa Clarita; 59 in Palmdale and Lancaster; 61 in Burbank and Granada Hills; 62 in Avalon, Pasadena, North Hollywood, Van Nuys, Sherman Oaks, Studio City, Canoga Park, Winnetka, Chatsworth and Woodland Hills; 63 in San Pedro, Northridge, San Gabriel and West Covina; 64 in Long Beach, Hawthorne and Glendale; 65 in Whittier, Torrance and at LAX; and 66 in downtown LA. Tuesday and Wednesday will be mostly cloudy; and showers are forecast Thursday before two partly cloudy days amid temperatures ranging from the low 60s to the low 70s.\nPartly cloudy skies are expected in most of Orange County, though the Santa Ana Mountains will experience showers, along with highs of 41 on Santiago Peak; 51 on Ortega Highway at 2,600 feet; 57 at Fremont Canyon and Trabuco Canyon; 59 in Laguna Beach; 60 in Yorba Linda and San Clemente; 61 in Newport Beach and Mission Viejo; 62 in Anaheim; and 63 in Fullerton, Santa Ana and Irvine. Temperatures will remain about the same until a warming trend Saturday and Sunday, with showers forecast Thursday."},"7":{"tilte":"\n\t\t\tLAUSD to extend school closures through May, says Beutner, amid coronavirus spread\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/23\/lausd-to-extend-school-closures-through-may-says-beutner-amid-coronavirus-spread\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/LDN-L-VIRUS-LAUSD-0314-DM-08-2.jpg?w=620","discription":"\nLos Angeles Unified School District Supt. Austin Beutner announced Monday that schools will remain closed through May 1, following school closures across California last week to help hamper spread of the coronavirus outbreak.\nSince the closures, LAUSD has prioritized \n“I wish I could tell you it will all be back to normal sometime soon but it does not look like that will be the case,” said Beutner in a statement. “This past week marks the start of a new chapter for all who are part of our school community. Students are learning in different ways, teachers are teaching in different ways and families are struggling to support their children in their studies while balancing other responsibilities.”\nBeutner’s announcement comes after L.A. County Superintendent of Schools Debra Duardo \nThe superintendent will be delivering further remarks in a press briefing at 11 a.m."},"8":{"tilte":"\n\t\t\tSan Fernando Valley couple who survived coronavirus offers a message to America\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/20\/valley-couple-who-survived-coronavirus-offer-a-message-to-america\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/newOCR-VIRUSCOUPLE-0322-JAG-04-1.jpg?w=620","discription":"\nFarah Toutounchian, diagnosed with coronavirus, refused to be escorted to an ambulance.\nInstead, she sat in protest, cross-legged on the floor just outside a gangway to the Diamond Princess cruise ship on which she was a passenger, quarantined at the Port of Yokohama. Surrounded by people in hazmat gear, she begged for one thing: to be taken to the same hospital that was already caring for her husband, who also had novel coronavirus.\n“I was getting ready to die and I wanted to be next to my husband.”\nTwo hours later, the San Fernando Valley resident got her wish. Not only was she taken to the hospital that was treating her husband, Mohammad Toutounchian, but they were allowed to share a room.\nThat was in February. At the time, it wasn’t certain that either would live.\nOn Wednesday, March 18, they couple returned to their home in Tarzana. They’re thrilled to be alive, and to be home.\nAnd they have a hopeful message for their fellow Americans as the country embarks into uncharted waters.\nThe Toutounchians enjoy traveling, and are regulars on cruise ships. This one, which launched from Tokyo on Jan. 20, took them across Southeast Asia for two weeks.\nOn Feb. 4, they were scheduled to disembark in Yokohama and fly home. Instead, at least one of the more than 3,700 people on the ship tested positive for novel coronavirus, prompting the quarantine. Eventually, more than 700 passengers and crew members would test positive – making it at the time the largest concentration of cases outside Wuhan, China, where the virus originated.\nMohammad Toutounchian said he was among the first to be stricken.\nFarah and Mohammad Toutounchian at their home in Tarzana, CA, on Friday, Mar 20, 2020. The couple just returned from Japan after a Princess cruise that ended with them being quarantined due to a coronavirus outbreak. Both of them developed COVID-19 and spent about a month in the hospital before they heal and tested negative, twice, allowing them to return to the U.S. (Photo by Jeff Gritchen, Orange County Register\/SCNG)\n\nFarah and Mohammad Toutounchian aboard the cruise ship, the Diamond Princess, before a quarantine was ordered after a Coronavirus outbreak. (Courtesy of Farah Toutounchian)\n\nA picture of Farah and Mohammad Toutounchian from their Princess cruise last month. Both of them developed COVID-19 and spent about a month in the hospital before they healed and tested negative, twice, allowing them to return to the U.S. (Photo courtesy of the Toutounchian family)\n\nMohammad and Farah Toutounchian aboard the cruise ship, the Diamond Princess.  The Tarzana couple were among the thousands of passengers and crew members quarantined due to a coronavirus outbreak.  Both developed coronavirus and spent about a month in a Japanese hospital recovering. They returned back home on March 18, 2020 (Courtesy of Farah Toutounchian)\n\nFarah and Mohammad Toutounchian at their home in Tarzana, CA, on Friday, Mar 20, 2020. The couple just returned from Japan after a Princess cruise that ended with them being quarantined due to a coronavirus outbreak. Both of them developed COVID-19 and spent about a month in the hospital before they healed and tested negative, twice, allowing them to return to the U.S. (Photo by Jeff Gritchen, Orange County Register\/SCNG)\n\nIt began, he explains, with a pain in his legs, something he felt in his bones. He initially thought it was soreness from a walk the couple took that day on the ship. Even under quarantine, passengers were allowed to briefly leave their cabins and go out for walks, a certain number at a time, as long as they kept a distance from each other.\nBut soon, he said, he also had a headache. And a runny nose. And “something in my chest.” He wanted to cough, he said, but couldn’t. A day later, he had a fever.\nFarah gave him Tylenol and tended to him, while phoning – repeatedly – the ship’s special “fever line.”  After being ignored, she says, for a couple of days, she fired off an email to the U.S. Embassy in Tokyo:\n“I need help and medicine.”\nSoon, Japanese doctors were on the ship and testing her husband for the virus. On Feb. 11, he was taken by ambulance to the Japanese Red Cross Hospital in Tokyo.\nBut that left Farah, 61, alone just as she was beginning to feel the same, flu-like aches and fever. Already worried for her husband, she began to worry for herself.\nFour days later, on Feb. 15, she found herself on the floor, crying, fighting against the plan to take her to a hospital that was hours away from her husband.\nEven now, she becomes emotional recalling what happened next.\n“They treated me even worse than a rat in a cage,” she said.\n“I was hysterical. I was not myself. I was scared. But I was not going to go.”\nFor more than two hours, they tried to convince her, but they didn’t try to carry her away. “They were afraid of the virus,” she said.\nShe called one of their sons in the United States, who in turn contacted the U.S. Embassy. Soon, the health workers in the hazmat suits agreed to take her to the hospital where her husband was being treated.\nThe reunion was joyful. Doctors added a bed in Mohammad’s room so the couple could be together and lift each other’s spirits.\n“When I saw her,” he said, “I wasn’t worried anymore.”\nFarah took a photo and sent it to their two sons, in San Diego and Kentucky.\nBut about two hours later, she fainted. And after she came to, she fainted again.\n“They put me on an IV,” she said. “I had been under so much pressure.”\nWhile Farah was sick, Mohammad was sicker.\nHe was battling double pneumonia. For 14 days, his fever wouldn’t break. Every night, he slept on towels that would become drenched in sweat. Farah changed his towels and sheets some six or seven times every day. When the doctor told them both lungs were infected, and that he might next be placed on a ventilator to help him breathe, the couple again called their sons.\n“We went over our will,” Farah said. “We said, ‘Be strong. This is what you need to do.’ That was the moment I realized this was it.”\nBut Mohammad never needed the ventilator. And both began recovering with the help of doctors and nurses the couple can’t stop praising.\n“They were wonderful,” she said.\nDuring their last two weeks in the hospital, they were tested every 48 hours for the virus. They tested negative.\nOn Friday, March 13 – the day President Trump declared a national emergency over the coronavirus pandemic – Mohammad was removed from the government’s no fly list. On Monday, March 16, Farah got her OK to fly back home. A day later they boarded the long flight back to California.\nNow – even as California shelters in place to slow a disease that Mohammad and Farah probably won’t get again – the couple are enjoying the simple things: sleeping in their own bed, sipping tea in their own kitchen, the smell of the new rain in their own backyard.\n“We look at life completely different,” Farah said. “Coming home, and seeing the plants, knowing that spring is coming. I cherish every moment.”\nMohammad, 70, said he is thankful to his wife, who made sure he was taken to the hospital and who insisted on being reunited and staying by his side. Being together, they said, made all the difference in his healing process; in \nThe couple has been married 44 years. He’s an engineering consultant and she’s a financial adviser. They moved to the United States from Iran about 40 years ago.\nIn normal times, they would have spent Thursday, March 19, celebrating the Persian New Year with family and friends. But not this year. And that’s part of the message they want to relay to fellow Americans.\n“We have to be together,” Farah said. “And fight this virus by staying home.”\nWhile it’s been two months since they saw family and friends — people they miss — they’re OK with waiting a bit longer, until the threat of coronavirus passes. It’s all part of being careful, they say, even as they add that hysteria isn’t called for.\n“Don’t panic,” Farah said. “The minute we panic, we make the wrong decision.”\nThere’s no need to fret over toilet paper or cupboards that aren’t full. Those things, they said, will work themselves out.\n“Don’t bother hoarding all this food. We don’t need it,” Farah said\n“We have to take care of each other.”\nMohammad agreed: “There is a light at the end of this darkness.”\n“We are an example that things can get better,” Farah said. “We went through it and we made it.”\nOther Americans, she added, will make it too."},"9":{"tilte":"\n\t\t\tFor law enforcement, a shift in focus and more street patrols amid coronavirus fears\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/18\/for-law-enforcement-in-la-and-other-parts-of-southern-california-a-shift-in-focus-and-more-street-patrols-amid-coronavirus-fears\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/LDN-L-COPS-VIRUS-0318-02SR-1.jpg?w=526","discription":"\nLos Angeles police Detective Brent Hopkins spends most of his days tracking down thieves who steal cars. It involves following up on leads, talking to victims and watching security camera footage.\nHe and the other auto crimes detectives in his division have dozens of cases to investigate — burglars smashing into cars and stealing items, or taking off with the vehicle altogether.\nBut this week, he’ll trade in his suit for his old uniform, along with many of his co-workers. The last time he wore his regularly was nine years ago as a patrol officer.\n“Thankfully it still fits,” he said. “Pulling that on, and sitting in a black-and-white again is going to be a very different feeling.”\nIn the Los Angeles Police Department, hundreds of detectives are starting to deploy across the city as the department re-assigns them to help respond to public fear in the wake of the coronavirus outbreak.\nMayor Eric Garcetti \nThe city asked LAPD to conduct “high visibility patrols at strip malls, grocery stores — anywhere where there may be a large gathering of people,” said Josh Rubenstein, a police spokesman.\nTheir counterparts in the Los Angeles County Sheriff’s Department already are out there, too, in unincorporated areas and contract cities. It’s a huge shift for public safety agencies trying to keep people calm as they line up for hours at grocery stores and wholesale markets.\nAnd it means certain crimes could go without being investigated for a while.\n“We already got help — detectives from Major Crimes, Cyber Crimes, all these specialized units,” said Lt. Mark Lopez, a watch commander at the sheriff’s station in La Crescenta-Montrose. “We’re setting them up with deputies that are on patrol right now.”\nWith a reduced workforce, most of their cases are likely to sit on their desks, collecting dust for the next few weeks.\n“They’re at the bottom of a funnel — that doesn’t stop because of a virus,” said Sgt. Kurt Smith, a watch commander in LAPD’s Valley Traffic Division, which investigates deadly crashes and hit-and-runs in the San Fernando Valley.\nPublic agencies across the country \nMost have noted there has not been an increase in reported crimes as millions stay home. At a city council meeting on Tuesday, LAPD Chief Michel Moore said both violent and property crimes were down around the city, though he noted he didn’t know whether that was because of recent rains, or the effects of the virus.\nBut LAPD officials and others have said they just want to do what they can to try to quell public fear amid the outbreak.\n“We’ve had sparse incidents throughout the entire region, that are not medical calls,” Rubenstein said. “We’re just trying to provide a sense of security out there.”\nOnly area detectives in LAPD were reassigned — specialized units were not included in the order. That means the department’s homicide detectives were off limits.\nA watch commander in LAPD’s Topanga Division said Monday that “95 percent of our detectives are out in the field right now,” headed to the Westfield Topanga Mall and other shopping centers in the area. He said that meant around 16 to 18 additional officers in uniform.\nLopez said Monday morning, four detectives from different units were out patrolling the Crescenta Valley, tagging along with patrolling officers on eight-hour shifts.\nEven though its probably been a while, most detectives spent years as beat cops before shifting to a more specialized assignment; Lopez said it wouldn’t be long for most of them to remember their old habits.\n“All their instincts will come back to them,” Lopez said.\nSheriff’s deputies in Orange County have been given the heads up about the possibility of a similar directive.\n“If you’re patrol trained then you should be patrol ready with your uniform,” Orange County Sheriff’s Department spokeswoman Carrie Braun said.\nTo date the agency, which services most of south Orange County and unincorporated areas, hasn’t put out any additional patrols but said they are prepared for the possibility at a moment’s notice.\n“Should we call you, you have to be ready,” Braun said.\nAt the Anaheim Police Department, a similar plan exists, though Sgt. Shane Carringer said it’s one that is perpetually in place for major incidents.\n“We have a strategy to allocate resources where they’re needed,” he said. “It’s not out of the ordinary for us.”\nOfficers have also been told to do more patrolling of shopping centers and grocery stores, where crowds have begun to gather since the virus scare but so far no significant ones have been reported.\nWith fewer cases than L.A. and Orange County, most Inland Empire law enforcement agencies haven’t needed to redeploy officers yet.\nBesides requiring its officers to take precautions while out in the field, the San Bernardino Police Department hasn’t dedicated any of its specialized officers for patrol duties, said Sgt. John Echevarria, a police spokesman.\nWith some court systems closed, that’s freeing up deputies acting as bailiffs and transport for inmates to head out to neighborhoods or help in other areas instead.\nThe court schedule in San Bernardino County was shortened this week, so deputies assigned to courtrooms are being sent out “for extra retail patrol at grocery stores, gun stores, and any impacted retail facility,” said Jodi Miller, a sheriff’s spokeswoman.\nAnd the transportation deputies were reassigned to county jails, she said.\nLike many others, however, Hopkins, the Wilshire auto crime detective, has to put his regular work on hold for a virus that doesn’t care about the thieves stealing wallets, purses, phones and cars.\n“Right now I can’t handle the guy who got his windshield smashed and his tires slashed,” he said.\n“I can’t handle the all the dozens of people who got their cars broken into and had their property taken — we have to focus on the emergency that’s confronting all of us right now.”"},"10":{"tilte":"\n\t\t\tDrives aim to keep historic LA restaurants alive during coronavirus outbreak\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/19\/drives-aim-to-keep-historic-la-restaurants-alive-during-coronavirus-outbreak\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/LDN-L-VIRUS-RESTAURANTS-006-0320-1.jpg?w=524","discription":"\nWith restaurants limited to takeout service or shut down completely by the coronavirus outbreak, a drive has been launched to keep some of Los Angeles’ legendary eateries from fading away.\nKnown as 1933 Group, the team operates about a dozen themed bars and restaurants in Los Angeles, including the barrel-shaped bar Idle Hour in North Hollywood, Harlowe in West Hollywood, Highland Park Bowl and the Formosa Cafe in West Hollywood.\nThe Formosa Cafe is open for takeout and pick up only in West Hollywood, Thursday, March 19, 2020.   (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nThe Formosa Cafe is open for takeout and pick up only in West Hollywood, Thursday, March 19, 2020.   (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nOwner Dimitri Komarov at the famous Formosa Cafe in West Hollywood, Thursday, March 19, 2020.   (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nOwner Dimitri Komarov at the famous Formosa Cafe in West Hollywood, Thursday, March 19, 2020.   (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nThe Formosa Cafe is open for takeout and pick up only in West Hollywood, Thursday, March 19, 2020.   (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nOwner Dimitri Komarov at the famous Formosa Cafe in West Hollywood, Thursday, March 19, 2020.   (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nMany of them have shuttered in recent days amid strict orders implemented by Gov. Gavin Newsom and Mayor Eric Garcetti, aiming to stem the flow of deadly COVID-19.\n“We are struggling to survive,” said Dimitri Komarov, the venues’ co-owner. “The impact is dire. We’re losing our business. We have rent and expenses and bills and food vendors to pay and we have no revenue to come in.”\nFormosa Cafe has been serving only takeout meals this week. But that proved not to be enough to sustain the business that is truly propelled by its famed bar, selling highballs, martinis and beer.\n“Until they pass a law allowing to sell ‘alcohol to go,’ we can’t really do anything,” he said. “We’re selling food at Formosa but that’s it. I’m not going to sugar-coat anything. It’s awful.”\nHe added that he hoped that the government orders wouldn’t last too long.\n“If it’s two weeks, most people will be able to survive and reopen,” he said. “But if it’s longer, it’s going to be really hard.”\nTo help offset the lost revenue, the group enrolled in \nThe program is designed to help restaurateurs — many of them are forced to make painful decisions, including laying off employees. After customers make a payment, they receive a secure link to their 1933 Group Bond by email. The link expires shortly after being downloaded.\nKomarov said the program has been brought some much-needed income.\n“We launched it two days ago and it’s been pretty good,” he said. “We are getting orders daily on the bond…It helps us with the cash flow.”\nIn recent weeks, calls for customers to support bars and restaurants by purchasing gift cards have emerged on social media.\nAn online program called Help Main Street at helpmainstreet.com rolled out this week lists a database of businesses that offer gift cards or other similar items. Customers can search nearby businesses, purchase gift cards and use them later after the virus outbreak is over.\nSo far, the 1933 Group, has sold nearly 30 bonds for all its venues.\n“It’s about getting the support form the community, so people can try to help contribute,” Komarov said. “It also helps us with the cash flow.”"},"11":{"tilte":"\n\t\t\tAnheuser-Busch to make hand sanitizer to fight coronavirus at its Van Nuys plant\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/22\/anheuser-busch-to-make-hand-sanitizer-to-fight-coronavirus-at-its-van-nuys-plant\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/LDN-L-VIRUS-BUSCH-0323-1-1.jpg?w=400","discription":"\nAnheuser-Busch, which has been making beer for 165 years, is now going to produce bottles of hand sanitizer at its Van Nuys and Baldwinsville, N.Y. facilities in addition to suds, in response to shortages spurred by the novel coronavirus pandemic.\nAs a first step, the brewery will use its mammoth supply and logistics network to produce and distribute bottles of alcohol-based skin-cleaning product to its internal teams, Cesar Vargas, U.S. Chief External Affairs Officer, Anheuser-Busch, said in an emailed statement on Sunday, March 22.\nAlso, with the help and direction of the American Red Cross, Anheuser-Busch will ship hand sanitizer to the communities where it’s needed most, Vargas wrote.\nThe CDC recommends the use of alcohol-based sanitizers with greater than 60% ethanol or 70% isopropanol as the preferred form of hand hygiene during the outbreak to prevent spread of the virus.\n“To help address COVID-19, Anheuser-Busch is focused on the health and safety of our employees and serving our communities, he said.\n“As we have in the past, we are leveraging our capabilities, our relationships and our reach to provide assistance to those in need,” Vargas wrote. “We are in this together and there is more to come.”\nThe plant moved in 1954 from Pasadena to Van Nuys.\nThe St. Louis-based company in 2015 invested $20 million to make the facility more water efficient.\nIt wasn’t always just a beer-production complex. The Van Nuys Budweiser factory was open to the public when it operated Busch Gardens starting in 1966.\nThe world-famous theme park offered boat rides, bumper cars, a monorail tour through the factory, lagoons, a waterfall, more than 1,000 rare birds and free beer.\nThe tourist attraction was winnowed down to bird shows in 1977 and finally closed to the public in 1979. August Busch III closed the theme park to make way for an expansion of the plant.\nIn recent years, the plant has offered some scheduled “pop up” tours, which have swiftly sold out. Recently, the company has made many upgrades to the facility including a patio and tasting room."},"12":{"tilte":"\n\t\t\tFire erupts at homeless encampment near 118 Freeway in Pacoima\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/18\/fire-erupts-at-homeless-encampment-near-118-freeway-in-pacoima\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/LDN-Z-HOMELESS-FIRE-1.jpg?w=620","discription":"\nPACOIMA — A large fire in a homeless encampment burned for about 40 minutes Wednesday morning near the 118 Freeway before firefighters extinguished the flames.\nCrews responded to the encampment just west of the freeway, near Desmond Street and San Fernando Road, about 6:20 a.m., according to Margaret Stewart of the Los Angeles Fire Department.\nBecause of the location of the fire, water access was limited, and firefighters established hand lines from both the freeway and an additional access point closer to the flames, Stewart said.\nEquipment on the freeway affected traffic on the westbound lanes of the Ronald Reagan Freeway near the San Fernando Road exit and would continue to do so until firefighters cleared the scene, she said.\nA total of 41 firefighters extinguished the flames in 38 minutes and a knockdown was called at 7 a.m., she said.\nNo injuries were reported, and the cause of the fire was under investigation."}}