{"1":{"tilte":"\n\t\t\tRams free-agency analysis: Challenges grow after key losses\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/21\/rams-free-agency-analysis-challenges-grow-after-key-losses\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/LDN-L-RAMS-24-0825-1.jpg?w=521","discription":"\nNo matter how much the sports calendar is rewritten by the coronavirus pandemic, there’s no danger that the NFL season will begin this week. \n\nSo the Rams’ offseason changes shouldn’t be judged as if they’re out of time to make more. \n\t\t\t\t\t\t\n“I think it’s always interesting how we are two days into the new league year, and people think this is the team you’re going to field come September,” Rams COO Kevin Demoff said Friday, reminding writers there’s a lot of drafting, trading and free-agent signing yet to come. \n\nThe Rams’ changes during the first and most active week of free-agent signings and salary dumps should, however, be judged for where they put the team right now. \nGeneral manager Les Snead is in a hole that will be hard to climb out of after the losses of Dante Fowler, Cory Littleton and Michael Brockers to free agency and the financially motivated release of Todd Gurley and Clay Matthews. \n\nOne of the league’s better defenses has lost seven players who made at least one start in 2019, including free agent Marqui Christian (who agreed to sign with the Jets on Saturday), Nickell Robey-Coleman (whose option wasn’t picked up) and Eric Weddle (who retired). The acquisitions of Leonard Floyd and A’Shawn Robinson had better not be the last on this side of the ball. \n\nThe offense that relied on Gurley to produce league-leading yards from scrimmage and set up the passing game in the 2018 Super Bowl season is looking for a new featured back. At least there’s good news on offense: Jared Goff and the offensive line won’t be the targets of so much griping from fans, at least until after the team’s new crises are solved. \n\nHere’s a look, unit by unit, at where the Rams’ problems are – and aren’t – a short 25 weeks before the scheduled first Sunday of the 2020 season: \n\n Of team-leading tackler \nSigning former Bears first-round pick Floyd was a start on the edge; he was coached in Chicago by new Rams defensive coordinator Brandon Staley. In the middle, nobody on the current Rams roster is perfect to step in, although Troy Reeder had a good rookie year and might remember that Littleton was an undrafted free agent himself once. \n\n \nStill a solid line because Aaron Donald and a trash can would be a solid line, but it took a step back. \n\nIt’s deep enough to withstand the losses. But cutting Robey-Coleman leaves an opening at slot cornerback, Christian’s departure as a free agent takes away a valuable backup at safety and Weddle’s retirement in February takes away veteran leadership. \n\nThe basic foursome remains strong: corners Jalen Ramsey, a three-time Pro Bowl pick, and Troy Hill, the third-hardest NFL corner to complete a pass against last season (45.6% of targets), and safeties John Johnson, returning from a shoulder injury, and Taylor Rapp, the Rams’ best rookie in 2019. \n\n After \nIt would take an epic trade or draft-day genius to replace what Gurley gave the Rams at his best. More likely, whoever the Rams get, new offensive coordinator Kevin O’Connell also needs 2019 backups Darrell Henderson and Malcolm Brown to do more. \n\nThe \nThe unanswered question is who will back up Goff. Blake Bortles is a free agent and was reportedly fielding other offers but considering staying in L.A. \n\nNo changes. It remains possible the Rams will trade Brandin Cooks and the rest of his big contract. The team feels Cooks’ value goes beyond his waning statistics, though. The threat of his speed opens up those short passes that Cooper Kupp and Robert Woods turn into big gains. \n\nNo changes. This was a Rams strength down the stretch with Tyler Higbee taking over from Gerald Everett as a pass-catcher and Higbee’s and Johnny Mundt’s blocking helping to rescue the offensive line. But no team ever opened \nKicker Greg Zuerlein remains a free agent. \n\nGiven the Rams’ salary-cap pressure this offseason, it’s no shock that they took an initial step back. But did they take a step back into a pit of quicksand? \n\nThey and the Patriots are the only teams to lose three players generally rated among the top 50 free agents this offseason, without signing any. The Patriots’ losses include Tom Brady. \n\nThird in the NFC West at 9-7 and out of the playoffs last season, the Rams saw the division get tougher this week when the fourth-place Cardinals traded for wide receiver DeAndre Hopkins. \n\nIn Las Vegas, bettors raised \nThat’s now, the Rams would say. \n\n“Each year, your players change, your team changes. We knew going into this season, there would be tough choices,” Demoff said this week. “(Coach) Sean (McVay) and Les have put together an unbelievable track record of growing players, of finding ways to be competitive and field winning teams that challenge for the playoffs. I don’t think this year will be any different.” \n\nHe added: “I think the core of our team, with Jared and Aaron and Jalen and the receivers and everybody returning, is exciting. But it’s going to be a different looking team than the one that left the field in 2019. But again, I think everybody knew that was going to be the case.” \n\nIf everybody didn’t, everybody does now. \n\n LB Leonard Floyd (signed as free agent), DT A’Shawn Robinson (signed as free agent) \n\n RB Todd Gurley (released), LB Clay Matthews (released), LB Dante Fowler (signed with Falcons), LB Cory Littleton (signed with Raiders), DL Michael Brockers (signed with Ravens), S Marqui Christian (signed with Jets), CB Nickell Robey-Coleman (option not exercised) \n  \n\t\t\t"},"2":{"tilte":"\n\t\t\tChargers free-agency analysis: No Tom Brady, no problem\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/21\/chargers-free-agency-analysis-no-tom-brady-no-problem\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/LDN-L-CHARGERS-0923-850-SV-1-1.jpg?w=482","discription":"\nThe Chargers shot their shot and quickly moved on after being denied by Tom Brady. \n\nCan’t fault them for trying. Brady would have been the Chargers’ marquee attraction for their first season playing at SoFi Stadium in Inglewood. But landing Brady would have meant more than just selling tickets. Brady’s arrival would have been Super Bowl or bust. \n\t\t\t\t\t\t\nThe Chargers, however, won’t have that pressure of trying to deliver a championship in 2020. That belongs to the Tampa Bay Buccaneers, who signed Brady to a two-year, $50 million deal Friday. \n\nBut the Chargers are missing a headliner to fill 70,000 seats at the new stadium, and don’t even have their familiar star players. Quarterback Philip Rivers is with the Indianapolis Colts and running back Melvin Gordon now plays for the Denver Broncos. \nSo the best way to attract attention regardless of who’s on the roster is to win games. Once Brady turned down the Chargers, they quickly commenced Plan B. They had money to spend, but they didn’t make desperate moves. They stuck to the fallback plan. It was Brady or Tyrod Taylor, paired with a to-be-determined rookie quarterback. The Chargers have the No. 6 overall pick in next month’s draft. \n\nQuarterbacks such as Cam Newton (via trade) and Jameis Winston are available, and would certainly attract more attention than Taylor, but the Chargers don’t seem willing to mortgage their future just to sell tickets in 2020. Chasing Brady was worth the risk because they knew he would either retire in two seasons or move on to his next team while a rookie QB develops on the sidelines. \n\nIf the Chargers went after Newton, he likely would have wanted a lucrative contract extension. Winston probably wasn’t considered because of his turnover issues. With Taylor, he’s a proven winner who doesn’t turn the ball over, although he’s been criticized for playing it too safe at times. Most importantly, he’s already signed at a low cost for 2020. Taylor has one year left on his contract with a base salary of $5 million. \n\nThe rumors about Newton being an option for the Chargers quickly vanished. Reports emerged Wednesday that they’re moving forward with Taylor as the starting quarterback. \n\nThe Chargers charged forward and spent big, but wisely. Here’s a review of what the Chargers have done in the past week during the free-agency frenzy: \nTrai Turner is already planning for him and Bryan Bulaga to pave the way for many touchdowns to be scored on the right side of the field. \n\nTurner said in a conference call this week he hasn’t been told about a possible position change. He expects to remain at right guard, and why would the Chargers move him? He was named to five consecutive Pro Bowls at right guard with the Carolina Panthers before being traded to the Chargers for left tackle Russell Okung. \n\nBulaga, who agreed to a three-year, $30 million deal from the Chargers, spent the majority of his 10-year career starting at right tackle for the Green Bay Packers. He was viewed as one of the top free-agent offensive tackles. \n\nAs of now, the Chargers don’t plan on moving Turner and Bulaga, giving them one of the best right sides to an offensive line in the NFL. The duo would replace last year’s starters Sam Tevi, a right tackle, and Michael Schofield, a free-agent right guard. \n\nBut the Chargers still have plenty of uncertainty at the other three offensive-line positions. \n\nCenter Mike Pouncey hadn’t been cleared from his neck injury as of last month, but he was optimistic about continuing his career when he spoke to reporters in December. Left guards Dan Feeney and Forrest Lamp have been inconsistent the past three seasons. Lamp has rarely been on the field because of injuries. Feeney proved to be a reliable starter when he was in between Okung and Pouncey. \n\nChargers coach Anthony Lynn called Feeney an excellent center last month, so the 2017 third-round pick could be a top candidate to replace Pouncey if he’s not cleared to play. In that scenario, the Chargers would likely take their chances with Lamp staying healthy at left guard. The 2017 second-round pick has one year left on his contract. \n\nSecond-year offensive lineman Trey Pipkins would likely replace Okung at left tackle if the Chargers don’t add a veteran or draft one. But the Chargers are likely set on using their first-round pick on a quarterback, and starting a rookie left tackle from the later rounds would be risky. Veteran left tackle Jason Peters is available, but he’s 38 years old and has dealt with injuries the past few seasons. \n\nThe addition of four-time Pro Bowl cornerback Chris Harris Jr. was a surprise, but a good one for the Chargers. Harris spent nine seasons with the Denver Broncos before agreeing to a two-year, $20.25 million deal from the Chargers. \n\nOn paper, the Chargers have one of the best secondaries in the NFL, with Harris joining strong safety Derwin James and cornerbacks Casey Hayward and Desmond King. \n\nAdding Harris might cause some shuffling. Harris is regarded as a top slot cornerback, a position that currently belongs to King, an All-Pro defensive back in 2018. But King had a down 2019 season, and with Adrian Phillips heading to the New England Patriots, he could move into the versatile safety role. \n\nHarris, however, recently told the NFL Network he’s excited about playing on the outside again and being moved around on the field. Perhaps King and Harris will alternate at slot corner. It doesn’t hurt to have versatile defensive backs, but this is a make-or-break season for King, who has one year left on his rookie deal. He’ll need to return to his All-Pro ways if he wants to break the bank next offseason. \n\nIt was puzzling that the Chargers, with pass rushers Joey Bosa and Melvin Ingram, didn’t generate more than 30 sacks last season. \n\nBut the Chargers struggled to create interior pressure. Veteran nose tackle Brandon Mebane, who was released, wasn’t the same player he once was, defensive tackle Justin Jones had a strong start to 2019 before sustaining injuries, and rookie defensive tackle Jerry Tillery never found a rhythm. \n\nThe team addressed the need by adding two-time Pro Bowl nose tackle Linval Joseph, who agreed to a two-year, $17 million deal. Joseph, 31, was released by the Minnesota Vikings, but it was likely more about cap-space reasons than on-field production. Joseph is viewed as a nose tackle who creates a pass rush and defends the run. \n\nAdding Joseph will give the Chargers’ defensive line a boost, and they’ll be better in blitzing situations if James stays healthy. \n\nThe Chargers said goodbye to linebackers Thomas Davis and Jatavis Brown, but they’re not thin at the position with Drue Tranquill, Denzel Perryman, Uchenna Nwosu (more of an edge rusher) and Kyzir White. But the Chargers were missing athletic playmakers at the position last season. \n\nThe Chargers have plenty of athleticism at running back with Austin Ekeler and Justin Jackson, but are missing the power element with Gordon going to Denver and fullback Derek Watt heading to the Pittsburgh Steelers. They’re in need of a bruising back for short-yardage situations. \n\nWhoever is the Chargers’ starting quarterback – Taylor or a rookie – will have plenty of weapons with Ekeler, tight end Hunter Henry and wide receivers Keenan Allen and Mike Williams, but they’re missing a third wideout. The team auditioned Travis Benjamin, who was released, Andre Patton and Jason Moore, but never found their Tyrell Williams replacement, the former Chargers’ wide receiver who joined the Raiders last offseason. \n\nBut searching for a linebacker, running back and wide receiver can be addressed in the NFL draft, along with their biggest needs (quarterback and left tackle). \n\nThe Chargers can be called winners after one-week of free agency despite the rejection from Brady. They had two plans and stuck to them, and perhaps the second one was the better of the two. \n\nThe Chargers had more money to spend after Brady said yes to Tampa Bay. If Brady was L.A. bound, maybe only Bulaga joins him. Without the 42-year-old quarterback, the Chargers were able to pay Bulaga, Joseph, Harris and still have money left over to spend. \n\nThe Chargers’ Plan B deserves at least a B grade. If they’re able to land Alabama’s Tua Tagovailoa in next month’s draft, that offseason grade might jump to a perfect score. \n\nRT Bryan Bulaga (signed as free agent), NT Linval Joseph (signed as free agent), CB Chris Harris Jr. (signed as free agent), RG Trai Turner (trade) \n\nQB Philip Rivers (signed with Colts), RB Melvin Gordon (signed with Broncos), S Adrian Phillips (signed with Patriots), FB Derek Watt (signed with Steelers), DB Jaylen Watkins (signed with Texans), LB Thomas Davis (released), LT Russell Okung (trade), NT Brandon Mebane (released), LB Jatavis Brown (signed with Eagles), WR Travis Benjamin (released) \n\nA message from the man himself: \n— Indianapolis Colts (@Colts) \n\n\nLinval Joseph: the kinda guy we could use right now 😏 \n— Los Angeles Chargers (@Chargers) \n\n\nBryan Bulaga, Iowa \n— Los Angeles Chargers (@Chargers) \n\n"},"3":{"tilte":"\n\t\t\tWhicker: UCLA’s Zach Pettway and other baseball stars of tomorrow try to see beyond the void\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/20\/whicker-uclas-zach-pettway-and-other-baseball-stars-of-tomorrow-try-to-see-beyond-the-void\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/Pettway-Zach-UCLA-1-1.jpg?w=620","discription":"\nThe Millville Thunderbolts didn’t play baseball Friday \n\nThey had a scrimmage planned against Williamstown. Next Monday they are penciled in for another scrimmage against Washington Township, and then against Pennsville Memorial on Wednesday. April 1 is the scheduled Opening Day, against Holy Spirit. \n\t\t\t\t\t\t\nAll are redacted. New Jersey schools are closed. \n\nUnder these conditions, Mike Trout would not have played a high school inning in 2009. He had been a Team USA player, and people knew him, but he still lasted until the 25th pick of the first round of that draft. \nNow the major leagues have been paralyzed until who knows when. But so has the machinery of player procurement. \n\nThe NCAA canceled the College World Series. Nobody is playing college baseball. There is no alternate league, no barnstorming circuit. \n\nScouts are immobilized. Scouting directors keep going over the same small samples, gathered from fall ball, or the four weekends when the colleges were operational. \n\nMatt Swanson, the Angels’ scouting director, made his first pick in 2017. It was Jo Adell, the \n“This year? He wouldn’t have played,” Swanson said. “They haven’t started their season yet. We had done a lot of work on him, but he wouldn’t have had a high school season. We’re just going to try to do as good a job as we can with what we have.” \nWill Smith was the \n“Then he got into his ACC season and he just kept hitting,” recalled Marty Lamb, the Dodgers’ area scout. Smith never stopped until he was picked 32nd overall by the Dodgers, and he enters 2020, at some point, as their lead catcher. \n\nAll scouts yearn to find that player who lives under the radar. What happens when there’s no radar? \n\nIn Long Beach, Zach Pettway goes to the backyard and throws baseballs at a net. The net doesn’t hit back but, then, neither has anyone else. \n\nAs UCLA started 13-2, Pettway went 3-0. In his wins over Oklahoma State and Vanderbilt, he gave up five hits in 15 innings. In 25-2\/3 innings, Pettway struck out 29 and walked one, and the opposing batting average was .141. \n\nAnd there it will stand, apparently. Zach, a junior, works out with his brother Ryan, who pitches at Long Beach Wilson High as Zach did and is also an accomplished quarterback. Otherwise, he battles time. \n\n“It hurts a lot,” Pettway said, “but there’s a lot more important stuff going on than just baseball. I wouldn’t say it’s life-altering. I’d say it’s year-altering. \n\n“I was upset when it ended, but I’m just a 21-year-old college student. I’m sure it wasn’t just a flimsy decision. A lot of thought went into it. What hurts is that you don’t know if you’ll ever play with the same guys again. You don’t know who’s coming back or who’s leaving. That’s why it’s tough to see a season like this end.” \n\nCoach John Savage agrees. He isn’t shy about saying that the NCAA made a “knee-jerk” decision. \n\n“I look at Zach, and a guy like Holden Powell, who has 20 strikeouts in nine-2\/3 innings (and eight scoreless appearances),” Savage said. “Considering how many really good players we lost and how many guys have stepped up, it’s frustrating because I really thought we were playing as well as anybody in the country. And I’m sure a lot of teams felt that way.” \n\nNow Savage’s desk is overflowing with theoretical 2021 rosters, since the NCAA has indicated it might grant current players an extra year of eligibility. That plays havoc with an 11.7 scholarship limit, particularly when the Bruins and everyone else have already recruited. \n\nThe draft was scheduled to coincide with the College World Series in Omaha, beginning June 10. Now the CWS won’t happen and maybe the draft won’t either. That, of course, would cause a massive backlog for the colleges. \n\n“They have talked about having combines before the draft,” Lamb said. “My concern there would be the pitchers. If they haven’t thrown and all of a sudden they’re out there throwing for the scouts, the injury risk goes up. Fortunately, our crosscheckers have done their homework on a lot of guys. There’s a top pitching prospect at Tennessee (Garrett Crochet) who didn’t get to pitch. It’s just strange for everybody.” \n\nMaybe we shouldn’t have been so dissatisfied with the Old Normal. \n"},"4":{"tilte":"\n\t\t\tAlexander: With coronavirus putting sports on hold, how are we coping?\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/22\/alexander-with-sports-on-hold-how-are-we-coping\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/imageedit_4_8620754631-1.jpg?w=595","discription":"\nIt has been two weeks since the BNP Paribas tennis extravaganza in Indian Wells was canceled, and it’s been a week and a half since the rest of the world of sports essentially shut down. \n\nDoesn’t it feel like a couple of months? \n\t\t\t\t\t\t\nYou know the saying about how life comes at you fast? It has come at us in big, crashing waves in just two weeks. We went from a state of relative normalcy, albeit one where we worried about germs and hand washing and crowded venues and handshakes, to hauntingly quiet isolation (or at least a 6-foot buffer zone). \n\nSports, in this case, was the forerunner of our locked-down society. Seasons were postponed. March Madness was canceled. School sports’ springtime seasons have been scrubbed.  Sportscasts have been reduced to looking for highlights from the past, and sports channels are filling time with old – OK, classic – games from their archives. Leagues wonder when it will be safe to resume and how much of their schedules can be accommodated. \nThe worst part? The future is still so uncertain. Nobody really knows how bad this will be, or how long it will linger. And a method we historically have used to cope with tough times – losing ourselves in the games and doing so with fellow members of our communities – is no longer available. \n\n“Obviously, there are a lot of people who are anxious, rightfully so, about what’s going on,” said Christian End, a sociology professor at Cincinnati’s Xavier University. “Sports might have served as a way to maybe just give them a release for a couple of hours a day or whatever it might be. \n\n“… Sports gave you some sort of excitement from just doing your normal routine. And I think right now a lot of things are going to be routine and (will) become self-contained. Sports, in a way, could have been a means to help people break out of that.” \n\nThere are small pockets of normalcy. The NFL free agency frenzy last week provided a release of sorts, allowing fans to banter, argue and speculate. After all, the NFL hasn’t canceled a game yet. \n\n(Technically, it hasn’t scheduled any yet, either.) \nYou can still bet on horse racing, which has become the equivalent of a studio show anyway because of off-track betting. But that’s it. \n\nOtherwise, for those who care about the games and the teams – and, admittedly, for those of us who make a living either in the sports industry itself or as part of the media covering it – the prospect is of a long dry spell with no end in sight. We had hoped seasons could begin\/resume in April. Now we hope it might be May, but we have to steel ourselves for the possibility that the games might not start again until June, July or even later. \n\nThe absence of fellowship around the games is just as keenly felt. Fantasy sports are popular in large part because they give people something to talk about. Beyond that, games bring families and friends together. \n\nEnd, in our phone conversation a few days ago, recalled growing up in Wisconsin and having autumn Sunday afternoons become family time centered around one particular ritual. \n\n“We knew wherever we were, whatever we had going on, from 12 to 3 we were going to be at Mom and Dad’s watching the (Packers) game,” he said. “It fulfills some of those family needs.” \n\nNow, he said, the longtime buddies who make up his fantasy football league have talked about doing a weekly FaceTime or Zoom group call just to maintain those bonds, or even creating a video game league of their own. \n\n“People often refer to it as a social lubricant, and it is,” he said. “I can sit there and talk to you about the game and should the Bengals trade Andy Dalton and whatever it might be. And we can agree to disagree, but we’re not going to come to blows, whereas if we start talking politics or something, then we may be equally as knowledgeable about it but it seems like there’s greater potential for conflict. \n\n“I think it is going to be interesting to see how that plays out. But I do think … another consequence is that people will say, ‘Well, why the heck have I been so worried about sports over time. This has been occupying my time. I’ve been wasting money doing it. I’m done with it.’ Kind of like what people experience when leagues go on strike and they sort of realize, ‘You know, it was nice doing something constructive with my Sunday instead of spending seven hours in front of three NFL games or whatever it might be.” \n\nOf that, I’m not so sure. People \nSo how do we cope? \n\nSports video games might satisfy those cravings in ways we hadn’t anticipated. NASCAR and IndyCar both ran simulations of their scheduled weekend events this weekend. NASCAR’s iRacing was aired on FS1, replacing what would have been the real race, and NASCAR public relations and individual teams were sending out press releases during the week as if their drivers were racing for real rather than in simulators. \n\n(The “race” itself turned out to be a fun finish, sort of weird but competitive, with Denny Hamlin nudging Dale Earnhardt Jr. out of the way to cross the finish line first.) \n\nMeanwhile, the \nThe Kings, likewise, are using the Twitch platform for their own virtual games, including one Sunday night against the Coyotes. (These wins won’t affect their lottery odds, will they?) \n\nThat'll do it! \n— LA Kings (@LAKings) \n\n\nAnd beyond the old … er, classic games running on just about every sports network, YouTube has a huge supply of full game broadcasts from the past. (Pro tip: Check out \nHopefully, you’ll find something similar to at least make the stay-at-home mandate a bit more bearable. And feel free to email me and let me know your own method for coping. \n  \n\t\t\t"},"5":{"tilte":"\n\t\t\tSaugus High senior athletes cope with coronavirus pandemic, shooting\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/22\/saugus-high-senior-athletes-cope-with-coronavirus-pandemic-shooting\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/LDN-L-SAUGUS-TRACK-001-0324-1.jpg?w=525","discription":"\nWhat are kids to supposed do when even their new normal is derailed, and their go-to outlets and social support systems taken away, too? \n\nAround the country, \nOn Nov. 14, Gracie Muehlberger, 15, and Dominic Michael Blackwell, 14, were killed on campus when a fellow student at the school pulled a .45-caliber pistol out of a backpack and went on a shooting rampage in the quad. Three other students were injured. Sixteen-year-old Nathan Berhow, the boy identified by authorities as the shooter, then shot himself. He died the following day. \n\nWhen students returned to school two weeks later, several spoke of a desire to return to some semblance of normalcy. \nFor 400-meter specialist Heaven Sanchez, that meant putting in the miles with the school’s other runners. “That structure was helpful after November,” she said, “because even though things were really crazy and everyone was super sad, we had our teammates and running.” \n\nFor Dallas Andrews and her teammates, it meant picking up a softball. “That took our mind off of everything that happened,” she said. “And we can’t do that anymore.” \n\nNo, because with the coronavirus spreading last week, the William S. Hart Union School District – like so many throughout the nation and beyond – announced it was closing its schools and curtailing extracurricular activities. \n\nFor Saugus students – who have begun engaging in “distance learning” online, apart from one another as an existential crisis envelopes the world around them – their campus’ closure began March 16 and was scheduled to last for at least three weeks. On Friday, word came that the closure will last until at least May 4. \n\nThe district also previously announced cancellations of sports activities until April 30 – a week before the CIF playoffs were set to begin, which in effect scrapped the spring sports calendar. \nThen, on Tuesday, March 17, Gov. Gavin Newsom made even those projections seem conservative when he warned that most of the state’s \n“To think I just walked out of school on Friday last week and that was the last time possibly, I don’t think I’m ready for that,” said Tyler Nilson, a senior middle-distance and distance runner whose plans to pursue medicine in college are stoking a keen interest in monitoring the coronavirus outbreak. \n\n“It’s really difficult,” said Mackenzie Plasschaert, a senior whose competitive cheer competition calendar was wiped out. “Knowing it could’ve been over before I knew it.” \n\nWhen the decision came down – just a few days after a bomb threat caused a campus lockdown that “brought back those traumatic memories,” senior Timothy Angelo said – members of the track and field team were worried whether their meet at Canyon High and the next day’s invitational at Redondo Union High might be canceled. But they thought they might be rained out, not that those meets, and then all the rest, would be canceled because of the pandemic. \n\nDistance runner Tyler Lentz was on campus when he got the news. \n\n“I tried to focus on class, but all I could think about was track,” said Lentz, who was thrilled to finally be healthy this season after battling injuries for the past two years. “I’d been envisioning in my mind how I was gonna race, the times I was going to get – and all of a sudden, to be told you can’t do that, it was a shock. I was still thinking, ‘Is this a prank?’ in the back of my mind. Obviously, I knew it was real, but it was hard for me to focus that day. My mind was just on running.” \n\n“It was just very surreal,” said Hailey Rutter, who’d hoped setting new personal records on the track would help fortify her scholarship at Sacramento State. “Just crazy.” \n\nSanta Clarita Valley’s Hart School District cancels athletics until April 30, essentially ending all spring athletics for Foothill League schools. \n\nAlso, some reaction from SCV baseball players.  \n— Tarek Fattal (@Tarek_Fattal) \n\n\nMauricio Guardado, a senior catcher on the baseball team, said he was doing some extra hitting at home in his garage when he got word his season was over: “I couldn’t finish getting work in, I was so sick to my stomach,” he said. \n\nAnd then came the text messages and phone calls: “To have the younger guys reach out to you,” Guardado said, “and tell you how blessed they were to play with you, it really hit home.” \n\nThe softball team gathered for an emotional meeting with their coach, Julie Archer, who confirmed all the social media rumors, giving stark credence to the familiar cliche: \nIt all made the softball team’s 7-6 loss on an international tiebreaker, in likely its final game March 7, sting so much more, shortstop Libbie McMahan said. \n\n“If that is my last game, it’s a disappointment,” said McMahan, who’s finished a 750-piece puzzle since she’s been trapped inside, social distancing and missing her teammates badly. “I’m praying we get to play again.” \n\nMembers of the track team are hoping against hope, too, and continuing to train on their own, either individually or in groups of three or fewer. “It helps our sanity,” said Sanchez, whose previously overflowing plate, which included school, track and her job at Petco – yes, shoppers have been buying a lot of pet food – now feels practically empty. \n\n“Regardless of how people will be prepared, mentally or physically, for another meet, it would be a really, really meaningful moment for everyone,” Nilson said. “To get to say goodbye to that four-year period of our life that’s taken up so much time and so much of our hearts.” \n\nIt isn’t only sports these seniors will miss. They’ve been told prom is off, and a graduation ceremony feels tenuous. \n\nThose traditions were all the more meaningful considering what a “ride and a half” this fractured school year has endured, Hayden Trowbridge said. \n\n“It’s been a difficult year, and we’ve already had to compromise a lot of things,” Nilson said. “To have to compromise even more of that now, we’ve given up a lot of our high school experience. I want prom, and graduation and grad night and that last week of school, to be able to say goodbye and sign yearbooks and go through all those senior rituals. \n\n“But I’m sure we’ll be able to find ways to make due and come up with our own makeshift rituals.” \n\nThey’ll get through it. They know they can. If anything, that’s what this difficult year taught this 2020 Centurions class. \n\n“I want people to understand that in no way, shape or form are we trying to trying to use whatever has happened at Saugus – with the shooting and the coronavirus – to victimize ourselves,” said Trowbridge, one of only two seniors on the baseball team who’d had the chance to play varsity ball before this season. \n\n“We’re not seeing it as something happening to us, but something happening for us – life lessons that will help us become better people, better humans,” he continued. “We have had a really tough year, but this isn’t the worst year of my life. I’ve had opportunities to connect with people, of having real, authentic, genuine human relationships. \n\n“We, as teenagers, have been introduced to the unfortunate circumstances of life way before we were supposed to be, but regardless, we’re persevering as a community. That’s what I would like people to know.” \n\nHope that high school sports will resume soon is fading as coronavirus shutdown expands \n— Fred J. Robledo (@SGVNSports) \n\n\nTim Haddock, the parent of a Saugus High School student, wonders if students will ever have a sense of normalcy again after a shooting that killed 2 classmates and injured 3 others: “Sometimes it feels like picking up the pieces is damn near impossible.” \n— Moms Demand Action (@MomsDemand) \n\n"},"6":{"tilte":"\n\t\t\tBREAKING NEWS: Asian, Australian Olympic officials expect Tokyo Games to be moved to 2021\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/22\/ioc-will-have-a-decision-on-tokyo-olympics-in-four-weeks-cancellation-not-on-the-agenda\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/Switzerland-IOC-Olympics-1.jpg?w=525","discription":"\nAsian and Australian Olympic committee officials expect the International Olympic Committee to postpone the Tokyo Olympic Games to 2021 with a formal announcement coming as soon as early this week, the Southern California News Group has learned. \n\nOfficials from the national Olympic committees for several Asian countries and Australia pushed International Olympic Committee officials to postpone the Games, scheduled for July 24-August 9, to 2021 during a series of calls with IOC officials and Tokyo organizers Sunday (Monday in Asia), according to a source familiar with the discussions. \n\t\t\t\t\t\t\nThe likelihood that the Olympic Games would not take place as scheduled for the first time in 80 years emerged just hours after the IOC earlier Sunday set a four-week deadline to decide on whether to postpone the 2020 Tokyo Olympics as the organization scrambled to address mounting global criticism that it has been insensitive to safety concerns related to the COVID-19 pandemic. \n\nWhile stressing publicly that cancelling the 2020 Games is not an option, IOC, after weeks of insisting the Tokyo Olympics would open as scheduled, began extensive discussions over the weekend Japanese organizers and government officials, international sports federations, and corporate and broadcast sponsors about the viability of postponing the Games to October or 2021 or even 2022. \nAgainst the backdrop of the IOC announcement and international pressure, Japanese prime minister Shinzo Abe acknowledged for the first time that postponing the Games could be “inevitable.” \n\nAbe told Parliament the government and organizers remain committed to hosting “complete” Games but added “”If that becomes difficult, in light of considering athletes first, it may become inevitable that we make a decision to postpone.” \n\nSignaling a major shift in the IOC’s position from only hours earlier, the organization’s president Thomas Bach wrote in a letter to athletes Sunday, has “been thinking in different scenarios and are adapting them almost day by day.” \n\nThose scenarios continued to change with rapid speed through Sunday in Europe and North America, Monday morning in Asia. \n\nThe Canadian Olympic Committee announced Sunday night that it would not send a team to the Tokyo if the Olympics were held this summer. \n“This is not solely about athlete health — it is about public health,”  the COC said in a statement. \n\nThe Australian Olympic Committee, briefed on the IOC’s expected decision to postpone the Games until 2021, told its athletes to prepare for a Games in summer of 2021. \n\nThe AOC executive board during a teleconference Monday morning unanimously agreed that “an Australian Team could not be assembled in the changing circumstances at home and abroad.” \n\n“We have athletes based overseas, training at central locations around Australia as teams and managing their own programs. With travel and other restrictions this becomes an untenable situation,” AOC chief executive Matt Carroll said in a statement. “The IOC had adopted the key principles of putting athlete health first and ensuring it acted in their best interests and the interests of sport. This decision reflects those principles. \n\n“We are now in a position where we can plan with greater certainty.” \n\nNational Olympic committee officials for several Asian counties Monday morning (Asian time, Sunday evening the U.S.) began pushing IOC and Japanese officials hard to postpone the Games to 2021, according to a person familiar with the discussions. \n\nA number of Asian NOC officials have privately expressed concerns about proceeding with the Games as scheduled with the possibility of the World Health Organization not designating several global regions, including Japan, clear of the virus until well after the Games’ scheduled dates, according to the person. \n\nIn addition to Australia, the NOCs in several Asian countries held conference calls Monday (Asian time) about postponing the Games with top officials for those NOCs already expressing skepticism and concern about holding the Tokyo Olympics this summer, the SCNG has learned. Some Olympic officials privately questioned whether some airline carriers would even be permitted by their governments to travel to Japan in July. \n\nInternational sports federations received an urgent message from the IOC over the weekend to check in immediately with their sport’s IOC coordinator as the organization examines qualifying and competition schedules under the three postponement options, the SCNG has also learned. \n\nInternational sports federations plans to deal with remaining qualifying issues for the Tokyo Games are due to be filed with the IOC this week. Qualification has yet to be completed for 47 percent of all athlete spots for the Olympics. Safety concerns and restrictions in some countries have not only called into question whether  qualification will resume but also prevented or limited athletes training for the Games. \n\nThe Norwegian and Brazilian Olympic committee over the weekend joined leading international health experts, track and field’s governing bodies in the U.S. and Great Britain, as well as USA Swimming and a growing list of Olympic champions and likely Olympians in calling for the IOC to postpone the Games, which are scheduled to open July 24 and run through August 9. The Paralympics are scheduled for August 25-September 6. \n\n“This crisis is bigger than even the Olympics,”  Hayley Wickenheiser, an IOC member from Canada and four-time Olympic gold medalist in ice hockey, said on Twitter. Wickenheiser competed in six Olympics—five in hockey, one in softball—and is currently attending the University of Calgary medical school. \n\n“Athletes can’t train. Attendees can’t travel plan. Sponsors and marketers can’t market with a degree of sensitivity. \n\n“I think the IOC insisting this will move ahead, with such conviction, is insensitive and irresponsible given the state of humanity.” \n\nThe likelihood of the Games being delayed gained further momentum later Sunday when World Athletics, track and field’s worldwide governing body and the Olympic movement’s most influential international federation, said it “welcomes discussions with the IOC to postpone the Tokyo 2020 Olympic Games.” \n\nWorld Athletics said in a statement that it “wrote to the IOC earlier today to relay this feedback from its Area Presidents, Council and athletes. We stand ready to work with the IOC and all sport on an alternative date.” \n\nWorld Athletics president Sebastian Coe, a two-time Olympic 1,500-meter champion, said in a letter to Bach Sunday that holding the Olympics as scheduled “is neither feasible nor desirable.” \n\n“No one wants to see the Olympic Games postponed but … we cannot hold the event at all costs, certainly not at the cost of athlete safety,” Coe wrote. “A decision on the Olympic Games may become very obvious very quickly.” \n\nJapan reported 1,055 confirmed COVID-19 cases through Sunday, up 400 from the previous day. That figure does not include 712 confirmed cases on a cruise ship moored last month off the shore of Japan. \n\n“It would be utterly irresponsible to hold the Olympics. Why? I was an ardent supporter of holding the Brazil Olympics despite Zika, but #COVID19 is a once in a century pandemic,” Georgetown law school professor Lawrence O. Gostin said on Twitter Sunday. Gostin has served on several World Health Organization panels and was a senior advisor to the United Nations Secretary General’s post-Ebola committee. \n\nPostponement would ease concerns of athletes in several countries who have been unable to train because government restrictions related to the virus or worry that they are risking their health but continuing to train in the midst of a pandemic. \n\n“There is no postponement, no cancellation. But it (the IOC) is putting us at risk,” Katerina Stefanidi, the 2016 Olympic pole vault champion from Greece, said in an interview with Reuters. \n\n“We all want Tokyo to happen but what is the Plan B if it does not happen? \n\n“Knowing about a possible option has a major effect on my training because I may be taking risks now that I would not take if I knew there was also the possibility of a Plan B.” \n\nIn the wake of such criticism, the IOC  executives shifted gears Sunday as they tried head off the latest in a series of scandals and renewed complaints that the organization is tone deaf and continues to prioritize corporate and broadcasting partnerships over athlete safety and concerns. \n\nBach acknowledged the criticism in his letter to athletes Sunday. \n\n“I think I can feel with those among you who consider the situation to be unsatisfactory,” he wrote \n\nThe IOC decision ,reached in an executive board meeting Sunday, to set a deadline for deciding on whether to postpone the Games was a significant shift from only a day earlier. \n\n“The IOC will, in full coordination and partnership with the Tokyo 2020 Organizing Committee, the Japanese authorities and the Tokyo Metropolitan Government, start detailed discussions to complete  its assessment of the rapid development of the worldwide health situation and its impact on the Olympic Games, including the scenario of postponement,” the IOC said in a statement after the executive board meeting Sunday. “The IOC is confident that it will have finalized these discussions within the next four weeks, and greatly appreciates the solidarity and partnership of the NOCs and IFs in supporting the athletes and adapting Games planning. \n\n“The IOC (executive board) emphasized that a cancellation of the Olympic Games Tokyo 2020 would not solve any of the problems or help anybody. Therefore, cancellation is not on the agenda.” \n\nThe IOC’s statement and behind the scenes scrambling came just a day after Bach pushed back against growing pressure to postpone the Games. \n\n“You can’t postpone the Olympic Games like a football match next Saturday,” Bach told a German radio network. \n\nBach, who even before the COVID-19 crisis was frequently criticized for not addressing athlete concerns, reached out to athletes in a letter Sunday. \n\nOpening the letter by saying “in this unprecedented crisis we are all united, Bach acknowledged athlete concerns about also emphasized safety “improvements” in Japan and the arrival of the Olympic flame in the host country.  . \n\n“Like you, we are very much concerned about what the COVID-19 pandemic is doing to people’s lives,” Bach wrote. “Human lives take precedence over everything, including the staging of the Games. The IOC wants to be part of the solution. Therefore we have made it our leading principle to safeguard the health of everyone involved, and to contribute to containing the virus. I would like to assure you that we will adhere to this in all our decisions concerning the Olympic Games Tokyo 2020. \n\n“What we all share, however, is tremendous uncertainty. This uncertainty rocks our nerves and raises or strengthens doubts about a positive future; it destroys hope. Some even have to fear for their very existence. This uncertainty stems from the fact that, at this moment, nobody can really make fully reliable statements about the duration of this fight against the virus. This is true for sport, science, the media, politics, and all of society. Therefore also the IOC can unfortunately not answer all your questions. This is why we are relying on the advice of a Task Force including the World Health Organization (WHO). \n\n“As successful athletes, you know that we should never give up, even if the chance to succeed appears to be very small. Our commitment to the Olympic Games Tokyo 2020 is based on this experience. It is our experience as athletes that you must always be ready to adapt to new situations. For this reason we have, as indicated before, been thinking in different scenarios and are adapting them almost day by day. \n\n“On the one hand, there are significant improvements in Japan where the people are warmly welcoming the Olympic flame. This could strengthen our confidence in our Japanese hosts that we could, with certain safety restrictions, organize Olympic Games in the country whilst respecting our principle of safeguarding the health of everyone involved. On the other hand, we have seen a dramatic increase in cases and new outbreaks of the virus in different countries on different continents. This is why we have to undertake the next step in our scenarios.” \n\nU.S. Olympic and Paralympic athletes’ advisory council chairman Han Xiao and Sarah Hirshland, USOPC CEO, said in a statement “The progress reflected in today’s IOC update to the global community is an important step in providing clarity, but our athlete community continues to face enormous ambiguity surrounding the 2020 Games in Tokyo. \n\nHaving spent countless hours communicating with IOC leadership, our peers around the world, our NGBs and the athletes we serve,” the statement continued “we know the difficult obstacles ahead and we are all appreciative that the IOC has heard our concerns and needs, and is working to address them as quickly as possible.” \n\nPostponement of the Tokyo Games would mark the sixth time the Olympic Games have not taken place as scheduled. The 1916 Games in Berlin were cancelled because of World War I. Japan was supposed to host both the 1949 Summer (Tokyo) and Winter Olympics (Sapporo) but withdrew as hosts after it invaded China in 1937. \n\nThe 1944 Summer Games in London and Winter Olympics in Cortina d’ Ampezzo were cancelled because of World War II. London hosted the 1948 Summer Olympics. The 1948 Winter Games were held in St. Moritz. \n\nPostponing the Games to 2021 or 2022 would present several scheduling obstacles for the IOC and international federations. The 2021 World Track and Field Championships are scheduled to be held August 6-11 in Eugene. Next year’s World Swimming Championships in Fukuoka, Japan are planned for a similar window–July 16-August 1–to the 2020 Games dates. The 2022 Commonwealth Games in Birmingham, England are scheduled for a similar window–July 27-August 7. The Commonwealth Games are expected to feature 19 sports and 5,000 athletes from 72 countries. \n\nThe Tokyo Games come with a $12.6 billion price tag, with the costs divided between the organizing committee, Tokyo and federal governments. The Games have attracted a reported $3 billion in domestic sponsorship and marketing deals in addition to NBC’s $1.4 billion broadcasting fee. \n\nWhile postponement will have a significant financial impact on Japan, economists have projected that cancellation would create a $75 billion hit on the Japanese economy. \n\nOrganizers are expecting to host 11,000 athletes and 4,400 para-athletes and have suited an Olympic Village with 3,000 apartments. \n\nDelaying the Tokyo Olympics to 2021 would eliminate questions over whether construction on the new track stadium in Eugene financed by Nike co-founder Phil Knight will be finished by the Olympic Trials (June 19-28)?  Oregon’s state high school association said last week the state track meet (May 29-30) was moved from its longtime home on the University of Oregon campus “due to construction timelines” with the Knight stadium project. \n  \n\t\t\t"},"7":{"tilte":"\n\t\t\tHow the Lakers have stayed engaged in the age of coronavirus\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/20\/how-the-lakers-have-stayed-engaged-in-the-age-of-coronavirus\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/basketballs-1.jpg?w=620","discription":"\n\n\nIf you have ever wanted to live the life of an NBA player, you probably are now. \n\t\t\t\t\t\t\nLeBron James is playing cards with his family. Quinn Cook is running and doing push-ups in his condo. Danny Green is working on his Spanish. \n\nWe’re all locked down (or at least we should be). And even though you might not have a wine cellar, like LeBron does, if you have wine, you probably have that in common. \nAcross the country, all of us are finding ourselves physically isolated from one another, and by now, we’d all probably like to distance ourselves from the phrase “social distancing.” But within that, it’s worth recognizing that we’re sharing the experience of being by ourselves, trying to connect to the world through social media platforms. \n\nThere was serious news on Thursday: Two unnamed Lakers players were confirmed to have tested positive for COVID-19. This too, unfortunately, is a hazard we are all facing. And with seven NBA teams already reportedly with at least one team employee with a positive test, it’s something you can expect to spread throughout the league as it spreads through the country. \n\nBut that’s not what this newsletter is about: The world better understands the threat already. It seems a little more uplifting to point out the ways in which we are all trying to navigate and endure in an unprecedented situation, and NBA players are not exempt. The Lakers in particular, under a two-week self-isolation quarantine, are as isolated as anyone in the NBA. \n\n on Thursday night, as he was losing at cards and his children danced in the background, LeBron asked, “What up, world?” Even the biggest star in the NBA finds himself wanting to connect. \n\nHere are some of the things Lakers are doing under quarantine: \n has posted multiple videos to Instagram of watching old highlights, including those from his own catalog in his high school and Heat days. He revealed during an impromptu Q&A session Thursday night a few saucy things, including that \n went on the\n spoke to Yahoo’s \n– When isn’t \n– Some quick hitters: \nWe’re all trying to get through it. Just a friendly reminder. \n\n\n\n\n\nDon’t distance yourself from these links \n"},"8":{"tilte":"\n\t\t\tCoronavirus cancels UCLA women’s rowing team’s season after one competition\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/18\/coronavirus-cancels-ucla-womens-rowing-teams-season-after-one-competition\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/0319_SPO_LDN-L-UCLA2-1.jpg?w=525","discription":"\nThe UCLA men’s and women’s basketball teams were able to complete their nonconference and regular seasons, even reaching their respective Pac-12 tournaments. Softball and baseball had played their full nonconference schedules. \n\nBut the UCLA women’s rowing team got to compete only once this season before \n“It’s very heartbreaking for the student-athletes and the coaches,” UCLA rowing coach Amy Fuller Kearney said. “They’re putting in so much and to see the season, especially for the seniors, end this way, it’s just devastating.” \n\nThere was so much left in the season that Fuller Kearney and her team were looking forward to. They had team dinners and team-bonding activities planned for next week’s spring break and had seven regattas scheduled for this season, including the Pac-12 and NCAA Championships in May. \nFuller Kearney really believed this season would have been special. \n\nNot only did they have a roster of mostly underclassmen, who were all eager to grow, but the season opener on March 7 went perfectly. \n\nThe Bruins swept all four races against San Diego State and had celebrated their four senior rowers and one senior manager in front of a huge turnout of alumni and supporters. \n\n“I’m so grateful we had that race,” said Fuller Kearney, who was in her 19th season coaching the Bruins. “I’m hoping that can be enough inspiration to get them through to next fall.” \n\nIt was so early in the rowing season that the only rankings for teams were the Collegiate Rowing Coaches Association preseason rankings, which had UCLA at No. 20. Fuller Kearney said the updated rankings, after the first week of competitions, were supposed to come out last weekend but never did. \nHer 53 rowers, including eight international student-athletes, have mostly returned to their respective homes outside of Westwood. The coach, knowing things were going to start changing fast after \nInstead of leading her team through practices and competitions, Fuller Kearney is at home with her daughter playing board games, dominoes and cards and watching movies and TV shows. She’s reached out to her team the past few days to make sure they’re processing everything OK and tries to provide answers to any questions she can. \n\n“This was the greatest group of girls,” she said. “It was an absolute pleasure to go to practice every day with these girls. … I already miss them. I really, really do. I can’t wait to get back and get going again because the energy they brought every day was inspiring.” \n  \n\t\t\t"},"9":{"tilte":"\n\t\t\tDodgers shut down training complex in Arizona\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/20\/dodgers-shut-down-training-complex-in-arizona\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/imageedit_2_7946862677-1.jpg?w=620","discription":"\nThe Dodgers have shut down their training complex in Arizona in response to the suggested precautions aimed at containing the coronavirus pandemic. \n\nOrganized workouts at the complex were shut down a week ago when Major League Baseball suspended spring training and postponed the start of the 2020 regular season. Dodgers manager Dave Roberts confirmed the complete shutdown of the facility during a radio interview on Friday. \n\t\t\t\t\t\t\nDodgers officials said the shutdown will last at least two weeks, at which point the team will re-assess the situation. A number of MLB teams have done the same. \n\n“You’re trying to be responsible and keep guys going that want to keep working and get treatment,” Roberts said on “The Dan Patrick Show”. “But I think ultimately you’ve got to be responsible and shutting down Camelback Ranch. … Taking care of the staff is the most important thing.” \nRoberts said he has been in contact with his players on a regular basis since the sport shut down last week. \n\n“Every day it’s a different group of players just to kind of catch up by way of text or call,” he said. \n\nRoberts said he is “trusting the fact that they’re going to do whatever they can to stay in shape, keep their arms in shape, their bodies in shape.” \n\n“We don’t know when this potential start date, if any, is going to happen. But I still can count on our guys,” he said. \n\nRoberts said he is still optimistic there will be a 2020 season of reasonable length, though he suspects there will have to be numerous “amendments” to scheduling and roster limits. He estimates a “two-, three-week ramp up” before games can begin “then some latitude for the roster size” to accommodate pitchers who won’t be fully stretched out. \n“Ideally, everyone wanted to get in that 162 (games) … or whatever that number,” Roberts said. “But as every day goes on, the more we learn, it’s seeming more unlikely. But I’m still holding out hope.” \n"},"10":{"tilte":"\n\t\t\tCoronavirus cut USC track season short on eve of NCAA indoor championships\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/20\/coronavirus-cut-usc-track-season-short-on-eve-of-ncaa-indoor-championships\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/0321_SPO_LDN-L-USC4-1.jpg?w=488","discription":"\nThe USC track team was going about its final practice in Albuquerque last Thursday as it prepared for the indoor national championships. That’s when the world shifted under their feet. \n\nChange had already been afoot as fears of infection from COVID-19 grew. Conferences like the ACC had already demanded their athletes return home from the event, which was supposed to be held with no spectators in attendance. The pre-meet banquet was canceled, and the coaches meeting was held online. \n\t\t\t\t\t\t\nThe Trojans had just completed their warm-ups and were about to begin practice when program director Caryl Smith Gilbert received the phone call: The indoor championships were canceled, along with every other winter and spring NCAA championship. \n\nSmith Gilbert directed her athletes over to the training table so she could break the news, but even as they made their way over they couldn’t help but hear as other teams cried out about the cancellation. \nThen the coach addressed her team, 13 members of which had traveled to Albuquerque, before they got on a chartered flight home as USC wanted the team to avoid commercial flight during the pandemic. \n\n“I just told them this is how life works. This is how things go. Your health and safety is of the utmost importance,” Smith Gilbert recalled. “They were crying. ‘I’m sorry. I hate this. Sometimes life just isn’t fair.’ “ \n\nA week later, you could still hear the pain in Smith Gilbert’s voice as she recalled the abrupt end to their season. \n\n“That might’ve been one of the hardest things I’ve ever had to do, ever, as a coach,” Smith Gilbert said. “And even more so with the reality that they canceled the outdoor championship as well, to tell especially my seniors that their season was over. I think it took us all some time to digest it. I don’t think it still has registered completely. I keep thinking maybe they’re going to reinstate it, even though I know they’re not. \n\n“It’s just really tough to swallow, knowing that they’ve been training since September.” \nSmith Gilbert, named a finalist for national women’s coach of the year for the indoor season Friday, has been told most USC seniors want to return for next track season after the NCAA announced it would grant an extra year of eligibility to spring student-athletes. \n\nThe question is exactly what the details would be surrounding that extra season. \n\nSmith Gilbert is a member of the NCAA executive board for track and field. She says there have been talks among coaches that these returning seniors shouldn’t have to take any classes next year. But she prefers to see the seniors take advantage by taking grad school courses. \n\n“That’s a great opportunity. I don’t know what the NCAA will decide,” she said. “School is always a great thing in my opinion. But there’s so many unanswered hypotheses right now, who knows what will happen.” \n\nSmith Gilbert said she’s been told there could be decisions made on the guidelines for the extra year of eligibility within the next week. \n\n“They can’t wait too long because people have things up in the air, their lives are on hold and decisions have to be made,” Smith Gilbert said. “If you’re going to apply for grad school, you need to do that. So they can’t wait too long.” \n  \n\t\t\t"},"11":{"tilte":"\n\t\t\tClippers owner Steve Ballmer donates millions during coronavirus outbreak\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/19\/clippers-owner-steve-ballmer-donates-millions-during-coronavirus-outbreak\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/LDN-L-CLIPPERS-0725-253-SV-1.jpg?w=530","discription":"\nClippers owner Steve Ballmer is pitching in to help communities weather the coronavirus outbreak, both in L.A. and elsewhere. \n\nThe Ballmer Group contributed $250,000 to the Los Angeles County Office of Education to help distribute food and resources such as diapers, formula, cleaning and medical supplies, and to provide for online\/distance learning and communications to needy students and their families, LACOE announced Thursday. \n\t\t\t\t\t\t\nThe same day, the Ballmer Group joined the Anthony and Jeanne Pritzker Family Foundation, and Richard Lovett, president of Creative Artists Agency, in contributing $250,000 apiece to kick off the L.A. Students Most in Need fundraising effort to help Los Angeles Unified School District students, the district announced. \n\nActor Matthew McConaughey and the Creative Artists Agency have been providing pro bono services to Superintendent Beutner and the district, which serves nearly 700,000 students – 80 percent of whom are from families living in poverty and reliant on the district for nutrition, counseling and health services and enrichment activities before and after school. \nOn Saturday, the Clippers also announced they were teaming with the Lakers and the NHL’s Kings, their Staples Center co-tenants, to \nLast week, Ballmer – the former Microsoft CEO who is the wealthiest owner in American sports, reportedly worth close to $53 billion, according to the \nThe Ballmer Group also has contributed to the United Way for Southeastern Michigan’s COVID-19 Community Response Fund. \n\nA big THANK YOU to \n— LACOE (@lacoeinfo) \n\n\nFund Started to Help LA Students Most in Need \n— L.A. Unified (@LASchools) \n\n\nThank you, \n— United Way SEM (@UnitedWaySEM) \n\n\nToday, we proudly join partners from philanthropy, government & business to create a COVID-19 Response Fund that will rapidly deploy resources to community-based organizations at the frontlines of the region’s outbreak. Learn more & give: \n— Seattle Foundation (@SeattleFdn) \n\n"},"12":{"tilte":"\n\t\t\tAngels add lefty reliever Ryan Buchter to 40-man roster\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/22\/angels-add-lefty-reliever-ryan-buchter-to-40-man-roster\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/GettyImages-1145962470-1.jpg?w=525","discription":"\nThe Angels added veteran reliever Ryan Buchter to their 40-man roster on Sunday, a strong indication that they plan for him to be on the roster whenever the season starts after the coronavirus crisis subsides. \n\nBuchter, 33, had not allowed a run in five innings this spring. \n\t\t\t\t\t\t\nHe has a career 2.86 ERA over parts of five major league seasons, most recently with the Oakland A’s. Buchter had to settle for a minor-league deal with the Angels just after the opening of camp, most likely because last season he struggled against right-handed hitters. The new three-batter rule reduces the value of a situational left-handed relievers. \n\nIn order to clear a spot for Buchter on the 40-man roster, the Angels designated Taylor Cole for assignment. "},"13":{"tilte":"\n\t\t\tNew Rams logo and colors set to be revealed Monday\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/20\/new-rams-logo-and-colors-set-to-be-revealed-monday\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/rams_helmets-3.jpg?w=525","discription":"\nThe Rams plan to unveil their new colors and logos on Monday. \n\nThe timing of the long-anticipated reveal was itself revealed \nDemoff invited fans to join a live stream on \n“We have loved seeing all of the creative ideas and feedback on social media throughout this process and are excited for you to continue this journey with us,” Demoff wrote. \n“Giving back to our community and inspiring Angelenos is at the heart of our organization, so it is fitting that we will showcase our new look as part of the Te”LA”thon.” \n\nDemoff wrote that anyone who donates to the telethon, proceeds of which go to the United Way of Greater Los Angeles’ Pandemic Relief Fund, will have a chance to win a Rams hat donning our new brand. \n\n“And don’t worry — it’s not the hat that you saw on social media a few weeks ago,” Demoff wrote. \n\nIt has been known for a long time that the franchise plans to unveil a new logo and new uniforms and helmets before opening the 2020 season \nWhile the colors and logos will be made public Monday, the look of the actual uniforms and helmets isn’t expected to be unveiled until later in the spring. \nSpeculation has been hot about how different that look might be from the various combinations of blue, white, yellow and gold that the Rams have sported in their decades in Los Angeles and St. Louis, and whether the iconic horns would keep their prominent place. \n\nFor a brief time two weeks ago, fans \nAt a time when the Rams were entering a difficult free-agent period, and the world had more life-and-death concerns, the feverish interest in a team logo amused some observers. \n\nSaid David Carter, a USC professor and sports business consultant who is an authority on sports marketing: “Maybe fans should do less hand-wringing and more hand-washing.” \n\nBut they can take a few minutes out on Monday. The long-awaited reveal is coming. \n"},"14":{"tilte":"\n\t\t\tPhilip Rivers: ‘I can help a team win a championship’\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/21\/philip-rivers-i-can-help-a-team-win-a-championship\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/LDN-L-CHARGERS-1216-19-KS-1.jpg?w=524","discription":"\nINDIANAPOLIS — All Philip Rivers really wanted was a chance to play one more NFL season. \n\nSo when the Indianapolis Colts gave him a shot, the eight-time Pro Bowler took it. \n\t\t\t\t\t\t\nRivers officially ended his 16-year tenure with the Chargers on Saturday by signing the $25 million deal he agreed to earlier this week. \n\n“I still love to play, I know I can play at a high level,” the 38-year-old quarterback said on a conference call, acknowledging he was ready to walk away from football if he received no offers. \n“It was one of those things where we said if there’s nothing out there, then that’s our answer. But if there’s an opportunity with a team … it ended up being with this organization and that made it that much more exciting,” he said. \n\nRivers feels he has plenty to offer even after one of his worst seasons. \n\nHe threw 23 touchdown passes, his lowest total since 2007, and 20 interceptions, matching the second-highest total of his career. While some blamed the troubles on a poor offensive line or Rivers trying to do too much to rally the Chargers late in games, others contended his skills were rapidly deteriorating. \n\nNow, with a fresh start, a strong running game and one of the league’s top offensive lines, Rivers insists he will prove the critics wrong this season. \n\n“I feel great and if I feel like I do next year then I’ll be excited to keep on going, depending on how the team feels about it,” Rivers said. “I do want to coach my oldest son (in high school). I have two sons, they’re 12 and eight, so we’ve got a little time. I don’t think you’ll see me in the Tom Brady range, but I feel good and I feel like I can help a team win a championship.” \nRivers suspected he was headed into his first foray in free agency when he tearfully told reporters at season’s end he would not quit. In February, the Chargers made it official by announcing the two sides mutually agreed to part ways. \n\nSo Rivers, his wife and their nine children moved to the family home in northwest Florida and contemplated their options. Yes, he considered starting his long-desired coaching career even as speculation swirled about potential landing spots. \n\nBut Rivers decided he just wanted to keep playing. \n\nAnd when free agency opened this week, Rivers was hopeful he could reunite with Frank Reich and Nick Sirianni, two of his former position coaches, in Indy. Reich is starting his third as the Colts’ play-calling head coach while Sirianni continues in his role as offensive coordinator. \n\n“Philip is one of the most decorated quarterbacks in the NFL and we are fortunate to add an experienced player of his caliber to our organization,” Colts general manager Chris Ballard said in a statement. “His familiarity with our coaching staff and offensive system, in addition to his experience, were attractive qualities during our evaluation process. Philip is a fierce competitor and his veteran leadership will be crucial in the continued development of our young roster.” \n\nThey’re hoping Rivers leads them to the playoffs after the Colts stumbled to a 7-9 record last season. \n\nFirst, he must beat out incumbent stater Jacoby Brissett, who struggled during the second half last season after injuring his left knee. Brissett, like Rivers, is a North Carolina State alum, but the two haven’t spoken yet this week, Rivers said. \n\nBut in the meantime, with a challenging offseason looming, Rivers wants to keep the goals simple: Meeting his new teammates, learning the offense and being ready to go whenever football resumes. \n\n“Building a friendship, building a relationship is huge and that’s really my favorite part of this game, just being a great teammate,” he said. “I love being a teammate, I want to be one of the guys and I want them to know that.” \n\nA message from the man himself: \n— Indianapolis Colts (@Colts) \n\n"},"15":{"tilte":"\n\t\t\tKings, Ducks say none of their players have coronavirus symptoms\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/18\/kings-ducks-say-none-of-their-players-have-coronavirus-symptoms\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/GettyImages-12034799-16x9-1-1.jpg?w=620","discription":"\nOne day after an Ottawa Senator became the first NHL player to test positive for the coronavirus, the Kings and Ducks each said Wednesday that none of their players had symptoms of COVID-19, but were in self-quarantine either at their in-season or off-season homes. \n\nThe teams didn’t say whether any players, coaches or staff had been tested, however. \n\t\t\t\t\t\t\nThe Kings were the last team to play against the unnamed player and his Senators teammates in a March 11 game at Staples Center, the last to be completed before the NHL suspended play indefinitely the following day. The Ducks were the second-to-last team to face Ottawa on March 10. \n\nThe league on Monday asked players to self-quarantine through March 27, announcing the restriction one day after the Centers for Disease Control recommended banning all gatherings and events of 50 people or more for the next eight weeks. \n“As of this time, no current member of our organization has demonstrated any signs of symptoms consistent with the onset of the COVID-19 virus and we will continue to monitor this on a daily basis,” the Kings said in a statement Wednesday. \n\n“Players from the Ducks have been under quarantine at their respective in- or off-season homes since the NHL’s suggested guidelines were announced,” the Ducks said in a statement. “No player in the organization has reported COVID-19 symptoms at this time. \n\n“We will continue to monitor the situation regularly.” \n\nThe Kings and Ducks were made aware of the positive test for the Ottawa player on Tuesday night, after the NHL received word directly from the Senators at about 6 p.m. (PDT). The player reportedly began to have symptoms after returning to Ottawa from Los Angeles last week. \n\nOttawa began what was scheduled to be a five-game trip with a game on March 7 against the Sharks at San Jose. The trip continued with games March 10 against the Ducks at Honda Center and the following night against the Kings at Staples Center. \nThe league suspended play March 12 and instead of heading for Chicago and St. Louis, the Senators returned to Ottawa. The team reportedly waited inside their chartered aircraft for an extended period on the LAX tarmac while their flight plans were altered. \n\nAs of Wednesday, no other Senators have tested positive for COVID-19. \n\n“The Ottawa Senators’ medical team is actively monitoring players and staff and following all appropriate and professional guidelines to help ensure the health and safety of our employees and the greater community,” the team said in a statement Wednesday. \n\n“Players are being assessed and tested under the supervision of public health authorities. All Ottawa Senators players and staff who recently traveled (to San Jose, Anaheim and Los Angeles) were instructed to self-quarantine on Saturday and do not pose a public health risk to the community.” \n  \n\t\t\t"},"16":{"tilte":"\n\t\t\tNHL tells players, staffers to ‘self-isolate’ because of coronavirus pandemic\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/13\/nhl-tells-players-staffers-to-self-isolate-because-of-coronavirus-pandemic\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/0314_SPO_LDN-L-NHL-VIRUS-1.jpg?w=525","discription":"\nWhat’s next? Now that the NHL has suspended its season because of the COVID-19 virus pandemic, the questions would appear to outnumber the answers by a wide margin as the league sought Friday to take steps to plan for whatever might come next. \n\nCommissioner Gary Bettman told players and staff members to “self-isolate” and stay away from rinks and team training facilities during the hiatus. He said in an interview with The Associated Press and NHL.com that he knew of no known cases involving the league’s players. \n\t\t\t\t\t\t\n“It was clear to me that no matter what scenario we came up with that we continued to play with, either with or without fans, it was inconceivable, certainly unlikely that we were going to get through the rest of the regular season at a minimum without somebody testing positive,” he said. \n\nIn fact, Carolina Hurricanes broadcaster John Forslund is self-quarantined at home in suburban Raleigh, North Carolina, after staying in the same hotel room in Detroit as Utah Jazz player Rudy Gobert, the first NBA player to test positive for the coronavirus. \nHurricanes videographer Zach Brame also could have been exposed after he stayed in one of three rooms the Centers for Disease Control identified after the the Jazz departed the hotel Saturday and Carolina checked in Sunday, according the Raleigh News and Observer newspaper. \n\n“It’s serious,” Forslund told the paper. “We’ve got to listen to what we’re supposed to do. And act accordingly. … Initially, we were all kind of in the same boat. And look where we are now. It’s a serious thing. You just hope and pray everybody’s going to be OK.” \n\nBettman also said he didn’t know when the league would resume play. The NBA and Major League Soccer each announced it would suspend play for 30 days. Major League Baseball canceled the remainder of spring training and the first two weeks of the season. \n\nIn addition, Bill Daly, the NHL’s deputy commissioner, said in a statement that players should remain in their team’s city for the time being. He didn’t not forbid travel if a player’s family resides in another city or if there are other unusual circumstances, however. \n\nDaly did not provide a date when players could resume working out at the team’s facility. \n“We envision there coming a time where we transition direction from ‘stay at home’ to opening club facilities to players to work out and to skate on a voluntary basis in small groups similar to what we generally see prior to the beginning of team training camps,” he said. “At this point, I’m not in a position to say when that will be. We will see how the next week or so plays out.” \n\nMeanwhile, Ducks owners Henry and Susan Samueli, who also operate Honda Center, have decided to continue pay all full- and part-time workers who were scheduled to work events while the arena is shuttered through March 31. \n\nJosh Harris and David Blitzer, the New Jersey Devils’ managing partners, also have pledged to compensate their hourly and event staff at the Prudential Center in Newark, New Jersey, while NHL games and other events are suspended. \n\nKelly Cheeseman, the Kings’ chief operating officer, said during a conference call Thursday he couldn’t provide an immediate answer as to whether AEG would continue to pay arena workers at Staples Center. He said discussions were ongoing. \n\nBettman said it would not be strictly up to the NHL as to when it resumes its season. He also didn’t rule out the possibility of playing in empty arenas and added that games would continue only when the situation is deemed to be safe enough to play again. \n\nThe league is determined to award the Stanley Cup even if it means playing in July. The league’s regular season was to conclude April 4, with the playoffs to begin four days later. The last possible day for the Stanley Cup Final was set for June 13. \n\n“That would be the goal,” Bettman said of completing the season. “Health, safety, well-being of the NHL family, especially and including our fans, is most important. If the business considerations and the money were the only thing, then we and a bunch of others would keep playing.” \n  \n\t\t\t"},"17":{"tilte":"\n\t\t\tMLS extends season postponement to May 10 due to coronavirus\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/19\/mls-extends-season-postponement-to-may-10-due-to-coronavirus\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/MLS-All-Star-Game-Soccer-2-1.jpg?w=525","discription":"\nMajor League Soccer announced in a statement Thursday it was extending the postponement of the season and has set a target return date of May 10. \n\nThe new date comes in accordance with the CDC’s recent announcement to postpone events involving more than 50 people for the next eight weeks due to the COVID-19 pandemic. \n\t\t\t\t\t\t\nThe league, according to the statement, remains focused on playing the entire 34-game regular season, which would push back the end of the regular season and move the MLS Cup into December. \n\nEach team had played two games before the league announced it was suspending play because of the coronavirus outbreak. \nThe regular season was scheduled to end Oct. 4, with the MLS Cup set for early November. \n\n“Throughout this process, MLS will continue to prioritize the safety of our fans, players, employees and partners and to coordinate with federal and local public health authorities as well as other sporting organizations,” the statement said. \n\nOn Sunday, MLS sent out a memo extending the team training moratorium through Friday. The league hasn’t announced whether that date will be further extended. \n"},"18":{"tilte":"\n\t\t\tSparks’ Sydney Wiese, WNBA colleagues flock home amid coronavirus outbreak\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/20\/sparks-sydney-wiese-wnba-colleagues-flock-home-amid-coronavirus-outbreak\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/imageedit_6_4312806335-1.jpg?w=620","discription":"\nFor WNBA players competing overseas this winter, the coronavirus outbreak didn’t only interrupt their seasons – it sent them hurrying home, racing against the global pandemic that has shuttered much of an anxious world. \n\nOne of them: The Sparks’ Sydney Wiese, who was based for the winter in La Seu d’Urgell, Spain. A 24-year-old guard from Phoenix, Wiese saw the outbreak hit Spain fast, and hard. \n\t\t\t\t\t\t\nShe’d only started hearing that the coronavirus outbreak was causing cancellations of schools and universities in the country on Tuesday, March 10. By the next night, her Liga Femenina league was suspended (the NBA paused play hours later). \n\nThe following morning, Wiese awoke to texts, emails and notifications: President Donald Trump had announced a travel ban from Europe. (American citizens and legal residents would be permitted to come home, but there was uncertainty about the parameters immediately after Trump announced the policy.) \n“By late morning Thursday, I had a flight booked for the next day, and would be home before the ban was initiated,” Wiese wrote in an email a week later. “My club (AE Sedis Basketball) was incredibly understanding, sad for all of us that this was taking place, but health was top priority, and they supported my decision to get on home.” \n\nOn Friday, March 13, Wiese flew from Barcelona to Mexico City and then to L.A. \n\n“As I was traveling, my town in Spain was placed on lockdown and there was talk about shutting down the Barcelona airport by the end of the weekend,” she said. “By Monday, Spain was on total lockdown and has been this entire week.” \n\nAs of Friday, March 20, Spain has logged 21,510 coronavirus cases, the second-most in Europe beside Italy. More than 1,000 people in Spain have succumbed to the disease. \n\n“I was on my way home right on time,” said Wiese, who was met with long lines and confusion upon re-entering the United States, her experience aligning with those of many travelers who also rushed home from abroad. \n“I got to customs at LAX by 11:30 p.m. Friday night, and I was in line for an hour and a half,” she said. “When I got to the customs desk, they asked where I was traveling from. I said, ‘Barcelona,’ and they were unsure if they needed to test me or not. Asked a few more officials if I needed a test, but they ended up saying I didn’t. Looking back, I should’ve insisted on being tested, but I didn’t.” \n\nShe stayed overnight in L.A. before returning to the airport for the final leg of her journey home to Arizona – where, as of Friday, there were 63 confirmed COVID-19 cases and no deaths, according to the Arizona Department of Health Services. On Monday, March 16, Wiese went to a Phoenix-area doctor and asked to be tested, conscious of the risks associated with her recent travel history. \n\nShe was told that because there was confusion over the testing protocol, and because she seemed healthy, she didn’t qualify. \n\n“I pushed for a test, but ended up giving up the fight, understanding the solution whether I had it or not would still be at least two weeks of quarantine, vitamins, water,” Wiese said. “And that is what I am doing now.” \n\nShe went back to her parents’ place, where she’s been vigilant – even though she’s shown no symptoms of having the virus: “I have remained mindful of where I have been this last week … and I keep my distance from them, even within our house.” \n\nShe said she feels healthy, that’s she’s getting readjusted to the time zone change, and moreover, that she’s finding she appreciates having a lull in the year-round action that she and so many women’s players normally endure. \n\n“I have been grateful to stop,” she said. “I am grateful for the stillness, for the time with my parents (at a distance), for the attention to taking care of myself, checking in with my friends and family.” \n\nAnd, Wiese added, we’re all in this together – from La Seu d’Urgell to Phoenix. \n\n“We are united in the same confusion, fight, and adjustment to this new rhythm,” she said. “I encourage everyone to proceed with social distancing, washing the hands thoroughly, and viewing this virus through a lens of respect. Many of us may be fortunate, having healthy immune systems, but our responsibilities are great and required. \n\n“Stay home, learn to enjoy the stillness, fill your time with good things and understand these days are temporary. It is important for all of us to listen to our medical officials and trust our efforts will help our country improve past this virus, but it takes all of us.” \n\nThe WNBA season is scheduled to begin May 15, but it’s unknown how that – or the 2020 WNBA Draft or training camp, all set for April – will be affected by the outbreak. \n\nIn a statement last week, WNBA commissioner Cathy Engelbert said the league’s priority was the well-being of its members: “The health and safety of players and employees, with our teams and at the league level is of the utmost importance.” \n\nI went to the doctor this morning, hoping to be tested for the virus, just to be safe. The doctor told me I SEEM healthy. Since they are still trying to figure out testing protocol, there are only enough tests for people who are REALLY showing symptoms \n\n— Sydney Wiese (@swiesebaby24) \n\n"},"19":{"tilte":"\n\t\t\tWhicker: Roger Mayweather, the original Mamba, was just as outspoken and lethal\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/18\/whicker-roger-mayweather-the-original-mamba-was-just-as-outspoken-and-lethal\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/0319_SPO_LDN-L-WHICKER2-1.jpg?w=495","discription":"\nBack when Kobe Bryant was dunking on 3-foot rims, Roger Mayweather was watching a nature special on TV and learning about the black mamba. \n\nWhen the snake strikes, there’s no need to count to 10. Mayweather liked that, so he became \nHis nickname would be upstaged, and so would his own surname, because nephew Floyd Mayweather Jr. came along to go 50-0. But in the ’80s, Roger brought honesty into the ring, the kind that reverberated all the way to Tuesday, when, at 58, he died after a brutal struggle with diabetes. \n\nJohn Beyrooty, the great Herald-Examiner boxing writer turned publicist, was only half-joking when he called Roger “the best fighter in the family.” He was differentiating Floyd’s style, which was one of the first examples of social distancing, from Roger’s, which was fanged and merciless. \nRoger was 59-13 with 35 knockouts, but seven of those losses came in the ’90s. He was a super-featherweight and super-lightweight champ. He fought only once in his Grand Rapids, Mich., home. Instead, the Mamba was invasive. In 1983, he went to Puerto Rico and took Sammy Serrano’s 130-pound belt, in a true road game, with an eighth-round TKO. \n\nRoger had 11 fights in five L.A. locations, and he damaged the careers of a procession of young Mexicans. Along the way, he became known as the “Mexican Assassin.” Roger, nodding to the promoters, would sometimes walk in with a serape and a sombrero. \n\nIn 1987, he floored Rene Arredondo three times in the sixth round and lifted his 140-pound belt at the Sports Arena. Mayweather defended it four times before Julio Cesar Chavez came up from 135. After 10 rounds of body work, Mayweather did not come out for the 11th. Chavez again finished Mayweather in a two-round rematch. \n\nThe kitchen table in Grand Rapids was a boxing Rosetta Stone. Roger and Floyd Sr. and their brother Jeff talked boxing endlessly. Floyd Jr. took in every word. \n\nIn the gym, Floyd Sr. often wore a T-shirt that read, “You Don’t Know (Deleted) About Boxing,” and “you” was pretty much everybody, although Roger respected the brain of his longtime trainer, Jesse Reid. \nRoger’s manager was Billy Baxter, a seven-time World Series of Poker champion from Augusta, Ga. One night Baxter told Bruce Trampler, the Top Rank matchmaker, that Roger had a bad hand and wouldn’t be able to go. Trampler went to Roger and asked him about it. “It hurts,” Roger replied, “but I’ll break this bitch if I have to.” He went ahead and won. \n\n“He was one of my favorite fighters,” Trampler said. “He had a great straight right hand, but his hook was pretty good, too. He brought danger, but he always knew what he was doing in the ring. He wasn’t in there throwing wild shots. He would walk guys down, and he wouldn’t miss punches. He was very, very good at setting up traps for guys. That’s how Floyd Jr. learned to do it himself.” \n\nFloyd Jr. was an explosive featherweight and lightweight, but Roger was also training him then. Floyd Sr. became the trainer after he was released from prison. He wanted defense, Roger wanted offense. The debate was not always respectfully waged. \n\nNo matter what, Roger was a fierce advocate for his nephew. He also was \nIn 2016, Floyd fought Zab Judah, whose family was just as loud as Mayweather’s. When Judah\nBefore one of his bigger Las Vegas fights, Floyd Jr. was claiming the throne, not just that day but for all time. He claimed he was better than Muhammad Ali, Ray Robinson, Joe Louis, Ray Leonard or anybody else who had ever lived. \n\nWriters went to Roger and asked if he agreed. \n\n“Well, what you don’t realize is that Floyd, he’s undefeated,” Roger said, with disdainful eyes. “And all these other (deleted) that you’re talking about? They’re defeated!” \n\nFloyd Jr. decisioned a 23-year-old Canelo Alvarez in 2013. Beforehand, someone asked Roger if he had been impressed by Canelo’s victory over Austin Trout. \n\n“You got to realize something about my nephew,” Roger replied. “When Canelo gets in the ring this time, he ain’t going in there against some salmon. No, he’s going to be there with some steak!” \n\nThe Mamba’s career was well done, too. \n  \n\t\t\t"},"20":{"tilte":"\n\t\t\tGlobal athletes group calls for IOC to postpone Olympics over coronavirus\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/22\/global-athletes-group-calls-for-ioc-to-postpone-olympics-over-coronavirus\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/Olympics-Tokyo-Flame-Arrival-1.jpg?w=525","discription":"\nA worldwide group representing Olympic hopefuls is calling on the IOC to postpone the Tokyo Olympics until the coronavirus pandemic is under control. \n\n“As the world unites to limit the spread of Covid-19 virus, the IOC … must do the same,” Global Athlete said in a news release Sunday. \n\t\t\t\t\t\t\nThis show of solidarity among Olympic hopefuls adds to the dozens of individual athletes who have come out against the IOC’s current stance, which is to start the games as scheduled on July 24. \n\nThe IOC is in consultation with the World Health Organization and has stuck to the position that it’s too early for drastic decisions. \n“It’s bizarre the IOC hasn’t shown any real leadership,” said Caradh O’Donovan, a Global Athlete founder from Ireland whose karate training has been put on hold due to restrictions in her country. “They’re acting as though it’s business as usual and it just seems very strange.” \n\nO’Donovan said the unevenness around the globe regarding training, doping control and qualifying standards are among her key concerns — thoughts echoed by a number of athletes on social media and in interviews with The Associated Press over the past few days. \n\n“Athletes want to be part of a solution to ensure the Games are a success,” the Global Athlete statement said. “But under the current global restrictions that are limiting public gatherings as well as closing training facilities and borders, athletes do not have the ability to appropriately prepare for these Games, and their health and safety must come first.” \n\nThe group also called on broadcasters, specifically NBC, and sponsors “to adopt the same level of duty of care toward athletes by supporting the IOC and (International Paralympic Committee) with flexibility and understanding during these uncharted times.” \n\nThe statement came out a few hours after U.S. athletes took part in a conference call to share their feelings about the crisis and the possibility of a postponed Olympics. The U.S. Olympic and Paralympic Committee is distributing a survey to athletes, with hopes of sharing some of the responses at an IOC meeting next week. \nOn Saturday, one of America’s best-known Olympians, hurdler and bobsledder Lolo Jones, told the Associated Press she was hoping the IOC would respond with a postponement. \n\n“If our job as Olympians and Olympic hopefuls is to inspire society and be healthy, we’re going in direct conflict with that by going out in public to find gyms and tracks and pools that are still open to train for the Games,” Jones said. “Some people are doing that because the IOC is telling us to stay ready, to keep training.” \n\nIt’s a thought being echoed by the Global Athlete group. \n\n“My dream is to go to the Olympics this year but it’s an impossible task from my perspective and it’s the same for a huge number of athletes,” O’Donovan said. “I’d be absolutely stunned if they go on in July, as planned.” \n  \n\t\t\t"}}