{"1":{"tilte":"\n\t\t\tHousing with coronavirus: SoCal sales drop. Will deals in escrow close?\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/22\/conronavirus-angst-cuts-southern-california-homebuying-4-in-4-weeks\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/Southern-California-escrows-openings-1.png?w=566","discription":"\nSouthern California house hunters were already balking at buying existing homes amid coronavirus fears and business closings before \nThe number of new escrows in the six-county region in the 30 days ended March 19 was 16,619 — down 766 or 4% in four weeks, said \nLet’s put this sales drop into perspective. Remember, this is prime homebuying season. My trusty spreadsheet tells me in the same period in the previous five years, new escrows averaged an increase of 904 or 5%. So this was quite a reversal in fortunes for local real estate.\n“Stunning but not unexpected,” says Thomas.\nNumerous factors have hit the market. House hunters and owners alike have lost job security. Lenders that should have been offering cheaper mortgages balked at lower rates due to market fluctuations and a rush of business. Fears of spreading disease \nAnd this recent sales drop came before new state government mandates to limit business interactions. That forced the \nThomas says he expects the majority of sales in progress to close but he expects few new deals to be made and that many listings will end. “Not much you can do until we get some certainty,” he says.\nCoronavirus stomped out what appeared was a solid start to the selling season: Even the depressed March 19 escrows count was up 6.5% above the year-ago level. But four weeks earlier, escrows were rising at an 18% annual pace.\nReportsOnHousing does not track builder activity. But CoreLogic\/DQNews stats show they were having equal success before coronavirus: completed new homes sales in the six-county region totaled 1,368 in February — up 18% in a year. \nReportsOnHousing found Southern California’s supply of existing homes to buy was steady as of March 19: 29,941 homes officially listed in the region, up 282 or 1% in four weeks. That’s on par with 250 listings added on average since 2013.\nHere’s how the existing-home trends run in the region’s counties …\n 5,006 in escrow, down 381 or -7% in four weeks; 8,650 listings, up 2 in this period.\n 2,398 in escrow, down 185 or -7% in four weeks; 4,159 listings, down 2.\n 2,983 in escrow, down 157 or -5% in four weeks; 6,793 listings, up 31.\n 2,313 in escrow, down 109 or -5% in four weeks; 4,406 listings, up 10.\n 3,138 in escrow, down 115 or -4% in four weeks; 4,808 listings, up 220.\n 781 in escrow, up 181 or 30% in four weeks; 1,125 listings, up 21."},"2":{"tilte":"\n\t\t\tAmazon’s Bezos tells workers coronavirus will ‘get worse’\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/22\/amazons-bezos-tells-workers-coronavirus-will-get-worse\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/RPE-Z-AMAZON-BEZOS-0322-1.jpg?w=525","discription":"\nAmazon.com’s Chief Executive Officer Jeff Bezos warned his company’s 800,000 employees that the coronavirus outbreak will likely “get worse before it gets better,” according to an open letter shared Saturday on his Instagram account.\nThe letter follows cries from U.S. lawmakers and his own employees that the world’s largest online retailer isn’t doing enough to protect its warehouse workers and delivery drivers who endanger themselves delivering products to Amazon customers looking to avoid stores.\n“This isn’t business as usual, and it’s a time of great stress and uncertainty,” Bezos wrote. “It’s also a moment in time when the work we’re doing is its most critical.”\nBezos’ letter, his first public comments about the outbreak, comes when lawmakers and regulators around the country are making decisions about which businesses are essential and should keep operating, and which ones should close down so employees can remain at home and reduce their exposure to the outbreak that has infected more than 300,000 globally and killed at least 13,000.\nAmazon has seen a surge in demand from customers ordering baby formula, hand sanitizer and medical supplies. It announced plans to hire 100,000 workers to meet demand and is temporarily boosting pay among its warehouse employees and instructed its contract delivery partners to also raise wages for drivers who don’t work directly for Amazon. Key rival Walmart Inc. is also hiring workers and doling out bonuses to staff helping it meet demand.\nBoth companies face criticism from lawmakers, workers and activists for not doing enough to protect hourly workers on the front lines of the crisis. The pressure ramped up Friday when a group of workers from Walmart, Amazon and other big retailers, called United for Respect, demanded paid leave for those affected by the coronavirus outbreak and better protective measures from their employers.\nAmazon on Saturday announced hourly workers in its U.S. delivery network would receive double pay for every hour they work in excess of 40 each week, effective March 15 through May 9. That follows temporary raises of $2 per hour that will be in effect through April.\nMonica Moody, a 22-year-old Amazon warehouse worker near Charlotte, North Carolina, said she and her fellow employees don’t have adequate protective gear or sufficient time to wash their hands during their shifts. She argued that the warehouse should close temporarily to be sanitized.\nAlso on Friday, four Democratic senators, led by Cory Booker of New Jersey, wrote to Bezos asking the company to implement more aggressive safety measures and offer more hazard pay to its employees. The letter cited news reports in the past week in which workers at the front lines of Amazon’s logistics network raised concerns they didn’t have the time or resources to protect themselves as they helped speed packages to customer doorsteps. The Amazon delivery drivers in California told Bloomberg they received one single disinfecting wipe to clean vans before the start of their shifts.\nBezos said the company has increased cleaning in its facilities and implemented instructions for employees to maintain a safe distance from one another, and continues to meet daily to address safety issues. Getting proper equipment remains a challenge, he said. On Wednesday, Amazon reported the first confirmed case among its U.S. warehouse workforce — at a delivery station near New York’s LaGuardia Airport.\n“We’ve placed purchase orders for millions of face masks we want to give to our employees and contractors who cannot work from home, but very few of those orders have been filled,” Bezos said.\n“Masks remain in short supply globally and are at this point being directed by governments to the highest-need facilities like hospitals and clinics,” he added. “It’s easy to understand why the incredible medical providers serving our communities need to be first in line. When our turn for masks comes, our first priority will be getting them in the hands of our employees and partners working to get essential products to people.”\nAmazon is now one of the three most biggest U.S. companies by market value, making Bezos the world’s richest man. Critics say he could do more.\n“Talk is cheap,” said Dania Rajendra, director of Athena, a group that advocates for hourly workers and small businesses, and a frequent critic of Amazon.\n“Rather than focusing on unavailable equipment, or issuing half measures that don’t come close to tackling the scale of the crisis, Bezos and his corporation should make real moves that protect public and worker health, starting with the very basics, like enough time for workers to wash their hands, health coverage for everyone who needs it, and paid leave, so people who need to stay home can,” she said."},"3":{"tilte":"\n\t\t\tGlendale provides hand-washing stations, meals during coronavirus crisis\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/21\/glendale-provides-hand-washing-stations-meals-during-coronavirus-crisis\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/AP20065580901865-5.jpg?w=505","discription":"\nGlendale announced on Saturday, March 21, that it will provide packaged meals on a daily basis for seniors and people experiencing homelessness and deploy portable hand-washing stations and bathrooms.\nHand-washing stations are located at:\nThe bathrooms\/hand-washing stations are located at:\nAs of March 20, 2020, the meal distribution plan for seniors currently enrolled in the Elderly Nutrition Program (ENP) is as follows:\nNew Clients must fill out a universal intake form before receiving meal. New clients must be 60 or older. Availability is based on supply.\nFor more information related to the Elderly Nutrition Program, call 818-548-3775."},"4":{"tilte":"\n\t\t\tPG&E pleads guilty in Butte County fatal fire case\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/23\/pge-pleads-guilty-criminal-charges-fatal-2018-camp-fire-butte-county-wildfire\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/SJM-L-PULGAPGE-1113-6-1.jpg?w=542","discription":"\nBay Area News Group\nPG&E on Monday disclosed it has pleaded guilty to scores of criminal charges arising from the deadly Camp Fire of 2018 that roared through Butte County, an inferno caused by the disgraced utility.\nUnder the agreement that PG&E reached with the state of California and the Butte County District Attorney’s Office, PG&E admitted its guilt in the Camp Fire, which caused 85 fatalities, according to a regulatory filing by PG&E with the Securities and Exchange Commission.\n“Subject to the terms and conditions of the Agreement, the utility has agreed to plead guilty to 84 counts of involuntary manslaughter and one count of unlawfully causing a fire,” PG&E stated in the SEC filing."},"5":{"tilte":"\n\t\t\tAnheuser-Busch to make hand sanitizer to fight coronavirus at its Van Nuys plant\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/22\/anheuser-busch-to-make-hand-sanitizer-to-fight-coronavirus-at-its-van-nuys-plant\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/LDN-L-VIRUS-BUSCH-0323-1-1.jpg?w=400","discription":"\nAnheuser-Busch, which has been making beer for 165 years, is now going to produce bottles of hand sanitizer at its Van Nuys and Baldwinsville, N.Y. facilities in addition to suds, in response to shortages spurred by the novel coronavirus pandemic.\nAs a first step, the brewery will use its mammoth supply and logistics network to produce and distribute bottles of alcohol-based skin-cleaning product to its internal teams, Cesar Vargas, U.S. Chief External Affairs Officer, Anheuser-Busch, said in an emailed statement on Sunday, March 22.\nAlso, with the help and direction of the American Red Cross, Anheuser-Busch will ship hand sanitizer to the communities where it’s needed most, Vargas wrote.\nThe CDC recommends the use of alcohol-based sanitizers with greater than 60% ethanol or 70% isopropanol as the preferred form of hand hygiene during the outbreak to prevent spread of the virus.\n“To help address COVID-19, Anheuser-Busch is focused on the health and safety of our employees and serving our communities, he said.\n“As we have in the past, we are leveraging our capabilities, our relationships and our reach to provide assistance to those in need,” Vargas wrote. “We are in this together and there is more to come.”\nThe plant moved in 1954 from Pasadena to Van Nuys.\nThe St. Louis-based company in 2015 invested $20 million to make the facility more water efficient.\nIt wasn’t always just a beer-production complex. The Van Nuys Budweiser factory was open to the public when it operated Busch Gardens starting in 1966.\nThe world-famous theme park offered boat rides, bumper cars, a monorail tour through the factory, lagoons, a waterfall, more than 1,000 rare birds and free beer.\nThe tourist attraction was winnowed down to bird shows in 1977 and finally closed to the public in 1979. August Busch III closed the theme park to make way for an expansion of the plant.\nIn recent years, the plant has offered some scheduled “pop up” tours, which have swiftly sold out. Recently, the company has made many upgrades to the facility including a patio and tasting room."},"6":{"tilte":"\n\t\t\tFed to buy as much government debt as needed to aid coronavirus-battered economy\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/23\/fed-to-buy-as-much-government-debt-as-needed-to-aid-coronavirus-battered-economy\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/AP20077545642902-1.jpg?w=525","discription":"\n | \nWASHINGTON — In its boldest effort to protect the U.S. economy from the coronavirus, the Federal Reserve says it will buy as much government debt as it deems necessary and will also begin lending to small and large businesses and local governments to help them weather the crisis.\nThe Fed’s announcement Monday removes any dollar limits from its plans to support the flow of credit through an economy that has been ravaged by the viral outbreak. The central bank’s all-out effort has now gone beyond even the extraordinary drive it made to rescue the economy from the 2008 financial crisis.\n“The coronavirus pandemic is causing tremendous hardship across the United States and around the world,” the Fed said in a statement. “Our nation’s first priority is to care for those afflicted and to limit the further spread of the virus. While great uncertainty remains, it has become clear that our economy will face severe disruptions. Aggressive efforts must be taken across the public and private sectors to limit the losses to jobs and incomes and to promote a swift recovery once the disruptions abate.”\nFinancial markets sharply reversed themselves after the announcement but then fell back again after the market opened. By mid-morning, the Dow Jones Industrial Average was down about 1.5%. The yield on the 10-year Treasury bond fell, a sign that more investors are willing to purchase the securities.\nIn unleashing its aggressive new efforts, the Fed is trying both to stabilize the economic standstill and allay panic in financial markets. Many corporations and city and state governments are in desperate need of loans to pay bills and maintain operations as their revenue from customers or taxpayers collapses. That need has escalated demand for cash. In the meantime, large businesses have been drawing, as much as they can, on their existing borrowing relationships with banks.\nThe intensifying needs for cash means that banks and other investors are seeking to rapidly unload Treasuries, short-term corporate debt, municipal bonds and other securities. The Fed’s move to step in and act as a buyer of last resort is intended provide that needed cash.\nMany economists say that whatever financial support Congress eventually provides will likely be even more important than the Fed’s intervention. And they warn that such fiscal help needs to come soon.\nThe Fed’s intervention is not a substitute for fiscal stimulus,” said Joseph Gagnon, a former Fed economist who is now senior fellow at the Peterson Institute for International Economics. “Let’s hope Congress passes something quickly.”\nIn its announcement Monday, the Fed said it will establish three new lending facilities that will provide up to $300 billion by purchasing corporate bonds, a wider range of municipal bonds and securities tied to such debt as auto and real estate loans. It will also buy an unlimited amount of Treasury bonds and mortgage-backed securities to try to hold down borrowing rates and ensure those markets function smoothly.\nThe central bank’s new go-for-broke approach is an acknowledgment that its previous plans to keep credit flowing smoothly, which included dollar limits, wouldn’t be enough in the face of the viral outbreak, which has brought the U.S. economy to a near-standstill as workers and consumers stay home. Last week, it said it would buy $500 billion of Treasuries and $200 billion of mortgage-backed securities, then quickly ran through roughly half those amounts by week’s end of the week.\nAnd on Monday, the New York Federal Reserve said it would buy $75 billion of Treasuries and $50 billion of mortgage-backed securities each day this week.\n“They’re really setting the economy up” to start functioning again when the health crisis subsides, said Donald Kohn, a former Fed vice chair who is a senior fellow at the Brookings Institution. “Part of this is about the other side of the valley: Make sure the credit is there.”\nStill, Kohn noted, “These things will take some time to set up. These are complicated” programs.\nJust knowing that the Fed is on the case should reassure businesses as the programs ramp up, Kohn said.\n“The fact that this is coming: People will know it,” Kohn said. “They know the Fed is on the job. If there are issues that come up, what you’re seeing from this Federal Reserve is: ‘We will deal with it.’ ”\nIan Shepherdson, chief economist at Pantheon Macroeconomics, said it is clear that the Fed is now doing “whatever it takes.”\n“This is an all-out effort to ensure that the business sector can continue to exist even as economic activity temporarily collapses,” Shepherdson said.\n“The steps announced today, combined with the previous ones … should substantially improve market functioning and should provide some important support for the economy,” said Roberto Perli, a former Fed economist who is now head of global policy research at Cornerstone Macro.\nBut Perli cautioned that the benefits won’t be felt immediately.\n“The next couple of quarters will still be probably bad,” he said.\nThe new programs announced Monday by the Fed include two that will buy corporate debt issued by large companies. The Fed legally can’t lend directly to companies. But it can lend to separate entities, which can then make those purchases.\nOne program will buy newly issued corporate debt. This is an effort to revive that market, which has effectively come to a standstill. The second will buy previously issued corporate debt. Both programs will include $10 billion provided by the Treasury to offset any losses.\nA third new lending program will buy securities backed by packages of auto loans, credit card loans and some small business loans. Lending in those areas hinges on the ability of banks to package those loans into securities and sell them. So the Fed’s move is critical to the ability of banks to continue to provide these loans as the economy falters.\nThe Treasury will also provide $10 billion to that program to offset any losses. All told, those three programs can lend up to $300 billion.\nThe Fed also said it will soon establish a “Main Street Business Lending Program”to support lending to small and medium-sized businesses. But it provided few details and didn’t say when that program would begin.\nThe central bank’s efforts to protect the economy could be amplified by rescue legislation moving through Congress. Senate Republicans have proposed providing roughly $500 billion to the Treasury Department that it could use to then backstop more lending by the Fed.\nMany economists say that whatever financial support Congress eventually provides will likely be even more important than the Fed’s intervention. And they warn that such fiscal help needs to come soon.\n“It is good to work with Treasury to help keep credit flowing but not a substitute for fiscal stimulus,” said Joseph Gagnon, a former Fed economist who is now senior fellow at the Peterson Institute for International Economics. “Let’s hope Congress passes something quickly.”"},"7":{"tilte":"\n\t\t\tBubble Watch: Coronavirus may clobber ‘overvalued’ housing markets\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/20\/bubble-watch-coronavirus-may-clobber-overvalued-housing-markets\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/Screen-Shot-2020-03-20-at-10.00.51-AM-1.png?w=620","discription":"\nWith home prices looking very vulnerable to coronavirus fallout, 17 states were found to have overvalued housing in the fourth quarter, up from 15 at the end of 2018 and 14 at 2017’s close.\nFitch Ratings\nAnalysts at Fitch Ratings estimate U.S. home values, when compared with their economic underpinnings, were 1.5% overvalued at the end of 2019. But the national picture showed wide variations. California home prices — up 4% last year, by Fitch’s math — got a “sustainable” rating, one of 28 states to get that a passing grade. And it’s the same grade the state got a year earlier.\nWe’re in uncharted waters and stuck making guesstimates based on “BC” data. That’s stats “before coronavirus.”\nBut I’ll bet that housing markets with high overvaluation are at greater risk of price reversals.\n“The broad spread of coronavirus in the U.S. will slow down home buying activity, leading to a temporary drop in demand and lower home price growth,” Fitch wrote. “A widespread and protracted period of containment could result in larger disruptions to local economies, higher unemployment and home price declines.”\nFitch found that no state had falling prices, by its math, in the fourth quarter vs. a year earlier. So those “BC” days were fairly good to most homeowners. But that doesn’t mean all prices were economically logical to Fitch.\nBy their analysts’ math, the most overvalued housing — with prices 20% to 24% above their economic value — were found in Idaho (prices up 12% last year) and Nevada (up 4%). Next on the overvaluation scale, 15% to 19% too high, was North Dakota (up 3% in ’19).\nOvervalued by 10% to 14% was Arizona (up 7%), Texas (up 4%) and Utah (up 8%).\nThe lowest overvaluation (5% to 9% too high) was seen in Colorado (up 6%); Florida (up 6%); Kansas (up 5%); Nebraska (up 4%); Oregon (up 5%); Rhode Island (up 6%); South Dakota (up 5%); Tennessee (up 7%); Washington (up 7%); Wisconsin (up 6%); and Wyoming (up 6%).\nSo where’s the undervalued homes, by Fitch’s math? Connecticut (up 2% last year); Illinois (up 2%); Maryland (up 4%); Michigan (up 5%); New Jersey (up 5%); and West Virginia (up 7%).\nAt the local level, Fitch estimates 18% of U.S. metropolitan areas have housing markets 10% or more overvalued. San Antonio, Las Vegas and Austin were the most overvalued. The region that comprises Los Angeles and Orange counties was rated “sustainable” as were San Francisco and San Diego.\nOn a scale of zero bubbles (no bubble here) to five bubbles (five-alarm warning) … \nLet’s face the harsh reality: Only a handful of industries are immune from coronavirus and its related shutdowns, bans, limitations and shortages. That means lots of job losses. And out-of-work folks don’t buy homes while those who already own have trouble keeping them.\nSo places with weak economic foundations, both the overall business climate and what’s backing the housing market, are more likely to fall hardest."},"8":{"tilte":"\n\t\t\tNewsom calls out almost every Californian for being a NIMBY\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/newsom-calls-out-all-californians-for-being-nimbys\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/02\/OCR-L-NEWSOM-0223-1.jpg?w=525","discription":"\nGive Gov. Gavin Newsom credit for his lengthy list of culprits in California’s homelessness problem.\n basically stated that almost every Californian is a NIMBY.\nThe speech detailed, directly or indirectly, a roster of forces that, at best, did little to help the housing crunch: the not-in-my-backyard, anti-growth crowd. Folks who are rich or poor, urban or suburban. Homeowners and renters. Landlords, too. Not to mention decades of policymakers from his political party and the other one, too.\nAnd he’s 100% correct in tying inaction to self-interest. It’s a natural defense mechanism against change in all situations, especially when an issue like housing puts literally trillions of dollars of wealth at stake.\n“Time and time again, bigger, bolder reform hasn’t happened — in part because of some legitimate concerns,” \n“Many of our lowest-income residents understandably worry about being pushed out of their own communities because of gentrification. Middle-class homeowners worry that their single-family home could lose its value — a scary prospect given a house is often a family’s biggest asset.\n“These real concerns should not be brushed aside. At the same time, we also know the status quo is simply unacceptable — we aren’t building enough housing.”\nShaming inaction is a laudable tactic. But one often unspoken challenge is that the status quo is EXACTLY what a chunk of the real estate industry wants.\nNewsom says sacrifices are needed from the homeowner who’s bet their life savings on a California home. He suggests the same from the tenement-dweller who accepts their dumpy rental because there’s no better option and they live one layoff or medical bill away from homelessness.\nBut what about the real estate industry?\nCalifornia is one of the nation’s most-profitable places to build a home, sell or finance one or own an apartment complex. That’s due, in part, to the modest supply of housing available in the state’s growing economy.\nDo you expect the industry to willingly give up that profitable perch?\nNewsom and many others suggest the supply slice of the homelessness challenge is simple economics, more homes equal lower costs. But similar economic pressures suggest the state’s real estate world will protect its turf in a very NIMBY way.\nIt’s not just your typical Californian who doesn’t want the homeless shelter or “affordable” housing down the block. The portfolios of big landlords and major landowners may be harmed as well.\nOr you hear of industry calls for “help” to make lower-priced home construction “profitable.”\nLet’s look at last year’s \nNewsom called for greater “accountability” in the housing challenges. What about this industry error?\nThe industry is good at seeking “help” from the government. Requests to loosen environmental constraints and ease regulatory approvals have merit. But what of industry demands for lowering “fees” charged in the process?\nMany of these much-debated development fees are attempts by local governments to recoup infrastructure costs associated with new communities — schools, sewers, roads, first responders, etc. And some reasonable proposals have been floated to find state money to help lower these fees, which often are pushed all the way to the price the eventual buyer pays.\nIt’s a win-win if future cuts in developer fees equal homebuyer savings and not greater profits for homebuilders.\nAnd it’s not just new construction.\nWhat about the unnecessary complexity, not to mention the costs, of actually acquiring a home, new or used, or renting one. While we consider retooling state laws to make construction easier, what about regulations that could ease the acquisition and financing of housing, not to mention open up the transactions’ field to new entrants in order to boost competition?\nIf California wants to really fix this problem, all stakeholders must accept change for the greater good. That includes the real estate industry."},"9":{"tilte":"\n\t\t\tHollywood production goes dark; blame coronavirus\t\t","link":"https:\/\/www.dailynews.com\/2020\/03\/20\/hollywood-production-goes-dark-blame-coronavirus\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/03\/LDN-L-FILMING-0330-DC-3-1.jpg?w=527","discription":"\nExcept for maybe at a few talk show hosts’ homes, entertainment production has effectively ceased in Los Angeles County and throughout most of the world.\nCalifornia’s, Mayor Eric Garcetti’s and the county’s Thursday night orders for everyone to stay home for at least a month mean no more movies or TV shows are getting made during the coronavirus crisis.\nNot that many were in the past week; from major studios to the smallest independent endeavors, casts and crews were sent home from sets none of them wanted to potentially get infected on anyway.\nAs with every other business outside of maybe toilet paper manufacturing, the financial devastation this will cause in the short and (especially if there is a) long term is incalculable.\n“This is the largest challenge that the entertainment industry has faced at the very least since World War II, and probably in its history, in terms of disruption,” stated Kevin Klowden, executive director of Santa Monica’s Milken Institute’s Center for Regional Economics and California Center. “Hollywood is a lot more resilient than people give it credit for, but that doesn’t mean that the day-to-day life for people employed in Hollywood has not gotten incredibly hard.”\nThe major unions are all trying to cope in different ways.\nSAG-AFTRA, the performers guild, streamlined its foundation’s COVID-19 Disaster Fund’s application process Thursday due to “an extremely high volume of requests” for aid. Like SAG-AFTRA’s, the Directors Guild of America’s health plan has waived co-pays and deductibles for Coronavirus tests.\nThe Writers Guild of America, traditionally Hollywood’s most contentious above-the-line union, even seems to be cooperating with the bosses’ representative, the Alliance of Motion Picture and Television Producers, for a change . . . If only to figure out when and how to start negotiating the writers’ new contract.\nHardest and widest hit, however, are nonunionized support and office staff, as well as organized below-the-line labor, which are virtually every other skilled craftsperson necessary to make a show.\nWhile some Southern California BTL jobs are represented by Teamsters Local 399 (which is at least able to get its laid-off production drivers preferential employment for one of the few booming businesses in the new corona economy, transporting food and goods to besieged grocery stores), the majority of rank-and-file film and live production workers are members of various International Alliance of Theatrical Stage Employees locals.\nThe International has projected that 120,000 of its 150,000 members in the U.S. and Canada are now unemployed because of the coronavirus shutdown. Many of those professionals go from show to show, and therefore do not meet some of the past-employment requirements Congress’ emergency relief legislation requires. IATSE is furiously lobbying lawmakers to take the unique circumstances of entertainment workers into consideration as other rounds of aid packages move forward.\n“Given the fast pace and freelance nature of the entertainment industry, a lot of entertainment workers – not all of them – wouldn’t qualify for extended benefits because they don’t meet the days worked for a particular employer requirements of that law,” Jonas Loeb, IATSE’s director of communications, explained.\nIn the meantime, IATSE has been contributing to charities, such as the Actors Fund, that its members can access for aid, and moving to see what the also income-squeezed employers, from the major studios like Disney to single-show independent producers, can do to help the idled rank-and-file.\n“The IATSE is working with employers and looking at all of our contracts for pertinent clauses,” Loeb said. “We’re fighting around the clock on every possible front.”\nWhile it’s unclear what many individual outfits in the vast array of production and distribution entities can and\/or are willing to do to support workers through the shutdown, at least the one major player that hasn’t \n“Almost all television and film production has now ceased globally – leaving hundreds of thousands of crew and cast without jobs. These include electricians, carpenters and drivers, many of whom are paid hourly wages and work on a project-to-project basis,” Netflix’s chief content officer Ted Sarandos wrote in a company blog post announcing the fund. He added that for Netflix’s pros, “This is in addition to the two weeks pay we’ve already committed to the crew and cast on productions we were forced to suspend last week.”\nEven those who are getting a few weeks’ severance will need help to stay solvent through a pandemic it will likely take months to outlast.\n“You have to assume that there will be some companies that are able to provide some kind of support to the staff that is not working as a result of these shutdowns,” FilmLA president Paul Audley observed. “And there’s some that can’t, so like every other industry in the region, it’s going to be devastating for individuals and really hard for the overall economy. That’s why we all hope, in the global picture here in the United States, that some of the federal and state initiatives come through to help support the individuals in this business through what could be a fairly long period of time of no work.”\nAudley said that his film office for the city and county saw a huge drop in location shooting permit requests since most major productions announced that they were shutting down late in the second week of March. By last Wednesday, no permits were being requested, and on Friday they were forbidden until at least March 31, with extensions beyond then likely.\nBeside talent, crew and producers getting strangled by the production shutdown, hundreds of independent service vendors – from those who provide talent trailers and cameras to set caterers and florists – are seeing their small businesses hit a wall.\n“Vendors are, obviously, suffering greatly,” Audley noted. “So much of this business is margin-based, they don’t have months and months of runout time. We have grave concern that some of these people could be history.”\nA similar fate could be looming for many independent producers, traditionally the impresarios who find and give new talent their break in the industry.\n“The studios, the bigger companies will survive,” Milken’s Klowden asserted. “It’s some of the independent producers that are a concern. That problem is true not just in the movie industry but in a lot of small business. When you operate without a lot of reserves, when you operate with smaller margins, then this winds up being a huge, cash-crunch problem.”\nWhile David M. Smith, a professor of economics at Pepperdine University’s Graziadio Business School agreed that a work stoppage beyond 12 weeks would be terribly hard for individuals and an existential threat to smaller companies, he did think that Hollywood’s skilled workers will right their career ships if they can weather the current storm.\n“Some of these workers are very valuable, and I’m sure the studios are taking that into consideration and may help some of these individuals over time,” Smith said. “There’s going to be pent-up demand for entertainment when things do get back to normal. For some small businesses like a small hotel or restaurant, there may be a question of whether there’s going to be a job to go back to. For these workers, there will likely be jobs. Good, below-the-line workers are in high demand.”\nFilmLA’s Audley saw another ray of optimism in the now totally gone-dark picture.\n“The studios have all suspended their work and they’re not setting a date by which they believe they’ll be back out,” Audley acknowledged. “But one thing to think about for the entertainment industry versus a lot of others is that it can start working the next day after clearance, because they’re that flexible and mobile.”\nOverall, though, Southern California can expect one of its signature industries to mean just a fraction of what it did to the area’s economy until this pandemic abates.\n“It becomes one more piece on top of what is already a very complex, frustrating situation,” Klowden concluded. “As far as oddities, you had seen that a certain amount of the port activity had been in a slump because of the trade war and, then, the Chinese isolation. Now that Chinese production is coming back online, that’s showing signs of starting to recover. But that’s going to wind up running into the production shutdown in entertainment and the hospitality and tourism industries.\n“They’re all going to be hit together, and that’s going to affect people in both lower and higher incomes. It’s going to stretch the problem throughout Southern Californian society,” Klowden said."}}