{"1":{"tilte":"Australia Awards Scholarship for Pakistani Students","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/australia-awards-scholarship-for-pakistani-students-scholar-92","discription":"Australia Awards Scholarships are offered Australian Government to Pakistani students. These scholarships aim to contribute to the development needs of Pakistani economy. For Pakistani Students, Australia Awards scholarships are offered for Master's Degree program in different programs as enlisted below.  Last date to apply is April 30, 2020.\nThe study and research opportunities provided by Australia Awards Scholarships develop the skills and knowledge of individuals to drive change and contribute to development in their own countries.\nAustralia Awards Scholarship covers:\nAustralia Awards Scholarships are offered for the minimum period necessary for the individual to complete the academic program specified by the Australian higher education institution, including any preparatory training. Benefits include\n\nFull tuition fees\nReturn airfares\nLiving expenses and\nMedical insurance.\n\nList of fields for Australia Awards scholarships\nExamples of fields of study that promote the Sustainable Development Goals include (but are not limited to):\n\nAgriculture and Rural Development\nBusiness Management (including MBA)\nDevelopment Studies\nDisaster Management\/Preparedness—Environmental Policy\/Climate Change Adaptation\nDisability Studies\nEconomics\nEducation\nEnergy and Renewables\nFinance\nFood Security\nGender Studies\nHuman Rights\nIntegrated Water Resources Management (including Engineering)\nInternational Trade\nInternational and\/or Human Rights Law\nInternational Relations\nInternational Law\nMining (including Engineering)\nPeace and Conflict Studies\nPolicing and Counter-Terrorism\nPublic Policy and\/or Administration\nPublic Health & Nutrition policies\nSanitation and Clean Drinking Water\nWomen’s Studies\n\nEligibility Criteria for Australia Awards Scholarship for Pakistani Students\nTo be eligible, applicants must: \n\nA Pakistani citizen currently residing in Pakistan for at least the past 24 months\nNot have applied for or be entitled to permanent residency or citizenship in Australia or New Zealand\nSatisfy Australian Government requirements for international student visas for entry to Australia (health, character etc.)\nBe able to provide a Police Security Clearance Certificate at the time of visa application\nNot hold another scholarship\nNot have held a foreign scholarship in the 24 months preceding the application (calculated from the date of arrival back in Pakistan to the closing date for receipt of applications)\nBe applying to commence a new course of study and not be seeking support for a course already commenced in Australia (ongoing study programs will not be supported)\nBe able to take up the Scholarship in the year for which it is offered\nHave outlined a case that is clear about their objectives and motivation to make a contribution to development in Pakistan\nApply for courses that fall within the priority development sectors identified for Pakistan\nSatisfy the admission requirements of the Australian tertiary institution and the course to be undertaken\nHave an academic background relevant to the proposed study in Australia\nBe applying for a Masters degree-level course\nHave completed 16 years of education\nNot be above 45 years of age at the time of submitting the application form\nHave at least five years 1 of work experience in the field in which they are applying. Internships and volunteer work will not be considered as work experience\nSubmit a Development Impact Plan (DIP) that clearly articulates how the proposed field of study 1 People with a disability may apply if they have at least two years of work experience. could add value to improving the level and standard of service delivery, particularly in the priority development sectors and in promoting pro-poor development"},"2":{"tilte":"Bolan Mining Enterprise Scholarship","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/bolan-mining-enterprise-scholarship-scholar-666","discription":"Bolan Mining Enterprise, A joint venture of Government of Balochistan and Pakistan Petroleum Limited announces merit scholarship. 10 students will be awarded scholarship. Last date to apply for scholarship is April 02, 2020.\nStudents studying the following programs can apply for BME Scholarship:\n1)    Bachelor's Degree in Mining Engineering or\n2)   BS\/Master's Degree in Geology or Geological Engineering\n3) BS\/Master's Degree in Business Administration (MBA)\nBME Scholarship Eligibility Criteria:  \nThe basis of selection shall be as under.\n1) The scholarship is meant for the local\/domiciled students of Khuzdar district only.\n2) The candidates must have passed their intermediate \/ Graduation examination (or equivalent) obtaining at east 55%aggregate marks, having maximum age:20 years for the Bachelor's degree course and 22 years for Master's degree course. If 55%qualifying marks criteria is not fulfilled by Khuzdar district students, the second preference will be given to students of Kalat division.\n3) Final Selection will be made by the BME Management.\n4) The Scholarship amount shall be released only when the selected scholar has secured admission in any of the above discipline by producing documentary evidence confirming his\/her admission.\n5) BME reserves the right to reject any or all applications without assigning any reason therefore.\nApplications with full details of educational qualifications along with photocopies of documents like local domicile certificate, CNIC and evidence confirming admission etc, must reach the undersigned not later than  02April,2020."},"3":{"tilte":"HEC Indigenous Scholarship For PhD","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/hec-indigenous-scholarship-for-phd-scholar-502","discription":"HEC announces Indigenous Scholarship for PhD students. Applications are invited from outstanding Pakistani\/AJK nationals who intend to complete PhD from Pakistani Higher Education Commission HEC Recognised Universities\/Degree Awarding Institutions (DAIs). Last date to apply HEC indigenous scholarship is March 28, 2020.  The Scholarships are being offered for the academic year 2020 in all areas of studies\/disciplines under the project entitled “indigenous PhD Fellowship for 5000 Scholars-Phase-II’ in the following four categories:\n\nBachelors\/ Masters (16 Years) Completed \nMasters\/Mphil (18 Years Completed)\nMasters\/Mphil (18 Years) Enrolled\nEnrolled in PhD\n\nHEC Indigenous Scholarship Eligibility Criteria:\n\nPakistani\/AJK nationals.\nFor MS\/Mphil, the Candidates must have minimum 16 years of education at the closing date of application i.e. March 28, 2020 with no 3rd division or grade-D in degrees\/certificates during entire academic career.\nThe candidates who are already availing any other HEC\/Government Scholarship are not eligble to apply.\nThis offer of scholarship is valid for full-time, regular students, while in case of employment, study leave will be required for full duration of study program.\n\nHow to apply for HEC Indigenous Scholarship:\n\nApplicants are required to submit only online application through (eportal.hec\/gov.pk). hand copy of applications and any other documents are not required at this stage.\nOriginal online deposit slip\/ATM transfer slip of Rs. 500\/- (non-refundable) as application processing fee in favour of director general, finance, HEC. Fee can be deposited through any bank in account number 1742-79001334-01, Habib bank limited."},"4":{"tilte":"DAAD Scholarships for Study in Germany","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/daad-scholarships-for-study-in-germany-scholar-594","discription":"Applications are now open for DAAD Scholarships for Study in Germany. DAAD is one of the world's largest funding organizations. It provides over 100,000 scholarships and grants to German and International students for study in Germany.\nDAAD scholarship is provided to Masters, PhD and postdocs for study and research purposes. DAAD scholarship is not to be paid back, every student is awarded a monthly stipend and travel allowance.\nDAAD Scholarship for study in Germany covers\nDAAD Scholarships for Masters & Ph.D. is a fully funded German Scholarship for International Students. Following is covered in the scholarship\n\nFull Tuition fee\nMonthly Stipend 850 euros for masters programs\n1,200 euros for doctoral degree.\nMedical insurance\nTravel Allowance will be covered by DAAD Scholarship 2020\n\nEligibility Criteria for DAAD Scholarship\n\nEligible Countries: Foreign Students can apply.\nEntrance Requirements: Scholarship criteria is:\n\nGraduates with at least two years’ professional experience\nCandidates fulfill the necessary academic requirements and can be expected to successfully complete a study programme in Germany (above-average result for first academic exam – top performance third, language skills)\nCandidates have a Bachelor degree (usually a four-year course) in an appropriate subject\nCandidates have at least two years’ professional experience\nCandidates can prove their motivation is development-related and be expected to take on social responsibility and initiate and support processes of change in their personal and professional environment after their training\/scholarship\n\n\nEnglish Language Requirements: Depending on chosen study programme; please check scholarship brochure or the website of your chosen study programme.\n\n \nHow to apply for DAAD Scholarship\nIf you wish to apply for a DAAD scholarship, please read the call for applications for your chosen scholarship program in the scholarship database , paying particular attention to application deadlines. The scholarship database will take you to the application portal. Scholarship applications are reviewed by independent and voluntary selection committees, which also decide on the allocation of scholarships. Selection is based on subject-related criteria.\nA comprehensive overview of DAAD scholarship programs is available in DAAD scholarship database: www.funding-guide.de .\nYou can download a flyer listing our most important scholarship programs here [pdf-file] ."},"5":{"tilte":"Diya Pakistan Scholarship","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/diya-pakistan-scholarship-scholar-160","discription":"Diya Pakistan is one of the largest scholarship providing organizations in Pakistan. Diya Pakistan provides 50,000 annual scholarships to school and university students. It also offers monthly stipends to the students enrolled in skill development programs. Diya Pakistan accepts applications throughout the years. Deserving students can apply online at Diya Pakistan website.\nDiya Pakistan is providing scholarship to the students for last 30 years.  In last 30 years, Diya has provided over 400,000 scholarships and US$ 7.8 million in donations received and disbursed. \nDiya Pakistan Scholarship Features\n\n50,000 Annual scholarships\n45,000 scholarships for school students\n8000 scholarships for Skill development courses\n15,00 scholarships for University students\n \n\nEligibility Criteria for Diya Pakistan Scholarship\n\nSchool Students\nCollege Students \/ FA FSc\nUniversity students for BS and MS levels\nMinimum 60% marks at all levels\nStudents enrolled in Govt Institutions can apply only\nStudents getting scholarship more than Rs. 25000 per anum from other organization are not eligible for Diya Scholarship.\nPh.D and M.Phil students are also not eligible for Diya Scholarship however, direct M.Phil after Graduation are eligible. M.Phil after M.A\/M.Sc\/MS are not eligible.\n\nHow to apply for Diya Pakistan Scholarship\nOnline Web Application System is only used for students who are enrolled in Graduation Level, Master Level Programmes. Applications can be submitted at https:\/\/diyapak.org\/apply-scholarship\/\nSchool and Inter level students will apply through manual system. Online system is only for BS and MS students.\nSchool and College level students will apply directly through their school\/college.\nStudents applying for the first time, fill out the Online Scholarship Application.\nNow you Upload scan documents (mentioned below).\nAfter approval cheque will be despatched at your Institute within 10 to 30 days. After verification it will be handed over to you. You can encash the cheque at any Meezan Bank Branch by showing your original NIC Card and providing NIC Copy to the bank.\nScholarship is paid fiscal yearly basis from 1st July xx to 30 June xx. Student may apply for renewal next year if course continues."},"6":{"tilte":"USEFP Fulbright Scholarship for Masters and PhD","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/usefp-fulbright-scholarship-for-masters-and-phd-scholar-38","discription":"The United States Educational Foundation in Pakistan is now accepting applications for the 2021 Fulbright Student (Master’s and PhD) and Fulbright-Higher Education Commission (HEC) PhD Program, which fully funds graduate study at top universities in the United States.\nFor the Masters degree program, candidates are required to have either a four-year Bachelor's degree or a Bachelor's and Master's combination totaling 16 years of formal education from an accredited university. Recent graduates are strongly encouraged to apply, except for MBA and Public Policy\/Administration applicants, who require 2 years of work experience.\nFor the PhD degree program, eligible applicants need to have a Master's, M.Phil or comparable degree (a minimum of 18 years of formal education) from an accredited university. It is highly desirable that candidates have work experience in teaching, research, or the public sector in Pakistan.\nApplication deadline: May 13, 2020.\nFor application form and details, visit: www.usefpakistan.org\/fulbright\nFor queries, email info@usefpakistan.org\nEligibility Criteria for USEFP Fulbright Scholarship\nPakistani citizens, residing and working in Pakistan, with strong academic histories in all disciplines except clinical medicine are welcome to apply.\nIn addition to academic work, persons selected for Fulbright programs are expected to share information about Pakistani life and culture with their U.S. colleagues and with community groups in the U.S. On returning to Pakistan, Fulbright grantees are expected to share their U.S. experiences with colleagues and community groups in Pakistan. Successful candidates should be poised to assume leadership positions in their fields and must be committed to returning and serving Pakistan.\nIneligibility\n\nPersons with a dual U.S.\/Pakistan nationality or those having a spouse, parent, fiancé or child over 18 years of age who is a U.S. citizen or permanent resident.\nEmployees of the Fulbright organization or the U.S. Department of State and their spouses, fiancés, siblings, dependents, children and parents. For programs funded by their agencies, employees of USAID or the HEC and their spouses, fiancés, siblings, dependents, children and parents.\nAs a general matter, preference for Fulbright student opportunities will be given to candidates who have not previously received a Fulbright student grant.\nPersons already studying in the U.S. or on a work\/residence visa in any country.\n\nHow to apply for Fulbright Scholarship \nA complete application package includes:\n\nAn application form\nThree reference letters\nYour GRE score report and\nScanned transcripts, including an explanation of the grading scale of the university issuing the degree should be uploaded. Please note that HEC-attested documents are preferable with the application but degree and transcripts attested by the issuing authority will be acceptable at the time of application."},"7":{"tilte":"University of Sydney Australia Scholarships 2020 ","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/university-of-sydney-australia-scholarships-2020-scholar-662","discription":"University of Sydney Australia announces fully funded scholarships for Masters and PhD degree at University of Sydney. University of Sydney fully funded scholarship program is open for international students from all over the world. Monthly stipend will also be offered to the selected candidates.\nUniversity of Sydney is Australia's leading university and is known for its research programs and quality of education.\nUniversity of Sydney Postgraduate Scholarships & Ph.D. Scholarship in Australia For International Students 2020 will cover the tuition fees annually with some living allowances. it will be 35000$ per year till the Scholarship tenure which is 3 to 4 years.\nUniversity of Sydney Scholarship Eligibility Criteria\n\nAlready enrolled students or those aspiring to get admission in university of Sydney can apply for this scholarship\nOutstanding academic record\n\nHow to apply for University of Sydney Scholarships \n\nApplications are open all year round, with scholarships awarded all year round.\nCurrent students can apply here.\nCommencing students should select the check box to be considered for research scholarships when completing the admission application for your postgraduate research degree. A separate application is not required."},"8":{"tilte":"Tukiye Scholarships for Undergraduate and Postgraduate in Turkey","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/tukiye-scholarships-for-undergraduate-and-postgraduate-in-turkey-scholar-661","discription":"Turkiye Scholarship is a fully funded undergraduate and postgraduate scholarship program offered by Government of Turkey. Applicants can submit the application directly without getting admission in any Turkey university. The admission process shall start after the award of scholarship Candidates are provided a university and academic program guide through Türkiye Scholarships Information System (TBBS) during their application process. Last date to apply for Turkey scholarships is 20-02-2020 \nThe scholarship program offers programs at the 50 top and most prestigious universities in Turkey, and provides a compulsory one-year Turkish Language Course which ensures that all students acclimatize and adapt to the social and cultural environment they live in. Türkiye Scholarships also provides assistance in all the necessary services and procedures for an international student to feel at home in Turkey. These include, providing a dormitory, health insurance, student bank account, and a student residence permit, as well as a one-year language course.\nTurkiye Scholarship Programs for study in Turkey is open for almost all fields of studies including engineering, health sciences, humanities and social sciences.\nTurkey Scholarship Covers\n\nUniversity and program placement\nMonthly Stipend:\n\n\nMaster’s: 1100 TL per month\nPhD: 1600 TL per month\n\n\n800 TL per month for Bachelor Level\n\n\nTuition Fee\nOnce-off Return Flight Ticket\nHealth Insurance\nAccomodation\nOne year Turkish Language Course\n\nEligibility Criteria for Turkey Scholarships\nMinimum Academic Criteria:\n\nMinimum academic achievement for Bachelor’s degree applicants: 70%\nMinimum academic achievement for Master’s and Doctorate degree applicants: 75%\nMinimum academic achievement for Health Science (Medicine, Dentistry and Pharmacy) applicants: 90%\n\nAge Criteria:\n\nTo be under the age of 21 for Undergraduate programs \nTo be under the age of 30 for Master’s programs\nTo be under the age of 35 for Doctorate programs\n\nHow to apply for Turkiye Scholarship for Study in Turkey\n\nApplications can only be made individually through www.turkiyeburslari.gov.tr by the candidates.\nThere are no institutions or persons authorized to apply for Türkiye Scholarships. \nCandidates are strongly advised to carefully read the instructions and warnings in the application system.\nApplicants are required to submit and upload the necessary documents to the application system.\nApplications delivered by post, courier, or by hand will not be accepted.\n​Applications are free of charge. Please do not entertain any third party institutions or persons who offer to make an application on behalf of you in exchange for a fee.\nTürkiye Scholarships include both scholarship and university placement at the same time. Applicants will be placed in a university and program among their 12 preferences which they choose in the application system\n\nRequired Documents\nAll candidates must submit the following documents during online application:\nA valid National Identification Document OR a valid Passport\nA recent Photo of the candidate (Please note that the photo you upload into the Application system must be a proper portrait of yourself, candidate photos which are not identifiable will undermine the evaluation of your application)\nNational exam scores (required for candidates who do not possess any international qualification or certification)\n\n\nDiploma or temporary certificate of Graduation\n\n\nAcademic transcripts (online screenshots and uncertified transcripts will undermine the evaluation of your application)\n\n\nInternational exam scores (GRE, GMAT, DELF, YDS, YÖS …etc. if required by the chosen university & program)\n\n\nLanguage test scores (if required by the chosen university & program)\n\n\nA research proposal and an example of your written work (for PhD applicants only)\n\n\nFor more information on Application Criteria and Programs Offered"},"9":{"tilte":"South East University China Fully funded MS and PhD Scholarship","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/south-east-university-china-fully-funded-ms-and-phd-scholarship-scholar-660","discription":"Southeast University, China announces Masters and PhD admission and scholarship opportunities for their postgraduate programme 2020. SEU university china scholarship program is a fully funded scholarship which covers all expenses. Applications can be submitted latest by March 31 ,2020. Perspective candidates may apply directly to the SEU online portal http:\/\/fs.seu.edu.cn\/.\nEligibility criteria for SEU Chian Scholarship\n\nApplicants must be non-Chinese citizens in good health\nApplicants for a master's degree must have acquired their bachelor degrees, and should not be older than 35.\nApplicants for a PhD degree must have acquired their master degrees, and should not be older than 40.\n\nDocuments required for scholarship application at SEU china\n\nPassport (The valid period must be more than one year, if you're currently in china, please provide the copies of the first page and the VISA\/resident permit page)\nCertificate of Highest Degree\nIf you are to obtain the higher level of degree before this September, you may provide the official document to prove that\nOfficial Transcript of Academic Records\nHSK 4 and above is needed for most Chinese-taught Programs, HSK5 for medical, MTCSOL and economics. Otherwise, one-year of language learning is required to obtain the certificate\nIf English is not the native language or official language, you are required to provide TOEFL 80\/IELTS 6.0 for English-taught program.\n2 Recommendation Letters\nResearch Proposal no less than 800 words\nPhysical Examination Record of Foreigners\nCertificate of No Criminal Conviction\nSome programs may need other materials. (E.g. Architecture programs asks for the applicant’s portfolio)\n\nHow to apply for Southeast University China Scholarships\n\nAfter you complete the online application, you can log in http:\/\/fs.seu.edu.cn\/ to check your application status\nIf you want to apply for CSC scholarship, additionally you need to do the online application by http:\/\/studyinchina.csc.edu.cn\/\nIf you are admitted, you will be informed of the result by email; and the admission notice and visa application form will be posted to you.\nFor any queries, please write directly to admission@seu.edu.cn or visit https:\/\/www.seu.edu.cn\/english\/ or https:\/\/cis.seu.edu.cn\/\"."},"10":{"tilte":"NEST Nursing Scholarship","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/nest-nursing-scholarship-scholar-659","discription":"National Endowment Scholarship for Talent NEST announces Nursing scholarships 2020. Nursing scholarships are for students enrolled in 4-years BS Nursing, MS Nursing and PhD programs. NEST is an initiative of Ministry of Federal Education and Professional Training Government of Pakistan. NEST scholarships are the first big scholarship opportunity for students of Nursing. NEST is striving to strength the nursing profession by\n\nProving scholarship to BSN students\nProviding scholarship for MSN and PhD for faculty development of Nursing institutions\n\nEligibility Criteria for NEST Nursing Scholarship\nonly those students who have secured admission in partner institutions in undergraduate 4 or 5 years degree program.\nList of partner institutions can be found here\nHow to apply for NEST Nursing Scholarship\n\nStudents are requested to apply on the prescribed application form available at NEST website. \nApplication form is also available at partner institutions websites.\nA dedicated focal person is appointed in each partner institution for facilitating the students. contact the focal person of your institute for further details.\nThe form is to be submitted to the focal person of your respective institute. Applications submitted directly to NEST will not be entertained."},"11":{"tilte":"CM Education Endowment Fund KP CMEEF Scholarship","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/cm-education-endowment-fund-kp-cmeef-scholarship-scholar-106","discription":"Chief Minister's Education Endowment Fund Scholarship 2020 is announced by Government of Khyber Pakhtunkhwa. CMEEF scholarship is a fully funded scholarship for undergraduate and postgraduate students which covers All educational expenses and also offers PKR: 5000\/- Monthly stipend. CMEEF scholarship is a merit-cum-need based scholarship program offered by Higher Education, Archives and Libraries department of Government of Khyber Pakhtunkhwa.\nThe candidates are required to apply directly to the \"Approved Institutes\" for the award of scholarship. List of the approved institutes and disciplines is mentioned in the advertisement.\nChief Ministers Education Endowment Fund Scholarship benefits\n\nAll educational expenses covered\nPKR: 5000\/- Monthly stipend\n\nEligibility Criteria for KP CMEEF Scholarship 2020\n\nKhyber Pakhtunkhwa domicile holders only\nQualified for admission in one of the \"Approved institutions\" as mentioned in the advertisement\nNot in receipt of any other scholarship\nMonthly income of father\/guardian (from all sources) must not exceed PKR: 100,000\/-\nProvision of Bond\/Undertaking\n\nAdditional requirement for Postgraduate students\n\nMinimum 50% marks in GRE\/GAT for MS\/MPhil while 60% score in GRE\/GAT for PhD\nAge must be less than 50 years on last date of receipt of application as advertised by the institute\nMust have 1st class academic career"},"12":{"tilte":"Islamic Development Bank Scholarship","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/islamic-development-bank-scholarship-scholar-8","discription":"Islamic Development Bank has announced scholarship for Undergraduate, Masters and PhD programs for academic year 2020-21. Applications can be submitted online at IsDB website. Islamic Development Bank scholarship is a fully funded program and open for students and scholars from 57 Islamic countries including Pakistan. It covers tuition fee, academic expenses, living expenses and everything.\nIslamic Development Bank Scholarship Covers\nIslamic Development scholarship covers the following benefits and entitlements:\n\nAll academic expenses\nLiving allowances\nHealth Insurance\nRound trip air-tickets to and from place of study\nConference Participation allowance\nScientific Paper preparation allowance\n\nIslamic Development Bank Scholarship program\nStudents and scholars of the following levels can apply:\n\nUndergraduate Scholarship Programme\nMaster Scholarship Programme\nPhD Scholarship Programme\nPost-Doctoral Research Programme\nIsDB\/ISFD Scholarship Programme for Vocational Education and Training (VET)\nJoint Programme with The World Academy of Science (TWAS) in Trieste, Italy for Sustainability Science, Technology and Innovation\n\nIslamic Development Bank Scholarship Eligibility Criteria \nCitizens of any of the IsDB member countries or Muslim communities in non-member countries.\n\nFor Undergraduate\n\nCompleted 12 years education with good grades\n\n\nFor Master\n\nGraduate with a grade above “Good”.\n\n\nFor Ph.D.\n\nHave a Master’s degree in one of the fields of study of the program.\n\n\nFor Post Doc\n\nHave Ph.D. degree in one of the approved fields of the program. Have not less than two (2) years of experience in the field of research.\n\n\nNot in receipt of any other scholarship.\nBe medically fit and willing to undergo medical tests after selection.\n\n \nHow to apply for Islamic Development Bank Scholarship\nApplications can be submitted online at https:\/\/isdbscholarships.smartsimple.com\/s_Login.jsp\nLast date to apply for Islamic Development Scholarship program is February 28, 2020.\n\nEligible Countries: Students of Guinea Bissau, Libya, Malaysia, Nigeria, Oman, Saudi Arabia, Sudan, Suriname, Syria, Togo, Turkey, Uganda, Yemen, Tajikistan, Gabon, Indonesia, Gambia, Guinea, Jordan, Iran, Iraq, Kyrgyz, Lebanon, Maldives, Mali, Mauritania, Morocco, Pakistan, Mozambique, Cameroon, Niger, Palestine, Chad, Cote dIvoire, Brunei, Burkina Faso, Djibouti, Tunisia, Uzbekistan, Qatar, Kuwait, Bahrain, Algeria, Azerbaijan, Benin, Sierra Leone, Kazakhstan, Egypt, Afghanistan, Turkmenistan, United Arab Emirates, Albania, Bangladesh, Somalia, Senegal and Comoros can apply for these scholarships."},"13":{"tilte":"National Bank NBP Student Loan Scheme","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/national-bank-nbp-student-loan-scheme-scholar-86","discription":"National Bank of Pakistan NBP offers student loan scheme to those who cannot afford their higher education. NBP Student loan scheme is for those studying in Undergraduate, Postgraduate and PhD programs and have obtained minimum 70% marks in the previous examination.\nLast date to apply for NBP Loan Scheme is March 05, 2020\nNBP Student Loan Scheme Eligibility Criteria \nUnder the scheme the students are eligible to apply for loans provided:\n\nHe\/She has obtained admission on merit through normal course\/procedure in the approved Universities\/Colleges of the public sector mentioned hereunder.\n He\/She falls at the time of admission within the age bracket of:-\nFor Graduation Not exceeding 21 Years\nFor Post-Graduation Not exceeding 31 Years\nFor Ph.D Not exceeding 36 Years\nHe\/She has secured 70% marks in the last public examination.\nHe\/She has undertaken the study of the subjects given below\nHe\/She is unable to pursue studies due to financial constraints.\n\n The borrower shall repay the loan in monthly installment after six months from the date of first employment or one year from the date of completion of studies, which ever is earlier.\nApproved Subjects for NBP Loan Scheme\n\nEngineering\nElectronics\nOil Gas & Petro-Chemical Technology\nAgriculture\nMedicine\nPhysics\nChemistry\nBiology, Molecular Biology & Genetics\nMathematics\nOther Natural Sciences\nDAWA and Islamic Jurisprudence (LL.B\/LL.M Sharia)\n Computer Science\/Information System and Technology including hardware.\nEconomics, Statistics and Econometrics\nBusiness Management Sciences\nCommerce"},"14":{"tilte":"Saeed Muhammad Scholarship for Baluchistan students","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/saeed-muhammad-scholarship-for-baluchistan-students-scholar-647","discription":"Applicants from all over Baluchistan are invited for Saeed Muhammad (C.E.O FC HARNAI COAL PROJECT) scholarship who want to pursue studies or going to take admission in matriculation, intermediate, Bachelor (2\/4 years or masters\/ M.Phil level (Science\/ Arts) in any of the registered institute of Pakistan. The scholarships are for the academic year of 2020 and 2021in all discipline given by Saeed Muhammad (C.E.O FC Harnai Coal Project). Last date Form submission is January 25, 2020.\nScholarship Grants:\nMatriculation and Intermediate Level\n\nRs.32,000\/- Year\nRs 3,000\/- Monthly Allowance\nRs. 3,000\/- yearly Book Allowance \n\nBachelor and Masters Level\n\nRs. 20,000\/Semester\nRs.4, 000\/Monthly Allowance\nRs.2, 000\/Semester Book Allowance\n\nEligibility Criteria for Saeed Muhammad Scholarship \n\nApplicants must be local\/domicile holder of Baluchistan\nBoth males and females are eligible.\nApplicants must have completed last degree with at least of 45% marks.\nApplicants must be enrolled or having the required academic qualification before March 2020.The scholarship will be awarded in the start of April.\nApplicants must be under 33 years.\nManagement science and O\/A level degree holders are not eligible.\nNote:  scholarships will be awarded on District\/ Division\/ Provisional basis.\nApplicants will be shortlisted only on the basis of Academic test that would be conducted by horizon testing Services. (Separate test centers for females)\nFor more information visit;www.horizonts.org\n\nHow to apply for Saeed Muhammad Scholarship\nApplicants  are  required  to  download  the  application  form  from  HTS  website www.hori zonts.org Fill the form, deposit the test fee in any nearest mentioned bank and submit the form through courier or by Hand to HTS office (office no.21, 2nd floor Meraj Arcade, Opposite to Dr. Manoj Academy, Model Town, Quetta) during office hours 9 am to 4 pm.\nThe SAEED MUHAMMAD (C.E.O FC Harnai Coal Project) reserves the right to increase or decrease the number, amount or period of the scholarship at any stage.\nLast date Form submission is January 25, 2020."},"15":{"tilte":"HEC Chinese Government Scholarship CSC ","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/hec-chinese-government-scholarship-csc-scholar-638","discription":"China Scholarship council CSC offers fully funded scholarships to Pakistani students through HEC for undergraduate, graduate and postgraduate studies in china. China Government is offering CSC scholarships to Pakistani students for Bachelor, Master and PhD programs in china.\nCSC scholarships are available for 289 designated Chinese universities. These are top universities in china which offer a wide variety of academic programs in Science, Engineering, Agriculture, Medicine, Economics, Legal studies, Management, Education, History, Literature, Philosophy and Fine arts for scholarship recipients at all levels.\nNote: For undergraduate students the medium of studies will be Chinese language throughout the degree program after a preparatory course of Chinese Language for one year. ​\nStudents, teachers and scholars desirous to avail Chinese Governmetn Scholarship are required to undertakes Chinese language course.\nDuration:\nChinese Government Scholarship covers both major study and Chinese language (preparatory) study. The table below illustrates the duration of each program.\n\n\n\n\nSupporting Categories\n\n\nMajor Study (including preparatory years)\n( year)\n\n\nChinese Language\n(preparatory study year)\n\n\n\n\nUndergraduate students\n\n\n4-5\n\n\n1-2\n\n\n\n\nMaster's students\n\n\n2-3\n\n\n1-2\n\n\n\n\nDoctoral students\n\n\n3-4\n\n\n1-2\n\n\n\n\n \nHEC Chinese Government CSC Scholarship Covers: \n\nFull Tuition fee\nAccommodation:\nMonthly Stipend: Undergraduate students: CNY 2,500 per month;\nMaster's students\/general scholars: CNY 3,000 per month;\nDoctoral students\/senior scholars: CNY 3,500 per month.\nTravel Expenditure:\n\nEligibility criteria for HEC Chinese Government CSC Scholarships\n\nPakistani \/ AJK National\nBachelor Programs: years of schooling (FA\/ Fsc or equivalent A-level) under the age of 25 years\nFor Master's Programs: Must be a bachelor's degree holder under the age of 35 years .\nFor PhD Programs: A master's degree holder under the age of 40 years\n\nList of Mandatory Documents:\n\nDegrees and Transcripts:\nRecommendation Letters:\nIELTS or HSK Certificates:\nPhysical Medical Examination:\nStudy Plan \/ Research Proposal \/ Motivation letter:\nPassport:\nPicture:\nPolice Clearance Certificate:\n\n \nList of Other Supporting Documents: Not Mandatory But Plus Point:\n\n\nAfter online submission of applications, HEC will ask through email to only shortlisted candidates to submit two sets of following attested documents stapled in spiral binding separately with HEC online application form as under:\n\nCopies of applicant and father's\/Guardian's CNIC.\nCopy of applicant's Domicile.\nCopy of HEC online submitted form.\nAll educational degrees & transcripts from matric to last terminal degree attested by HEC & IBCC.\nChinese online application form\nPre admission letter from Chinese Government Scholarship Universities (Not mandatory)\nLanguage qualification certificate. e.g., HSK certificates, IELTS or TOFEL report (Not mandatory)\nA photocopy of valid passport information page.\nTwo recommendation letters in original. (for Masters & PhD only)\nTwo recent passport size photographs.\nTwo copies of applicant's statement of purpose.\nHealth\/fitness certificate designed by the Chinese quarantine authority can be downloaded from here. The physical examinations must cover all the items listed in the Foreigner Physical Examination Form. Incomplete records or those without the signature of the attending physician, the official stamp of the hospital or a sealed photograph of the applicants are invalid. Please select the appropriate time to take physical examination as the result is valid for only 6 months.\nNon-criminal record from police Department.\nIn case of employment, No Objection Certificate (NOC) from applicant's employer will be required from short listed candidates.\nCertified English Translations of supporting documents (i.e. certificates, testimonials, transcripts) must be submitted for documents that are not in English.\nHard Copies of the applications are not required at this stage. By-hand or incomplete applications shall NOT be entertained in any case.\n\nNote: Applicants who don't have valid passports are advised to apply and get it before February, 2020 as it is mandatory to upload copy of passport at CSC portal. \n\n\nApplication Procedure for HEC CSC Scholarships 2020:\n\nNo manual or incomplete applications on e-portal will be entertained. All applicants must apply online on HEC portal and in Chinese Universities.\nHEC will shortlist eligible applicants on the basis of merit & the number of scholarship slots allocated for Pakistani students. \nIn case of submitting false information at any stage, HEC reserves the rights to cancel and debar for all future scholarships as well as impose penalty, as decided by HEC.\nOnly apply online before the deadline of 5th January 2020, DO NOT send hardcopies of application forms or any other documents to HEC at this stage of application process.\nIt is the sole responsibility of student(s) applying for any professional degree (viz. Medical, Engineering, Agriculture etc.) to first get confirmed its accreditation from the respective Councils i.e. Pakistan Engineering Council (PEC), Pakistan Medical & Dental Council (PMDC), Agriculture Council, & Nursing Council etc.\n \nbsite and retain its printed copy.\nTo apply at Chinese web portal please click the link http:\/\/www.csc.edu.cn\/ or www.campuschina.org \nFor detail instructions about Chinese Govt. Scholarship and applying procedure please follow the link http:\/\/pk.chineseembassy.org\/eng\/zbgx\/cultureservice\/t1633589.htm and fill the Chinese online application carefully.\nSubmit Fees of Rs.300\/- in favour of HEC through HBL online facility. A separate bank Account No. 17427900133401 at HBL, H-9 Branch Islamabad is being maintained for online transfer of fee to HEC from any HBL branch across the country.\n\nHard Copies of the applications are not required at this stage. By-hand or incomplete applications shall NOT be entertained in any case.​\nImportant Note\nKindly note that HEC would forward nominations from Pakistan after shortlisting of potential candidates on merit through a test OR interview OR both. The decision of HEC will be final and binding. Last Date for online application on HEC portal is on or before 5th January, 2020."},"16":{"tilte":"HEC Stipendium Hungaricum Scholarship for Bachelor Masters and PhD","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/hec-stipendium-hungaricum-scholarship-for-bachelor-masters-and-phd-scholar-642","discription":"Higher Education Commission (HEC) Islamabad announces fully funded Hungaricum Scholarships for undergraduates, Masters and PhD Programs.  Hungaricum Scholarship Programme (2020-21) is launched by the Hungarian Government under Higher Education and Scientific Exchange Programme for Bachelors, One-Tier Master's, Masters and PhD studies.\nThe programme is managed by HEC, Pakistan and the Tempus Public Foundation, Hungary.\nSCHOLARSHIP TYPES\nStipendium Hungaricum scholarships are available for\n\nBachelor Degree (after 12 years education)\nOne-Tier Master's Degree (after 12 years education)\nMaster Degree (after 16 years education)\nPhD Degree (after 18 years education)\n\n \nHEC Hungaricum Scholarship Covers\n\nTuition-free education: exemption from the payment of tuition fee\n\n\nMonthly stipend:\n\nBachelors and Masters Scholarships: monthly HUF 43,700\/- (cca EUR 130) Doctoral level: according to the current Hungarian legislation, monthly HUF 140,000\/-(cca EUR 415) for the first phase of education (4 semesters) and HUF 180,000 (cca EUR 530) for the second phase (4 semesters) - for 12 months a year, until completion of studies.\n\n\n\n\nAccommodation: Dormitory place or a contribution of HUF 40,000\/month\nMedical insurance: Health care services according to the relevant Hungarian legislation (Act No. 80 of 1997, national health insurance card) and supplementary medical insurance. \n\nEligibility Criteria for HEC Hungaricum Scholarship\n\nApplicant must be a citizen of Pakistan\/AJ&K.\nMust be between the age of 18-22 years for undergraduate programmes, for which they are applying for admission and the age limit should not exceed from 35 years for postgraduate Master's (18 years) and PhD programs on January 15, 2020. In case of PhD programs, for full time employees of public sector Universities, Colleges and R&D organizations the maximum age must be 40 years on January 15, 2020.\nThe applicant must have completed HSSC\/Intermediate or equivalent for application in Bachelor's (Undergraduate Program) and One-Tier Master's degree.\nThe applicant must have completed 16 years Bachelors\/or equivalent Degree for application in Master's (Postgraduate Program).\nThe applicant must have completed 18 years Degree\/or equivalent for application in PhD Program.\nThe applicant must fill all the fields of the Hungary application form and HEC application form and no column or field should be left unfilled.\nCertificates\/Transcript\/Degrees to be attached must be attested by the attesting authorities such as IBCC and HEC. Equivalence of O & A level from IBCC is mandatory.\nIELTS\/TOEFL scores as required, where applicable.\nAll applicants must submit medical certificate of satisfactory health condition (issued not earlier than 15 November 2019, a written certificate from a physician to prove that the applicant does not have the following illnesses: AIDS, Hepatitis A, B, C or any other epidemic conditions)\nIn case of final selection, applicants will have to submit a bond on legal paper to HEC that he\/she will not change discipline after final award of scholarship, and immediately after completion of his\/her degree, he\/she will return back to Pakistan to serve the country for a period as prescribed by the HEC. In case of failure to do so, HEC reserves the right to recover from candidate or his\/her guarantor, a penalty amount as prescribed\/decided by the HEC.\nApplicants must fulfill all other requirements set by host Hungarian university\/Tempus Public Foundation\/Higher Education Commission of Pakistan.\nIn case of final selection, candidate has to submit a bond agreement with HEC.\n\nHow to apply for HEC Hungaricum Scholarship\n\nApplicants are MANDATORILY required to submit only online applications at the Hungarian and HEC website. Failure to submit online application forms on BOTH submitted websites mentioned at Step (1) & Step (2) will not be considered for further processing.\nHard copies of applications and other documents are not required at the initial stage. However, applicants are required to keep record of all the submitted documents along with printed copies of BOTH application forms (submitted online at HEC & Tempus Public Foundation).\nAt a later stage of the selection process, applicants will be required to submit hard copies (including online application forms submitted at HEC portal with deposit slip & Tempus Public Foundation portal) along with attested photo copies of all the original documents. Original medical certificate and police clearance certificate also need to be submitted."},"17":{"tilte":"Stanford University Knight Hennessy Master and PhD Scholarship in USA","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/stanford-university-knight-hennessy-master-and-phd-scholarship-in-usa-scholar-632","discription":"Stanford University USA is one of the world's top universities. The university is offering fully funded 1000 scholarship for session 2020. The Standford University scholarships are offered under Knight-Hennessy Scholarship program, through which National & International stduents will be sponsored for fully funded Scholarships to study Masters, Ph.D., MS, MBA, MFA, MD, JD degrees at Stanford University. Knight – Hennesy Scholars is on the best scholarship programs in the world. Stanford University is ranked #2 in QS World Universities Ranking 2019. \nKnight-Hennessy Scholars at Stanford University is one of the world's largest fully endowed scholars program. Of the $750 million endowment, more than 80 percent directly supports the graduate.  \nStanford Scholarships are 100 fully funded Scholarships in the United States for those who are leaders in the community doing extraordinary work in any fields along with studies in anywhere in the world.\nSTANFORD UNIVERSITY SCHOLARSHIP PROGRAM DETAILS:\n\nHOST COUNTRY: United States of America\nHOST UNIVERSITY: Stanford University\nCOURSE LEVEL: Fully-funded US Scholarships to study Masters, PhD, MS, MBA, MFA, MD, JD degrees at Stanford University\nNO. OF SCHOLARSHIPS: 100\n\nKnight-Hennessy Stanford Scholarship Benefits \nknight-hennessy Scholarship offers the students over US $45,000\/- per year. The scholarship covers:\n\nFull Tuition \nA Monthly Stipend for living and academic expenses including living expenses, Books, Academic Supplies, Instructional Materials, Local Transportation, and Reasonable personal Expenses\nA Travel Stipend intended to cover an Economy-Class Ticket for one Annual Trip to and from Stanford.\n\nAfter enrolling at Stanford, you may wish to enroll in an additional graduate program. In this case, then you must receive approval from the Knight-Hennessy Scholars program if you wish to access additional funding for the graduate program.\nELIGIBILITY CRITERIA for Knight-Hennessy Stanford Masters and PhD Scholarship:\n\nNational and International studenst, all  citizens from around the globe can apply.. The Program encourages applications to the Knight-Hennessy Scholars program from citizens of all countries.\nYou are eligible to apply if you are applying to enroll in a full-time graduate degree program at Stanford (for example, but not limited to, JD, MA, MBA, MD, MS, or Ph.D.) or if you plan on pursuing one of Stanford’s many joints- and dual- graduate degree options (for example, but not limited to, MD+PhD, JD+MA, MBA+MS).\nNo specific quota is reserved for specific disciplines\nBachelor Degree completion date within last four years. You are eligible to apply if you apply within four years and enroll within five years, after you earn your first\/bachelor’s degree. For the class enrolling in 2019, that means you must have graduated in 2014 or later and must apply in 2018. The Program will select Scholars who enroll at Stanford in 2019 or later.\n\nThose enrolled in Bachelor degree are also eligible to apply, provided they complete their bachelor degree before joining the Stanford University.\nIf you graduated with your first\/bachelor’s degree more than four years ago (in 2013 or earlier), then you are not eligible for consideration as a Knight-Hennessy Scholarship program. This applies even if you have earned an additional degree in 2014 or later.\n\n\nOther Eligibility Requirements. Beyond the eligibility requirements listed above, you are eligible for\n\n \nDocuments required for Knight-Hennessy Stanford Graduate scholarships \n\nOnline Application\nOfficial Transcripts of the degree​\nStandardized Testing Scores\nOne Page Resume\nTwo Recommendation Letters\nEssays\nTow Short-Answer Responses \nVideo Story\n\nHow to apply for Stanford University Graduate Scholarship program \n\nApply separately to the Knight-Hennessy Scholars Program and also to the specific Stanford graduate degree program in which you want to study. University admission is required for the Selection as a Knight-Hennessy Scholar.\nApplication Materials: Carefully review the requirements of the specific department your are intended to apply as different documents are required for different departments at Stanford university.       \nOnline application The application can be submitted online. You must complete the application and submit it online, including:\nAn unofficial or self-reported transcript of your academic performance.\nTest scores required by the graduate program that you are pursuing\nResume\/C.V.: You will include a resume or curriculum vitae that provides an overview of your education, personal activities, and professional experiences.\n Two recommendation letters:\nTwo personal essays\n\nAPPLICATION DEADLINE for Knight-Hennessy scholarship at stanford university :\n\nThe deadline to apply for the 2020 cohort is Wednesday, October 10, 2019, at 1:00 pm Pacific Time.\n\nApply now at https:\/\/knight-hennessy.stanford.edu\/admission\/apply-now"},"18":{"tilte":"HEC Commonwealth scholarships for Master and PhD in UK","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/hec-commonwealth-scholarships-for-master-and-phd-in-uk-scholar-73","discription":"Applications are open for HEC Commonwealth Scholarship for Master and PhD in UK. Commonwealth scholarships are Funded by the UK Department for International Development (DFID). Basic criteria for Commonwealth Scholarships is to offer the higher education opportunities to those who could not otherwise afford their studies in the UK. DFID Is providing around f £1,084 per month or £1,330, (approximately PKR: 250,000 per month) stipend, Return Air Ticket, Children Allowence, Spouse allowence, study tour allowence and much more. \nBenefits of HEC Commonwealth Scholarship for UK \/ FINANCIAL COVERAGE\nThe HEC Commonwealth Scholarship for Master and PhD in UK will cover the following:\n\nStipend (living allowance) at the rate of £1,084 per month or £1,330, (approximately PKR: 250,000 per month )for those at universities in London metropolitan area (rates quoted at 2018\/2019 levels).\nFull tuition fees.\nTwo way ticket to UK (for start of the program and at the end of the program)\nWarm clothing allowance, where applicable.\nTraveling Expense related to study tours\nAir Ticket for field work\nOne Air Ticket for Home country during the studies\nFamily allowances as follows:\nSpouse allowance of £233 per month\nChild allowance of £233 per month for the first child, and £114 per month for the second and third child under the age of 16\nchild allowance of £465 per month for Widow\/Divorced\/single parent the first child, and £114 per month for the second and third child under the age of 16, if you are accompanied by your children and they are living with you at the same address in the UK.\n\nDeadline for submission of HEC online application is September 30, 2019\nProgrammes offered for Commonwealth Master and PhD Scholarships in UK \nCommonwealth Scholarships for Masters and PhD in UK are for candidates from low and middle income Commonwealth countries, for fulltime Masters and Doctoral study (PhD) at a UK University. These scholarships are offered under following six themes:\n\nScience and technology for development\nStrengthening health systems and capacity\nPromoting global prosperity\nStrengthening global peace, security and governance\nStrengthening resilience and response to crises\nAccess, inclusion and opportunity\n\nVisit following links for detailed information \nMasters: http:\/\/cscuk.dfid.gov.uk\/apply\/masters-scholarships\/\nPhD: http:\/\/cscuk.dfid.gov.uk\/apply\/phd-scholarships-least-developed-countries-and-fragile-states\/\nDuration of the Programme\nThe duration of the scholarship program is valid for one year for Master & three years for PhD starting from fall 2020.\nEligibility Criteria for Commonwealth Master and PhD scholarship UK\nThe admission is open under Commonwealth scholarship in United Kingdom for 2020. Basic eligibility requirements are as follow:\nTo apply for these scholarships, you must:\n\nBe a Pakistani AJ&K national & permanent resident of Pakistan AJ&K\nBe available to start your academic studies in the UK by the start of the UK academic year in September October 2020\nFor Master Scholarship, candidate by closing date of application must hold a first class\/first division degree complete in all aspects in graduate qualification (16 years degree i.e. MSC\/MA\/MBA\/BS\/BBA etc) in the relevant field of study.\nFor PhD scholarship, applicant must hold a first class degree in relevant postgraduate qualification (18 and 17 years MS\/MPhil degree) in the relevant field of study by closing date of applications\nNot have any third division throughout your academic career and maximum of two second divisions are allowed but candidate must not have second division in the terminal\/last degree.\nMust apply under one of the themes as mentioned above and on the CSC website and candidate's field of study must be in line with future development needs of Pakistan.\nNOT be registered for a PhD, or an MPhil leading to a PhD, or Masters at a UK university before September\/October 2019 or candidate not have studied at same level in UK before.\nBe unable to afford the study in the United Kingdom without this scholarship\n\n \nApply online at HEC website: http:\/\/eportal.hec.gov.pk\/loa . After registering and filling your profile, please select \"Learning Opportunities Abroad\" under \"Scholarship and Grant\" menu in left hand side panel of the online portal. After that apply online to Commonwealth Scholarship through EAS form for Masters & Doctoral studies (PhD) through Electronic Application System (EAS) at:\n\nMasters: https:\/\/fs29.formsite.com\/m3nCYq\/iy6rpgiqua\/form_login.html\nPhD: https:\/\/fs29.formsite.com\/m3nCYq\/je4otvtpus\/form_login.html\n\nAll the applications for Masters\/PhD without submitting both EAS Application form and online HEC form will not be entertained in any case.\n\nSave your HEC online application & Commonwealth online application after successful submission to relevant portals.\nHardcopies of HEC application form (alongwith relevant academic documents viz. transcripts, equivalence for foreign degree, statement of purpose, study\/research plan, copies of CNIC, Domicile) & submitted Commonwealth scholarship forms may be kept saved. They will be taken from shortlisted candidates only\n\nDo not send your hardcopies of applications at this stage.\nDisclaimer: Applicants for applying Commonwealth scholarship are advised to submit their online application on Commonwealth EAS Scholarship portal first. After submission of EAS form, applicants must also apply on HEC online application portal http:\/\/eportal.hec.gov.pk\/hec-portal-web\/auth\/login.jsf.\nPlease note that if any applicant could not submit online application through both HEC e-portal and CSC EAS portal, applications will not be considered for further processing."},"19":{"tilte":"King Abdulaziz University Saudi Arabia fully funded Scholarship for Master","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/king-abdulaziz-university-saudi-arabia-fully-funded-scholarship-for-master-and-phd-scholar-630","discription":"King Abdulaziz university Saudi Arabia KAU KSA provided fully funded scholarship for Master and PhD degrees. The scholarship is open for all International students. KAU Scholarships are offered in all fileds of studies including Natural Sciences, Engineering, IT, Humanities, Arts, Business Administrations.\nBenefits of King Abdulaziz UniversityKAU Saudia Arabia Scholarship\n\nA Monthly stipend Of Sr 1,900\nA Monthly Bursary Sr 1000 (A Research Assistant Without Summer Time ), the Contact Applies For One Semester Only Between The Deanship Of Graduate Studies And The Student And In Case Of The Two Parties’ Desire To Contract For Another Semester.\nSr 1,800 preparation Allowance, for the First Time\nMedical Facilities \/ Health Care\nAccommodation\nSubsidized Meals\nSr 4,000 for Ph.D., And Sr 3,000 for Masters Allowance for thesis\nSr 2,700 Allowance Of For Shipping Books (When Graduated).\nTwo-Way Ticket Annually\n\nKing Abdulaziz University Scholarship 2020 Details\nCountry: Saudi Arabia\nUniversity: King Abdulaziz University\nCourse Level: Masters, Doctorate Degree.\nFinancial Coverage: Fully Funded\nDeadline: Open All Year (Screening Two Times in a Year)\n \nEligibility Criteria & Requirements for Master and PhD KAU Fully Funded Scholarship\n\nMaximum Age 35 Years for PhD programs and maximum 30 Years for masters\nMust Have a University Degree From an Accredited College or University and Should Have a Degree With “very Good” at Least.\nApproved exam in English is required for those whose First Language is Not English. The Approved Exams and Minimum Required Scores Are Listed Below:\n\nTOEFL (PBT)=500\nTOEFL (CBT)=173\nTOEFL (IBT)=61\nIELTS=5\n\n\nMust Have a Record of Good Conduct and\nMedically Fit.\nMust not have been dismissed from any University throughout the academics.\n\nRequired Documents\n\nCV Of the applicant.\nStatement of purpose. SOP must be in English for all programs except in Islamic Studies and Arabic Language.\nA copy of graduation certificate (certified from Saudi Embassy of home country).\nA copy of transcript (certified from Saudi Embassy of home country).\nRecommendation letters from two former professors.\nA copy of a passport valid for at least one year.\n\nDeadline \/ Scholarship Schedule\nThere is No Deadline for the King Abdulaziz University Scholarship in Saudi Arabia. Students can apply throughout the year for KAU Scholarships. The Screening Process is held twice a Year.\nHow to Apply For the King Abdulaziz University Master and PhD Fully Funded Scholarship\nApplicants Can Apply Online through the Application Portal. The link of the Online Portal is Given below with the official Advertisement.\nCLICK HERE FOR ONLINE APPLICATION PORTAL https:\/\/ags.kau.edu.sa\/outpsgadm\/INDEX.ASP\n \nList of Programs \/ Disciplines for PhD Scholarships at KAU\nFaculty of Arts & Humanities\nARABIC LANGUAGE AND LITERATURE & ISLAMIC LAW AND STUDIES(Must have certificate for Arabic language ), SOCIOLOGY , INFORMATION SCIENCE\nFaculty of Science\nBIOLOGY, STATISTICS,  CHEMISTRY, BIOCHEMISTRY, MATHEMATICS, PHYSICS, ASTRONOMICAL SCIENCES \nFaculty of Engineering\nCIVIL ENGINEERING, THERMAL ENGINEERING AND DESALINATION, MINING ENGINEERING, ELECTRICAL AND COMPUTER ENGINEERING, CHEMICAL ENGINEERING, AERONAUTIC ENGINEERING, MECHANICAL ENGINEERING\nFaculty of Meteorology, Environment Arid Land Agriculture\nARID LAND AGRICULTURE,  ENVIRONMENTAL SCIENCES, METEOROLOGY, HYDROLOGY AND WATER RESSOURCES MANAGEMENT.\nFaculty of Marine Science\nMARINE BIOLOGY, MARINE PHYSICS, MARINE CHEMISTRY, MARINE GEOLOGY\nFaculty of Environmental Design\nURBAN AND REGIONAL PLANNING\nFaculty of Computing & Information Technology\nCOMPUTER SCIENCE\nList of Disciplines for M.Sc Scholarships at KAU Saudi Arabia\nFaculty of Arts & Humanities\nARABIC LANGUAGE AND LITERATURE, ISLAMIC LAW STUDIES, SOCIOLOGY, PSYCHOLOGY, INFORMATION SCIENCE , INGLISH LANGUAGE,HISTORY\n Faculty of Economics and Administration\nACCOUNTING, BUSINESS ,PUBLIC ADMINISTRATION, ECONOMICS.\n Faculty of Science\nBIOLOGY,  CHEMISTRY, BIOCHEMISTRY, MATHEMATICS, PHYSICS, ASTRONOMICAL SCIENCES \nFaculty of Engineering\nTHERMAL ENGINEERING AND DESALINATION, MINING ENGINEERING, ELECTRICAL AND COMPUTER ENGINEERING, MEDICAL ENGINEERING, CHEMICAL ENGINEERING, AERONAUTIC ENGINEERING, PRODUCTION ENGINEERING & MECHANICAL SYSTEM DESIGN, INDUSTRIAL ENGINEERING\nFaculty of Meteorology, Environment Arid Land Agriculture\nARID LAND AGRICULTURE,  ENVIRONMENTAL SCIENCES , HYDROLOGY AND WATER RESSOURCES MANAGEMENT\nFaculty of Marine Science\nMARINE BIOLOGY, MARINE PHYSICS, MARINE CHEMISTRY, MARINE GEOLOGY\nFaculty of Environmental Design\nURBAN AND REGIONAL PLANNING, Architecture\nFaculty of Computing & Information Technology\nCOMPUTER SCIENCE, INFORMATION TECHNOLOGY, INFORMATION SYSTEM\n \nKing Abdulaziz Offers Fully Funded Scholarships for International Students in Saudi Arabia.\nAll the Expenses will be covered by the University."},"20":{"tilte":"Khalifa University UAE Scholarship for Master and PhD","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/khalifa-university-uae-scholarship-for-master-and-phd-scholar-631","discription":"Applications are now open to apply for the Khalifa University Scholarship 2020 in the United Arab Emirates invites applications for fully funded scholarships for Masters and PhD programs. Khalifa University is one of the best university in UAE, Abu Dhabi and is offering the best scholarship around the globe for international students. Monthly stipend is over 8,000-10,000 AED which is around 350,000 to 420,000\/- Such a huge amount is offered to the scholars, which is even better than getting a job.\nKhalifa University is offering Scholarships for Masters, Ph.D  and Doctor of Medicine for Spring 2020. This fully funded Scholarship in UAE covers all educational expenses.\nThe scholarship is offered for a wide range of disciplines, and is available for all the International Students from around the world and Nationals of UAE.\nKhalifa University Scholarship 2020 Details\n\nCountry: UAE, Abu Dhabi\nCourse Level: Master, Ph.D and Doctor of Medicine\nEligible Regions: All Nationalities\nFinancial Coverage: Fully Funded\nMonthly Stipend: AED 8000 to 10,000\nDeadline: 1st Oct 2019\n\nKhalifa University UAE Scholarship Deadline:\nThe Last date to apply for the Khalifa University Scholarship in UAE is 1st October 2019\nKhalifa University Scholarship UAE for Master and Phd Programs Covers\nKhalifa University is the Best University in UAE and is offering Scholarships for international students in Abu Dhabi. The stipend it is offering is perhaps better than salary of a well paid job. The Scholarship in UAE will cover all Necessary Educational Expenses & Monthly Expenses.\n\nMonthly Stipend for Master programs: AED 8,000 (around 350,000 PKR)\nMonthly Stipend for PhD programs: AED 10,000 (around 420,000 PKR)\nFull Tuition fee\nMedical Insurance Coverage for students under the Khalifa University visa.\nSupport to attend International Research Conferences\n\nRequired Documents for Khalifa University Scholarships\n\nDetailed CV\nCertified Copy of Bachelors and \/or Master Degree Certificate\nOfficial transcripts\nEquivalency certificate issued by the UAE Ministry of Education for applicants that have graduated from institutions outside of the UAE\nStatement of Purpose (500 to 1,000 words)\nTwo Recommendation Letter\nResearch Statement (500 to 1,000 words – Ph.D. applicants only)\nEnglish language proficiency score certificate (IELTS, TOEFL or EmSAT). Official TOEFL score reports can be sent directly by your institution to Khalifa University of Science and Technology using the institutional TOEFL code 0960.\nGraduate Record Examination (GRE) score report. Official score reports can be sent directly to Khalifa University of Science and Technology using the institutional GRE code 0822.\nPassport sized photograph on a White Background.\nValid passport. International applicants who reside in the UAE should also upload a clear copy of their valid UAE visa.\nFamily Book (Khulasat Al Qaid – UAE National applicants only).\nValid UAE national ID card (for national and international applicants who currently reside in the UAE).\n\nKhalifa Universtiy Scholarship Eligibility Criteria\nMaster’s Degree Program Applicants:\n\nBachelor degree in relevant subject\nEnglish Proficiency Certificate\nA minimum of two referee recommendations (provided via online form).\nStatement of purpose (500-1,000 words).\nAdmission interview\n\nDoctorate Degree Program Applicants:\n\nMasters degree in Relevant subject\nA minimum of two referee recommendations (provided via online form)\nStatement of purpose (500-1,000 words)\nResearch statement (500-1,000 words)\nAdmission interview\n\n \nHow to Apply for Khalifa University Scholarships UAE for Master and PhD Programs\nApplications for the Khalifa University Scholarships are Accepted Online. You have to Apply Online through the Graduate Admission Portal. The Official Advertisement is given below.\nTo apply online:  https:\/\/www.ku.ac.ae\/ug-pg-admissions\/ \nOfficial Scholarship Link: https:\/\/www.ku.ac.ae\/admissions\/graduate-admissions\/#Overview3e35-94a2\n \nAvailable Discipline for Master and PhD scholarships at Khalifa Universtiy UAE.\nInternational students can avail the scholarship in one of the following fields at Khalifa University UAE:\nCollege of Medicine and Health Sciences:\n\nDoctor of Medicine (MD)\n\nCollege of Engineering\n\nMaster of Science in Chemical Engineering\nMaster of Science in Electrical and Computer Engineering\nMaster of Science in Engineering Systems and Management\nMaster of Science in Sustainable Critical Infrastructure\nMaster of Science in Water and Environmental Engineering\nMaster of Science by Research in Engineering\nMaster of Engineering in Health, Safety, and Environmental Engineering\nMaster of Science in Computing and Information Science\nMaster of Science in Information Security\nMaster of Science in Materials Science and Engineering\nMaster of Science in Mechanical Engineering\nMaster of Science in Nuclear Engineering (offered for UAE and Saudi nationals only)\nMaster of Science in Petroleum Engineering\n\nDoctor of Philosophy in Engineering\n\nAerospace Engineering\nBiomedical Engineering\nChemical Engineering\nCivil Infrastructure and Environmental Engineering\n\n\nElectrical and Computer Engineering\nEngineering Systems and Management\nMaterial Science and Engineering\nMechanical Engineering\nNuclear Engineering (offered for UAE and Saudi nationals only)\nPetroleum Engineering\nRobotics\nMultidisciplinary Engineering\n\nCollege of Arts and Sciences\n\nMaster of Arts in International and Civil Security (Program offered to UAE Nationals only.)\nMaster of Science in Applied Chemistry\nMaster of Science in Petroleum Geoscience\nDoctor of Philosophy in Petroleum Geoscience"}}