{"1":{"tilte":"Richard E. Morley Industrial Automation Scholarship","link":"https:\/\/www.scholarshipportal.com\/scholarship\/richard-e-morley-industrial-automation-scholarship","discription":"HomeScholarshipsRichard E. Morley Industrial Automation ScholarshipRichard E. Morley Industrial Automation ScholarshipMaster, Bachelor20% reduction on your overall course tuition fees31 December 2020Visit Scholarship WebsiteThere are multiple scholarships available. Please visit the website for more detailed information.\nThe value is a 20% reduction in your overall course tuition fees.\nThe scholarships are available for the following pathways:\n\nBachelor of Science (Industrial Automation Engineering)\nMaster of Engineering (Industrial Automation)\n\nEligibility\nMust be a commencing student studying the Bachelor of Science (Industrial Automation Engineering) or Master of Engineering (Industrial Automation) course with EIT online or on-campus.\nMust meet or exceed the English Language Proficiency requirement for the specific course of study.\nMust meet all other entry requirements for the course + at least a minimum result of 70% in all Mathematics units achieved in the highest level of education completed.\nMust be a full fee-paying student, without existing scholarships. Students can apply for multiple scholarships, but will only be awarded one scholarship.\n\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >IELTSTo apply for most scholarships, you have to speak English. To test your English language proficiencySchedule an IELTS test >Benefits\nThe scholarship value is equal to a 20% reduction on the total course tuition.\nThe scholarship discount will be divided evenly across the total amount of units in the course and applied each semester to each unit being undertaken, not in a lump sum.\nThe scholarship only covers tuition fees and does not cover any other non-tuition fees or expenses.\nStudents must successfully pass all units attempted each semester\/term otherwise the scholarship will be revoked by EIT.\n\nApplicationPlease complete and submit the Scholarship Application form along with your course application\nCut-off date for scholarship applications is 1 month prior to the start date of the course.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"2":{"tilte":"Attorneys.org Legal Scholarship – 2020","link":"https:\/\/www.scholarshipportal.com\/scholarship\/attorneys-org-legal-scholarship-2020","discription":"HomeScholarshipsAttorneys.org Legal Scholarship – 2020Attorneys.org Legal Scholarship – 2020Master, Bachelor$1,00011 December 2020Visit Scholarship WebsiteAttorneys.org is proud to offer a $1000 scholarship for those interested in learning more about the law and our legal system. Please write a 500 word essay telling us why you are interested in the law, criminal justice or forensics. Your essay can include life events and other key influences, career plans or anything else that contributes to your interest.\nEligibilityRequirements\n\nOpen to high school, college and grad school students interested in or currently studying law, criminal justice or forensics\nMinimum 3.0 GPA\nSend us an email with your transcript and essay, please find the email address online.\nYou accept that your name and\/or essay may be published on our website and social media if chosen as the recipient\n\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >IELTSTo apply for most scholarships, you have to speak English. To test your English language proficiencySchedule an IELTS test >BenefitsThe $1,000 scholarship will go to a student's educational expenses.\nApplicationPlease visit the website for more information about the application process.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"3":{"tilte":"2020 CIMON INC. SCHOLARSHIP","link":"https:\/\/www.scholarshipportal.com\/scholarship\/2020-cimon-inc-scholarship","discription":"HomeScholarships2020 CIMON INC. SCHOLARSHIP2020 CIMON INC. SCHOLARSHIPMaster, Bachelor, Phd$10001 December 2020Visit Scholarship WebsiteAt CIMON Inc, we are proud to offer a scholarship program for students in the process of pursuing a college degree. The awarded student will receive $1,000 to be used towards expenses for his or her degree.\nEligibilityU.S. citizen accepted to or currently attending a college or university within the United States obtaining a degree in the STEM field. The winner will be required to provide proof of acceptance to your college or university, or a college transcript.\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >IELTSTo apply for most scholarships, you have to speak English. To test your English language proficiencySchedule an IELTS test >BenefitsThe awarded student will receive $1,000 to be used towards expenses for his or her degree.\nApplicationPlease visit our website for more information.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"4":{"tilte":"$1000 Essay Scholarship Program","link":"https:\/\/www.scholarshipportal.com\/scholarship\/1000-essay-scholarship-program","discription":"HomeScholarships$1000 Essay Scholarship Program$1000 Essay Scholarship ProgramMaster, Bachelor, CourseZouton is offering $1000 scholarship20 September 2020Visit Scholarship Website$1000 Scholarship shall be available to all the students looking to pursue further in the USA for a graduate or post-graduate program.\n\nThe scholarship would be awarded annually, and students will be shortlisted based on their performance in the essay.\nThe content should be original and a non-plagiarised piece.\nThe applicant can submit only one application form.\nThe decision of the sponsor will be the final binding.\n\nEligibility\nThe applicant should be 18 years or older at the time of enrolment.\nCandidate should be enrolled in an approved undergraduate\/ post-graduate course in a reputed US educational institute.\nThe applicant should submit an essay that is void plagiarism and includes the following points.\n\n\nWhy do you want to study in the US?\nWhy do you need this scholarship?\nHow will the scholarship benefit you?\nHow are you better than other applicants?\n\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >IELTSTo apply for most scholarships, you have to speak English. To test your English language proficiencySchedule an IELTS test >Benefits\nValue of scholarship to be awarded - $1000\nOnly one winner will be selected for awarding the scholarship prize.\nThe scholarship prize is a cash-only scholarship and no cash equivalent.\nEase the finances of studying in the USA with this scholarship by simply enrolling yourself for the competition and submitting your best creative inputs in the form of the essay.\n\nApplicationPlease visit our website and fill in the form given online.\nThe scholarship will be available on the following conditions:\n\nTaxes will be deducted as per section 194B of the Income Tax Act, India.\nThe submission of application form implies that the applicant has agreed upon the terms and conditions along with the official rules set by the sponsor.\nThe applicant needs to submit an essay that is original with regard to the content and is written in English language only.\n\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"5":{"tilte":"$1,500 Annual Essay Writing Contest Scholarship","link":"https:\/\/www.scholarshipportal.com\/scholarship\/1-500-annual-essay-writing-contest-scholarship","discription":"HomeScholarships$1,500 Annual Essay Writing Contest Scholarship$1,500 Annual Essay Writing Contest ScholarshipMaster, Bachelor, Phd, Course$1000 and $50031 May 2020Visit Scholarship WebsiteIvyPanda.com provides $1500 in scholarships annually for talented students who demonstrate mastery of essay writing. Scholarships will be awarded to two winners: the winner will receive $1,000; the runner-up prize is $500.\nEligibilityWe will accept submissions from current high school, college, or university students from any country. The winners will be required to send us proof of their academic status or enrollment.\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >IELTSTo apply for most scholarships, you have to speak English. To test your English language proficiencySchedule an IELTS test >BenefitsScholarships will be awarded to two winners: the winner will receive $1,000; the runner-up prize is $500.\nApplicationSubmission requirements\n\nWrite an essay on one of the following topics:\nContribution of Technology in Education\nIs Studying Abroad Worth It?\nShould Video Games Be Used in Education?\nYour essay must:\nHave a word count of 500-700 words (excluding title, header, and works cited page)\nBe written in the US or UK English\nBe 100% plagiarism-free\nBe submitted in .doc or .docx format\nFollow MLA style to format the paper and cite sources (download our MLA checklist to check your formatting)\nHave three or more sources cited on the Works Cited page\nThe filename should be [IvyPanda Writing Contest_Last Name]\nFollow our Facebook, Twitter or Instagram: like and share the post with the contest description pinned on our social media pages.\nSend us an email with:\n\n\nYour essay\n\n\nThe screenshot proving that you followed our social media\n\n\nThe screenshot of the post with the contest description shared on your social media\n\n\nThe answer to the question: “Where did you find out about the IvyPanda Contest?”\n\n\n\n\nEach participant may submit only one essay and win just one award.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"6":{"tilte":"The Katoni scholarship - Supporting cultural projects","link":"https:\/\/www.scholarshipportal.com\/scholarship\/the-katoni-scholarship-supporting-cultural-projects","discription":"HomeScholarshipsThe Katoni scholarship - Supporting cultural projectsThe Katoni scholarship - Supporting cultural projectsMaster, Bachelor, PhdDKK 10,0001 May 2020Visit Scholarship WebsiteThe Katoni scholarship is given annually to one or more person(s) who need financial support for their education, internship or work within the cultural area.\nThe purpose of the scholarship is to support Danes and foreign nationals working particularly to strengthen the culture in Denmark and across borders.\nThe scholarship is granted by Katoni who is also responsible for choosing the scholarship recipient(s). The scholarship is given to researchers, students and former students at educational institutions all over the world. It is given to Danes or foreign nationals with a special connection to Denmark – for instance in relation to their education or work.\nThe application deadline is May 1, 2020. All applications are considered individually, and the receiver of the scholarship will be contacted directly on September 1, 2020.\nCulture includes, but is not limited to, communications, language, fashion, arts, traditions, etc.\nThis is a scholarship byKatoniDen bedste danske online shoppingportal. På Katoni.dk finder du et stort udvalg af cool design og mere end 100.000 varer. Start din shopping på nem vis her.EligibilityThe scholarship is given to researchers, students and former students at educational institutions all over the world. It is given to Danes or foreign nationals with a special connection to Denmark – for instance in relation to their education or work.\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >IELTSTo apply for most scholarships, you have to speak English. To test your English language proficiencySchedule an IELTS test >BenefitsThe Katoni scholarship is given annually to one or more person(s).\nThe amount is DKK 10,000.\nApplicationWhat to include in your application:\n\nFull name\nAddress\nPhone number\nEmail address\nEducational institution\nDiplomas\/certificates\nResume\nMotivated application stating why you should receive the Katoni scholarship\n\nSend your application to us via email.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"7":{"tilte":"Writing Contest Scholarship 2020","link":"https:\/\/www.scholarshipportal.com\/scholarship\/writing-contest-scholarship-2020","discription":"HomeScholarshipsWriting Contest Scholarship 2020Writing Contest Scholarship 2020Master, Bachelor, Phd, Course2000$31 May 2020Visit Scholarship WebsiteOne of our goals is to motivate students to improve their writing skills and practice in making successful papers. You can accept a challenge and take part in our scholarship essay contest. Create a strong paper and receive a fine reward with us!\nEligibilityWe invite graduate and undergraduate high school students to take part in our essay contest. We have no limitations on age, race, or gender. Our scholarship application can be completed by anyone.\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >IELTSTo apply for most scholarships, you have to speak English. To test your English language proficiencySchedule an IELTS test >BenefitsOur three winners will get cash prizes. Plus, the best papers will be published on our website and on social media (if we get permission from the author).\n**Scholarship Fund\n**Three authors from the winning essays will get cash prizes:\n\n1st place - $1000\n2nd place - $600\n3rd place - $400\n\nApplicationMake sure you have discovered our rules before taking part in the scholarship essay contest:\n\nStudents of high schools, including undergraduate and graduate candidates, can take part in our scholarship essay contest.\nSend your finished essay to us via email with Essay Writing Contest 2020 in the email’s subject to participate.\nYour paper must be written in English only.\nPlease make sure your essay contains 600-1200 words.\nWe can accept only one essay from one applicant.\nIf your document contains any kind of plagiarism, it's a reason to disqualify a candidate from our competition immediately.\n\n**Deadlines\n**Please pay attention to these deadlines before submitting your essay:\n\nDates: Starting date: March 1st, 2020; closing date: June 1st, 2020; last submission date: May 31st; announcement date: June 4th, 2020.\nNote: after the deadline no essays won’t be considered.\n\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"8":{"tilte":"Scholarship for the Best Candidates - Kozminski University","link":"https:\/\/www.scholarshipportal.com\/scholarship\/scholarship-for-the-best-candidates-kozminski-university","discription":"HomeScholarshipsScholarship for the Best Candidates - Kozminski UniversityScholarship for the Best Candidates - Kozminski UniversityMaster, Bachelor56% of semester tution - An equivalent of 7500 PLN15 July 2020Visit Scholarship WebsiteThis scholarship is dedicated to all candidates applying to Kozminski University's Bachelor or Master programs.\nThis is a scholarship byKozminski UniversityStudia Warszawa :: Zarządzanie, Prawo, Finanse i rachunkowość, Administracja, Europeistyka, Socjologia, Psychologia. Studia magisterskie, doktoranckie, licencjackie, podyplomowe. Studia MBA.EligibilityCandidates for Bachelor programs conducted in English:\nAdmission is based on the results of the matriculation exam (matura) in three written subjects chosen by the candidate among all of the subjects in the examination.\nQualifying points are calculated based on the percentage of results from the matriculation certificate (nowa matura) as follows:\n\n1% at the basic level = 1.5 points\n1% at the advanced level = 2 points\n1% at the advanced level of Mathematics = 3 points\n\nGrades obtained as result of the \"old matriculation\", International Baccalaureate system or a foreign high school diploma are also converted into qualifying points.\nCandidates who have reached the minimum level of 350 points will be admitted to Kozminski University programs until the enrollment limit for chosen program is reached.\nCandidates who have achieved at least 470 qualifying points have the possibility to apply for the \"Scholarship for the Best Candidates\". The online application form for these candidates is available in the admission office.\nThe awarded candidates are chosen based on a ranking system.\nThe candidates, who were granted a scholarship will be informed about it at the latest on July 31st.\nCandidates for Master programs conducted in English:\nAdmission for full-time and part-time Master programs at Kozminski University is based on 2 criteria: GPA on your previous studies and results of an online entry test. The maximum score is 100 points - 50 points for the test and 50 for GPA. Candidates who scored at least 60 points from both criteria will be qualified for the program.\nCandidates, who have achieved at least 80% of the points from the entry test will have have the possibility to apply for the \"Scholarship for the Best Candidates\".\nThe online application form for these candidates is available in the admission office.\nThe awarded candidates are chosen based on a ranking system.\nThe candidates, who were granted a scholarship will be informed about it at the latest on July 31st.\nCandidates for the Master in Big Data Science Program:\nAdmission for full-time and part-time Master programs at Kozminski University is based on 2 criteria: GPA on your previous studies and results of an online entry test. The maximum score is 100 points - 50 points for the test and 50 for GPA. Candidates who scored at least 60 points from both criteria will be qualified for the program.\nCandidates who have achieved at least 80% of the points from the entry test will have have the possibility to apply for the \"Scholarship for the Best Candidates\". The online application form for these candidates is available in the admission office.\nFollowing the application process, the student will need to take part in an online test, which will be taken under consideration for the scholarship.\nThe awarded candidates are chosen based on a ranking system.\nThe candidates, who were granted a scholarship will be informed about it at the latest on July 31st.\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >IELTSTo apply for most scholarships, you have to speak English. To test your English language proficiencySchedule an IELTS test >Benefits56% of the semester tuition. The 56% is an equivalent of 7500 PLN\nApplicationThe online application form for the candidates, which fulfill the before mentioned requirements is available in the admission office.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"9":{"tilte":"Breast Cancer Car Donations Annual College Scholarship","link":"https:\/\/www.scholarshipportal.com\/scholarship\/breast-cancer-car-donations-annual-college-scholarship","discription":"HomeScholarshipsBreast Cancer Car Donations Annual College ScholarshipBreast Cancer Car Donations Annual College ScholarshipMaster, Bachelor, Phd$1000 (1 winner) $250 (2 winners)15 August 2020Visit Scholarship WebsiteWith an increasingly complex and demanding world, successful solutions to our nation’s (and our world’s) problems require a solid education. As a leader in nonprofit fundraising, Breast Cancer Car Donations sees, up close, the many issues facing today’s society.\nWhat better way to help combat these problems then to help pave the way for tomorrow’s leaders?\nTo put our money where our mouth is, we are announcing the Breast Cancer Car Donations Annual College Scholarship – supporting students pursuing STEM-related degrees.\nEligibilityTo qualify, undergraduate students must be majoring in a STEM field of study (or related field) as well as attending an accredited college or university.\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >IELTSTo apply for most scholarships, you have to speak English. To test your English language proficiencySchedule an IELTS test >Benefits$1000 (1 winner) $250 (2 winners)\nApplicationTo apply, please submit the entire application form on our website.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"10":{"tilte":"The Manchester Full-time MBA Scholarships","link":"https:\/\/www.scholarshipportal.com\/scholarship\/the-manchester-full-time-mba-scholarships","discription":"HomeScholarshipsThe Manchester Full-time MBA ScholarshipsThe Manchester Full-time MBA ScholarshipsMaster£10,000 - £44,0001 June 2020Visit Scholarship WebsiteEvery year, we support the most talented MBA candidates through merit-based scholarships. Please visit our website to view our full range of scholarships.\nEligibilityOur scholarships take into account academic credentials, professional track record, and communication and interpersonal skills. We also look for strong values and ethics, and the potential to become an outstanding business leader or entrepreneur and future ambassador for the School.\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >IELTSTo apply for most scholarships, you have to speak English. To test your English language proficiencySchedule an IELTS test >BenefitsOur scholarships allow the most talented applicants the opportunity to benefit from the Manchester MBA experience.\nApplicationPlease visit our website to view the application process and deadlines for our range of Full-time MBA scholarships.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"11":{"tilte":"Mrs Prindables Future Educator Scholarship","link":"https:\/\/www.scholarshipportal.com\/scholarship\/mrs-prindables-future-educator-scholarship","discription":"HomeScholarshipsMrs Prindables Future Educator ScholarshipMrs Prindables Future Educator ScholarshipMaster, Bachelor$1,00020 August 2020Visit Scholarship WebsiteMrs Prindables is offering a 2020 Scholarship opportunity for incoming or current college students majoring in education. We believe that educators have the power to spark positive development in student’s lives and their futures.\nDeadline is 8\/20\/2020 for submissions. Recipient will be notified via email on or about 8\/26\/2020.\nThe scholarship award is to be used exclusively for school tuition or related expenses. A check for $1,000 will be made payable to the award recipient’s college or university. The recipient is expected to submit receipts in accordance with IRS regulations.\nThis is a scholarship byMrs Prindables Gourmet Caramel ApplesBuy Gourmet Caramel Apples and decadent confections at www.mrspindables.com.EligibilityMust Be A Incoming or current student pursuing education\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >IELTSTo apply for most scholarships, you have to speak English. To test your English language proficiencySchedule an IELTS test >Benefits$1,000 Prize\nApplicationFill out the form below and upload either your transcripts or acceptance letter. Then tell us why you want to be an educator. What do you believe you have to offer the students of our future?\nSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"12":{"tilte":"Eliminate The Stigma Scholarship","link":"https:\/\/www.scholarshipportal.com\/scholarship\/eliminate-the-stigma-scholarship","discription":"HomeScholarshipsEliminate The Stigma ScholarshipEliminate The Stigma ScholarshipMaster, Bachelor, Phd$1,00031 August 2020Visit Scholarship WebsiteWhile CBD has helped so many different people across the world, it still carries a negative stigma. We know there are many students out there who are passionate about CBD oil and we want to hear\/promote their stories to help combat the stigma. We're looking for students to submit a piece advocating for CBD oil. The piece can be in the format of:\n\nA poem\nA photo\nA video\nAn animation\nAn essay\nA graphic\n\nSubmissions must be received by August 31st.\nEligibilityThe scholarship is open to all US citizens entering or attending an accredited college or university. Applicants must maintain a GPA of 3.0 or higher. In addition to submitting an advocacy piece, students must also submit the following documents:\n\nA completed scholarship application form\nA certified copy of transcripts\n\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >IELTSTo apply for most scholarships, you have to speak English. To test your English language proficiencySchedule an IELTS test >BenefitsThe winning student will be awarded a $1,000 check made payable to the student's school.\nApplicationApplications and submissions can be sent to outreach@greenwellnesslife.com. Submissions must be received by August 31st.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"13":{"tilte":"2020 iPlum Scholarship","link":"https:\/\/www.scholarshipportal.com\/scholarship\/2020-i-plum-scholarship","discription":"HomeScholarships2020 iPlum Scholarship2020 iPlum ScholarshipMaster, Bachelor, Phd, Course$10001 December 2020Visit Scholarship WebsiteAt iPlum we are proud to offer a scholarship program for students in the process of pursuing a college degree. The awarded student will receive $1,000 to be used towards expenses for his or her degree.\nThis is a scholarship byiPlumiPlum provides a separate second phone line for US, Canada or 800 Toll-free on your mobile with domestic & international calling, texting, voicemail.EligibilityU.S. Citizen accepted to or currently attending a college or university within the United States.\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >IELTSTo apply for most scholarships, you have to speak English. To test your English language proficiencySchedule an IELTS test >Benefits$100 to use for school tuition or related expenses.\nApplicationPlease visit our website for more information about the application process.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"14":{"tilte":"2020 Performance Based Results Scholarship","link":"https:\/\/www.scholarshipportal.com\/scholarship\/2020-performance-based-results-scholarship","discription":"HomeScholarships2020 Performance Based Results Scholarship2020 Performance Based Results ScholarshipMaster, Bachelor$1,00030 November 2020Visit Scholarship WebsiteAt Performance Based Results, we are proud to offer a scholarship program for students in the process of pursuing a college degree. To be considered for the Performance-Based Scholarship you must submit a 200 - 500-word piece about why you want to pursue a degree in business. The awarded student will receive $1,000 to be used towards expenses for his or her degree.\nThis is a scholarship byPaul CherryWe only deliver intense, customized sales effectiveness training for teams and managers that motivates your organization to close more sales.EligibilityU.S. citizens accepted to or currently attending a college or university within the United States. The winner will be required to provide proof of acceptance to your college or university or a college transcript.\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >IELTSTo apply for most scholarships, you have to speak English. To test your English language proficiencySchedule an IELTS test >BenefitsA scholarship award of $1,000.\nApplicationPlease apply for the scholarship through our website.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"15":{"tilte":"Accurate Metal Fabricating Scholarship","link":"https:\/\/www.scholarshipportal.com\/scholarship\/accurate-metal-fabricating-scholarship","discription":"HomeScholarshipsAccurate Metal Fabricating ScholarshipAccurate Metal Fabricating ScholarshipMaster, Bachelor$50030 November 2020Visit Scholarship WebsiteAt Accurate Metal Fabricating, we are proud to offer a STEM scholarship program for students in the process of pursuing a college degree. The awarded student will receive $500 to be used towards expenses for his or her degree.\nThis is a scholarship byAccurate Metal FabricatingAccurate Metal Fabricating is the trusted name in precision sheet metal fabrication. We are committed to delivering top quality products and services.EligibilityU.S. citizens accepted to or currently attending a college or university within the United States. The winner will be required to provide proof of acceptance to your college or university or a college transcript.\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >IELTSTo apply for most scholarships, you have to speak English. To test your English language proficiencySchedule an IELTS test >BenefitsScholarship reward of $500.\nApplicationPlease apply through our website via the application page.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"}}