{"0":{"tilte":"EhtiyatCorona: Pakistan’s digital influencers fight virus misinformation\n","link":"https:\/\/www.dawn.com\/news\/1542602\/ehtiyatcorona-pakistans-digital-influencers-fight-virus-misinformation","img":"https:\/\/i.dawn.com\/medium\/2020\/03\/5e75928782819.jpg","discription":"KARACHI: “Know the facts and don’t make false assumptions,” a four-minute video titled Karo Na Awareness has generated over 57,000 views within a few hours on YouTube. As Pakistan reported three deaths and over 470 cases on Friday, the video’s creator Bekaar Films is not the only profile to suddenly become the voice of public health on social media. With many people now working from home, online platforms have become up-to-the-second hubs of information (often coupled with medical misinformation) about the pandemic.   Amid viral falsehoods, a group of nearly 200 influencers in assistance with the Prime Minister Office is working to keep the public well-informed.   “Hi guys. From now I’ll be sharing the Corona Virus updates which are authentic and coming directly from Ministry of Health to me. I request you to please don’t share any fake news because it can cause panic. #ehtiyatcorona,” read a post by Laraib Mehtab, who has following of 18,000 people on Twitter. Speaking to Dawn, Laraib clarified the team was working directly with the PM Office instead of the federal health ministry. “There is a lot of inauthentic information out there, including viral totkas like eating ice cream can cause corona.” Amid viral falsehoods, some 200 influencers working to keep the public well-informedIn order to be part of the group, an influencer should have a following of over 10,000 followers on a social media platform (preferably Instagram, YouTube, Twitter and TikTok). Besides sharing updates, they produce creative content around a public campaign — such as one encouraging people to stay home labelled #GharParRohana. Supported, not funded“More than ever, there is a public hunger for credible information. To counter viral myths and fake news, we are utilising leading influencers who create content based on official advisories and updates from the government,” Muzamil Hasan, the network leader told Dawn. The influencers part of the network said while the ‘volunteer’ initiative was supported by the PM Office, the project was unpaid. “It is an initiative started and led by the influencers themselves. The PM Office is just helping them on official updates from the centre as well as provincial and rebutting false information,” Prime Minister’s Focal Person on Digital Media Arslan Khalid told Dawn. “Tweet updates posted by media outlets and tickers are often taken out of context and create confusion or panic. The public needs to be explained things. That’s what we are doing. This is a work in progress,” shared Muzamil. Muzamil, who has 86.9k followers on Instagram, started the Covid coverage while working with the PM’s Digital Pakistan team and reporting updates directly from the “war room” established at the Ministry of National Health Services Regulation and Coordination.   Last week, Tania Aidrus shared a picture of the command and control centre at the health ministry and shared the war room had been set up where technology volunteers could collaborate with Zafar Mirza and his team. “The federal health ministry is actively helping the network disseminate official information,” Muzamil added.   Fact-check risksAccording to Salman Parekh, a participating influencer — the group shares three types of content: official information (mostly regarding case numbers, and government announcements), public interest articles and material, and myth busters that is verified by the PM Office and other credible sources. “The messaging has been limited to the admins to restrict flow of information in the [WhatsApp] group. People share their concerns with us privately to verify. If there is a medical question for instance, then we ask medical experts. No information is posted by admins without verification from relevant officials,” he told Dawn. The influencers research major pet-peeves and concerns in the community and find verified information to convince the public on Covid precautions. The idea of the group, he said, was to create public interest content that was culturally relevant. “Our audience is local and so using our understanding we come up with content that addresses viral myths. For example, we have also created content based on vetted hadiths by religious experts to share with people who use religion to disregard all corona advisory,” said Salman.Published in Dawn, March 21st, 2020"},"1":{"tilte":"SBP waives digital transaction charges\n","link":"https:\/\/www.dawn.com\/news\/1542048\/sbp-waives-digital-transaction-charges","img":"https:\/\/i.dawn.com\/medium\/2020\/03\/5e72df2815e76.jpg","discription":"KARACHI: In light of the coronavirus pandemic, the State Bank of Pakistan (SBP) on Wednesday waived all charges on fund transfers through online banking channels to avoid the use of cash.The move aims to minimise use of cash to contain the spread of virus amongst the bank staff and customers.Moreover, under the guidelines issued by the SBP, customers using ATMs or visiting bank branches for transferring large amounts will not incur any cost.The central bank also advised the financial sector “to immediately facilitate education fee and loan repayments through internet banking or mobile devices.”“The objective of these measures is to reduce the need for visiting bank branches or the ATMs and to promote use of Digital Payment Services such as internet banking, mobile phone banking etc,” said the SBP in a statement.The central bank also advised banks to ensure availability of all the alternate delivery channels including ATMs, POS, internet banking, payment gateways, mobile banking and call centres for customers at all times.Published in Dawn, March 19th, 2020"},"2":{"tilte":"Tech platforms in joint effort to curb virus misinformation\n","link":"https:\/\/www.dawn.com\/news\/1541762\/tech-platforms-in-joint-effort-to-curb-virus-misinformation","img":"https:\/\/i.dawn.com\/medium\/2020\/03\/5e71836803441.jpg","discription":"WASHINGTON: The large US internet platforms have unveiled a joint effort to root out misinformation about the coronavirus pandemic, while Facebook announced a $100 million programme to aid small firms impacted by the crisis.A joint statement was issued late on Monday by Facebook, Google, Twitter, Microsoft and Reddit along with Google-owned YouTube and Microsoft-owned LinkedIn.“We are working closely together on COVID-19 response efforts,” the joint statement said.“We’re helping millions of people stay connected while also jointly combating fraud and misinformation about the virus, elevating authoritative content on our platforms, and sharing critical updates in coordination with government healthcare agencies around the world.“We invite other companies to join us as we work to keep our communities healthy and safe.” Separately on Tuesday, Facebook announced it was offering $100 million to help small businesses in 30 countries cope with the economic impacts of the coronavirus pandemic.The social networking giant said it will be giving cash grants and ad credits to as many as 30,000 enterprises.“We’ve listened to small businesses to understand how we can best help them,” chief operating officer Sheryl Sandberg said on her Facebook page.“We’ve heard loud and clear that financial support could enable them to keep the lights on and pay people who can’t come to work.”In a related move, Facebook agreed to offer $1 million to its partners in the International Fact-Checking Network working on the COVID-19 related misinformation with a budget of $1 million.Published in Dawn, March 18th, 2020"},"3":{"tilte":"Social media giants warn of AI moderation errors as coronavirus empties offices\n","link":"https:\/\/www.dawn.com\/news\/1541600\/social-media-giants-warn-of-ai-moderation-errors-as-coronavirus-empties-offices","img":"https:\/\/i.dawn.com\/medium\/2020\/03\/5e706b9169be5.jpg","discription":"Alphabet Inc’s YouTube, Facebook Inc and Twitter Inc warned on Monday that more videos and other content could be erroneously removed for policy violations, as the companies empty offices and rely on automated takedown software during the coronavirus pandemic.In a blog post, Google said that to reduce the need for people to come into offices, YouTube and other business divisions are temporarily relying more on artificial intelligence and automated tools to find problematic content.Such software is not always as accurate as humans, which leads to errors, it added, however. And “turnaround times for appeals against these decisions may be slower,” it said.Facebook followed suit, saying it would work with contract vendors this week to send home all content reviewers home indefinitely, with pay.The social media company drew public criticism last week for asking policy enforcers to continue coming to work, as it lacks secure technology to conduct moderation remotely.Facebook also said the decision to rely more on automated tools, which learn to identify offensive material by analysing digital clues for aspects common to previous takedowns, has limitations.“We may see some longer response times and make more mistakes as a result,” it said.Twitter said it too would step up use of similar automation, but would not ban users based solely on automated enforcement, because of accuracy concerns.The three Silicon Valley internet services giants, like many companies worldwide, have asked employees and contractors to work from home if possible, to slow the fast-spreading respiratory disease. Mass gatherings for sports, cultural and religious events have been cancelled globally.Google said human review of automated policy decisions also would be slower for other products and phone support would be limited."},"4":{"tilte":"Government to set up media wing to lead digital diplomacy\n","link":"https:\/\/www.dawn.com\/news\/1541439\/government-to-set-up-media-wing-to-lead-digital-diplomacy","img":"https:\/\/i.dawn.com\/medium\/2020\/03\/5e7038c82da73.jpg","discription":"KARACHI: The Pakistan Tehreek-i-Insaf (PTI) government has decided to set up a 23-member media team to devise and lead strategy around digital diplomacy, Dawn has learned.  According to prime minister’s focal person on digital media Dr Arslan Khalid, the cabinet had three weeks ago approved the allocation of a supplementary grant of Rs42.791 million during the current financial year for creation of a digital media wing at the Ministry of Information and Broadcasting.  Media reports on Monday suggested that the digital media wing would be responsible for defending over social media any decision made by the government while also dealing with critics of the ruling PTI and explaining policies of the Imran Khan-led administration.  Refuting the claims, the PM’s focal person said the reports were misleading and the digital media wing had a broader mandate. “The wing, apart from promoting the government’s initiatives, will work on social media diplomacy, debunking fake news and optimisation of the digital media strategies, including advertising for campaigns,” Mr Khalid told Dawn.  The government, he added, had also chalked out a social media policy for its departments. The team will ensure that the policy is fully implemented.  In terms of breakdown, the 23-member digital media wing will comprise a general manager, a digital media consultant, five digital communication officers, three video editors, two videographers, one photographer, four graphic designers, five content writers and one digital feed manager.  The general manager, according to the job description document available with Dawn, will work at the Press Information Department and will be responsible for implementation of the digital media strategy for all government departments working under the PID.  Besides managing content from all ministries, the strategy will involve plans to structure and build digital advertising, as well as verification of social media accounts of the government.  The digital consultant, on the other hand, will be responsible for liaising with PTV and digital desk of media houses to ensure coverage of government events and announcements.  The five digital communication officers will work in the ministries of finance, poverty alleviation and health, information, foreign and interior. The communication officer working in the foreign ministry will also be tasked with promoting tourism.  The PM’s focal person said recruitment would be public and an ad would be placed this week.Published in Dawn, March 17th, 2020"},"5":{"tilte":"Chatbot launched to address coronavirus concerns\n","link":"https:\/\/www.dawn.com\/news\/1541440\/chatbot-launched-to-address-coronavirus-concerns","img":"https:\/\/i.dawn.com\/medium\/2020\/03\/5e70376cdd934.jpg","discription":"KARACHI: Head of the prime minister’s ‘Digital Pakistan’ initiative Tania Aidrus on Monday announ­ced that the government has launched a chatbot to address common concerns and give information regarding the COVID-19 outbreak. The Digital Pakistan team has created the tool to support the health emergency efforts by providing an online triage in infection diagnostics.   “Our team wanted to build an effective way to get information out to Pakis­tanis. We’ve launched a chatbot to address common concerns on #Coronavirus. You can find labs near you and even do a quick test to assess your risk of #Coronavirus. Please try it out!” the former Google executive wrote on Twitter. To access the chatbot, a user can message the Face­book page of Ministry of National Health Service, Regulations and Coordina­tion (NHSRCOfficial) on Messenger and get started. The chatbot allows messaging in both Urdu and English languages.  The technology answers questions about the symptoms, ways to protect yourself, risk assessment, and shares information about nearest labs for the coronavirus test.  The chatbot is powered by artificial intelligence that answers basic questions about the virus and if a user wants to assess if they need a COVID-19 test or not, it will recommend testing based on questions such as “do you have fever above 100?”, “do you have cough?”, “have you travelled in the last 14 days?” or  if you have “pre-existing conditions”.  Besides the chatbot, Ms Aidrus said the government was using data and technology to ‘get ahead of the coronavirus’.  “We’re using data analytics techniques and cutting edge technology to get ahead of the #Coronavirus. We’re trying to modernize and streamline data collection from the frontlines. We have some of the best @CodeforPakistan engineers available in Pakistan volunteering their support,” she wrote. On Monday, the Digital Pakistan head said a national dashboard had been set up for the public to access data around COVID-19 in real time. “I’d like to thank @CodeForPakistan for setting up the national dashboard in such short notice. We now have a holistic view of the active cases from across the country. This will aid in providing timely and data driven decisions as the situation changes in real time. #CoronaVirus,” she tweeted on Monday. The dashboard can be accessed on the National Institute of Health’s (NIH) official website.Published in Dawn, March 17th, 2020"},"6":{"tilte":"French anti-trust regulator fines Apple $1.2bn\n","link":"https:\/\/www.dawn.com\/news\/1541478\/french-anti-trust-regulator-fines-apple-12bn","img":"https:\/\/i.dawn.com\/medium\/2020\/03\/5e70561ce7dd6.jpg","discription":"PARIS: France’s competition watchdog on Monday fined iPhone maker Apple 1.1 billion euros ($ 1.23 billion), saying it was guilty of anti-competitive behaviour towards its distribution and retail network.The fine, the biggest ever levied by the French antitrust body, comes at a time of heightened scrutiny on US tech giants by European regulators, who have been delving into the firms’ powerful market position, the tax they pay, and how they protect consumers’ privacy.Apple said it would appeal the watchdog’s ruling, which it said was at odds with legal precedent in France.In its decision, the French regulator said Apple imposed prices on retail premium resellers so that the prices were aligned with those charged by the California firm in its own shops, or on the Internet.The watchdog said Apple’s two wholesalers in France fully followed the US company’s instructions on how to allocate its products to customers, instead of freely determining their commercial policy.“Apple and its two wholesalers agreed not to compete with each other and to prevent distributors from competing with each other, thereby sterilising the wholesale market for Apple products,” the watchdog said in a statement.The two wholesalers, Tech Data and Ingram Micro, were fined 76 million and 63m euros respectively, the authority said. Tech Data had no immediate comment to make and Ingram Micro could not immediately be reached.“The French competition authority’s decision is disheartening,” Apple said in a statement announcing it planned to appeal.“It relates to practices from over a decade ago and discards 30 years of legal precedent that all companies rely on with an order that will cause chaos for companies across all industries.” Since her nomination as the head of the French competition authority, Isabelle de Silva has set her sights on US tech companies, including Alphabet Inc’s Google, which was fined 150m euros ($167m) for opaque advertising rules.Published in Dawn, March 17th, 2020"},"7":{"tilte":"Microsoft co-founder Bill Gates leaves board\n","link":"https:\/\/www.dawn.com\/news\/1540851\/microsoft-co-founder-bill-gates-leaves-board","img":"https:\/\/i.dawn.com\/medium\/2020\/03\/5e6c7e940b203.jpg","discription":"Microsoft on Friday announced that co-founder Bill Gates has left its board of directors to devote more time to philanthropy.The 64-year-old stopped being involved in day-to-day operations at the firm more than a decade ago, turning his attention to the foundation he launched with his wife, Melinda.Gates served as chairman of Microsoft's board of directors until early in 2014 and has now stepped away entirely, according to the Redmond-based technology giant.\"It's been a tremendous honour and privilege to have worked with and learned from Bill over the years,\" Microsoft chief executive and company veteran Satya Nadella said in a release.\"Bill founded our company with a belief in the democratising force of software and a passion to solve society's most pressing challenges, and Microsoft and the world are better for it.\"Nadella said Microsoft would continue to benefit from Gates' \"technical passion and advice\" in his continuing role as a technical advisor.\"I am grateful for Bill's friendship and look forward to continuing to work alongside him,\" Nadella said.Gates left his CEO position in 2000, handing the company reins to Steve Ballmer to devote more time to his charitable foundation.He gave up the role of chairman at the same time Nadella became Microsoft's third CEO in 2014.Regularly listed among the world's richest people, William H. Gates was a geeky-looking young man when he and Paul Allen co-founded Microsoft in 1975.Gates grew up in Seattle with two sisters. His father William was an attorney and his late mother Mary was a schoolteacher and chairwoman of United Way International.He began programming computers as a 13-year-old student and fell in love with the machines.Among the tales told about Gates is that while working on school computers, he tinkered with programming to put himself in classes made up mostly of girls.With his parents' blessing, Gates dropped out of Harvard to start \"Micro-soft\" with his late childhood friend Allen.A key move was to focus on licensing software to computer makers in numerous \"partnerships\" that resulted in affordable machines being available to the masses.As the personal computer market grew, Microsoft became the world's top software company. Its virtual monopoly led to a much-publicised antitrust trial, in which the company managed to avert a break-up but had to endure years of government monitoring.Gates went on to turn his attention from software to fighting disease and other humanitarian challenges with his wife, under the auspices of the Bill and Melinda Gates Foundation.\"This move is not surprising to the Street as Gates has continued to focus more on his myriad of philanthropies across the globe over the past decade,\" Wedbush analyst Daniel Ives said in a note to investors.\"Gates is a historic figure in the technology world and his legacy at Microsoft will be felt in Redmond for decades to come.\""},"8":{"tilte":"Bill Gates expresses interest to invest in IT, health sectors in letter to prime minister: PTI\n","link":"https:\/\/www.dawn.com\/news\/1456262\/bill-gates-expresses-interest-to-invest-in-it-health-sectors-in-letter-to-prime-minister-pti","img":"https:\/\/i.dawn.com\/medium\/2019\/01\/5c34f55386c80.jpg","discription":"The Pakistan Tehreek-i-Insaf (PTI) official Twitter account on Tuesday announced Bill Gates' interest \"to invest in the IT sector\" which he had reportedly communicated in a letter written to Prime Minister Imran Khan.According to the tweet: \"The letter also stated that Bill and Melinda Gates Foundation is interested in investing in the health sector of Pakistan.\" Bill Gates' letter to the prime minister was delivered by Dr Christopher Elias, President of the Bill and Melinda Gates Foundations Global Development Division, who along with Director General World Health Organisation (WHO) Dr Tedros Adhanom Ghebreye, met with the premier today in Islamabad, APP reported.The prime minister asserted Pakistan's commitment to tackle polio eradication as a national public health emergency. Briefing Dr Elias and Dr Ghebreye on the government's effort to this end, the premier said that polio vaccination activities were well organised, held in close collaboration with provincial governments and directly overseen by the national, provincial and divisional task forces.He expressed the hope that WHO would continue as a reliable partner to bring improvement in Pakistan's healthcare.Dr Ghebreye said that WHO had increased its focus on public health and its country-level impact. He said WHO now has an increased emphasis on improving people's access to health related information.The prime minister was briefed regarding the ongoing programmes and projects WHO is implementing in PakistanWHO has considerably increased the level of support in Pakistan, mainly in the area of polio eradication."},"9":{"tilte":"Social media giants warn of AI moderation errors as coronavirus empties offices\n","link":"https:\/\/www.dawn.com\/news\/1541600\/social-media-giants-warn-of-ai-moderation-errors-as-coronavirus-empties-offices","img":"https:\/\/i.dawn.com\/medium\/2020\/03\/5e706b9169be5.jpg","discription":"Alphabet Inc’s YouTube, Facebook Inc and Twitter Inc warned on Monday that more videos and other content could be erroneously removed for policy violations, as the companies empty offices and rely on automated takedown software during the coronavirus pandemic.In a blog post, Google said that to reduce the need for people to come into offices, YouTube and other business divisions are temporarily relying more on artificial intelligence and automated tools to find problematic content.Such software is not always as accurate as humans, which leads to errors, it added, however. And “turnaround times for appeals against these decisions may be slower,” it said.Facebook followed suit, saying it would work with contract vendors this week to send home all content reviewers home indefinitely, with pay.The social media company drew public criticism last week for asking policy enforcers to continue coming to work, as it lacks secure technology to conduct moderation remotely.Facebook also said the decision to rely more on automated tools, which learn to identify offensive material by analysing digital clues for aspects common to previous takedowns, has limitations.“We may see some longer response times and make more mistakes as a result,” it said.Twitter said it too would step up use of similar automation, but would not ban users based solely on automated enforcement, because of accuracy concerns.The three Silicon Valley internet services giants, like many companies worldwide, have asked employees and contractors to work from home if possible, to slow the fast-spreading respiratory disease. Mass gatherings for sports, cultural and religious events have been cancelled globally.Google said human review of automated policy decisions also would be slower for other products and phone support would be limited."},"10":{"tilte":"Internet giants fight spread of coronavirus untruths\n","link":"https:\/\/www.dawn.com\/news\/1536767\/internet-giants-fight-spread-of-coronavirus-untruths","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e5609a59c763.jpg","discription":"As the new coronavirus spreads globally, the online battle to keep misinformation about the disease is also stepping up.Google, Facebook and other platforms are struggling to keep ahead of scammers, trolls, and others with ill intent who routinely use major tragedies or disasters as opportunities to swindle or manipulate people.\"The public concern about coronavirus is being used as a vehicle to get people to transmit misinformation and disinformation,\" said University of Washington biology professor Carl Bergstrom.Internet companies took part in a meeting with the World Health Organization last week at Facebook offices in Silicon Valley to discuss tactics such as promoting reliable information and fact-checking dubious claims about the coronavirus referred to as COVID-19.\"(We must) combat the spread of rumors and misinformation,\" WHO Director General Tedros Adhanom Ghebreyesus told AFP recently.\"To that end, we have worked with Google to make sure people searching for information about coronavirus see WHO information at the top of their search results.\"Google search ranks authoritative sources higher when people are seeking information on health and labels results or news stories that have been fact-checked.Ghebreyesus said that social media platforms including Twitter, Facebook, Tencent and TikTok have also taken steps to limit spread of misinformation about coronavirus.Facebook said in a recent online post that it is focusing on claims which, if relied on, could increase the likelihood of someone getting sick or not getting proper treatment.\"This includes claims related to false cures or prevention methods — like drinking bleach cures the coronavirus - or claims that create confusion about health resources that are available,\" Facebook head of health Kang-Xing Jin said in the post.\"We will also block or restrict hashtags used to spread misinformation on Instagram, and are conducting proactive sweeps to find and remove as much of this content as we can.\"Bergstrom said some virus misinformation is \"people trying to sell snake oil products\" such as bogus cures or treatments, while others use attention-grabbing deceptions to drive online traffic that yields money from advertising.Misinformation is also spread by \"actors\" out to fuel distrust for the establishment in China or foment societal instability overall, according to Bergstrom.\"There's appetite for up-to-date, real-time information,\" said Jevin West, co-author of a book on misinformation with Bergstrom.\"These actors can take advantage of that; things with crazier scenarios are more likely to be clicked on than the report from that doctor at WHO trying to calm down the fears.\"Facebook said that when users seek information related to the virus, the social network will show \"educational pop-up\" boxes with information considered credible.Facebook is also giving free advertising credits to organisations running coronavirus education campaigns.Google-owned video sharing platform YouTube has been modifying policies and products for several years to remove harmful content and give priority to authoritative content deemed trustworthy.\"We currently do not allow content promoting dangerous remedies or cures, like videos which claim that harmful substances or treatments can have health benefits,\" YouTube said.YouTube last year began providing links to reliable information along with videos on \"subjects prone to misinformation,\" and added coronavirus to that list.Social media giants have also beefed up ranks of fact-checkers, hiring outside parties such as AFP News Wire, to sort truth from fiction, even if there are questions on their effectiveness.A recent study published in the journal Science Advances suggested fact-checking did little to stem the tide of misinformation about other epidemics such as Zika, Ebola and yellow fever.The researchers said that \"current approaches to combating misinformation and conspiracy theories about disease epidemics and outbreaks may be ineffective or even counterproductive,\" and could even cause \"collateral\" damage by undermining trust in fact-based disease information.Bergstrom and West questioned whether social media giants optimized for virality could stem the tide of disinformation and deceit.\"Social media company claiming it's active participant in the fight against misinformation is like (tobacco maker) Philip Morris saying they're active participant in the fight against lung cancer,\" Bergstrom said."},"11":{"tilte":"Hyundai and Kia bet on London start-up for electric cars\n","link":"https:\/\/www.dawn.com\/news\/1528678\/hyundai-and-kia-bet-on-london-start-up-for-electric-cars","img":"https:\/\/i.dawn.com\/medium\/2020\/01\/5e20307617995.jpg","discription":"South Korea's Hyundai and its Kia affiliate announced plans on Thursday for a major investment in London-based start-up Arrival to produce next generation electric vehicles that cost less than standard engine models.The $110 million bet on the five-year-old technology firm comes as some manufacturers abandon Britain because of uncertainties about how it will trade with European Union nations once it leaves the bloc this month.Arrival is focused on designing and producing so-called Generation 2 electric vehicles, which are environmentally friendly cars made from scratch rather than being retrofitted, standard engine production models.“Generation 2 vehicles are assembled using small footprint micro-factories, located in areas of demand and profitable at thousands of units,” the three companies said in a joint statement.Hyundai and Kia have a shared ownership structure but target slightly different markets and demographics.“The eco-friendly vehicle market in Europe is expected to grow rapidly due to reinforcement of environmental regulations,” said head of the Hyundai Research and Development Department Albert Biermann.“This strategic partnership will empower our companies to scale Generation 2 electric vehicles globally.”Arrival said its models “are priced the same, or less than, current fossil fuel vehicles, making the decision to switch to electric inevitable”.The company employs 800 people globally and has offices in western Europe and the United States as well as in Israel and Russia.Hyundai sells around 4.5 million vehicles a year worldwide and Kia around 3 million.Both companies manufacture a range of hybrid and electric models."},"12":{"tilte":"Nokia launches world’s first smartphone with a unique five camera array in Barcelona\n","link":"https:\/\/www.dawn.com\/news\/1466373\/nokia-launches-worlds-first-smartphone-with-a-unique-five-camera-array-in-barcelona","img":"https:\/\/i.dawn.com\/medium\/2019\/03\/5c78da987beaa.jpg","discription":"HMD Global, home to Nokia phones, announced four new Android smartphones in Mobile World Conference '19 that took place in Barcelona on February 24. This includes the world’s first smartphone with a unique five camera array, the Nokia 9 PureView. From Nokia 9 PureView to the Nokia 210, the company’s most affordable internet enabled feature phone, the brand believes consumers will now have a wider range of Nokia devices taking up different price tags.Phones launched at the event1. Nokia 9 PureView: Nokia 9 PureView features a distinct five camera array with ZEISS Optics to put next generation computational imaging technology into the hands of advanced photography enthusiasts. 2. Nokia 4.2: The phone brings flagship imaging features like multi-camera imaging to a new price point, with a dual depth-sensing rear camera ready to capture memories. 3. Nokia 3.2: The Nokia 3.2 features an impressive 6.26” HD+ display for a great viewing experience.4. Nokia 1 Plus: The Nokia 1 Plus’s auto focus rear camera capture minute details and the front camera comes enhanced with the ‘beautify feature’. 5. Nokia 210: The Nokia 210 has a crucial role in the Nokia phone line-up as an affordable internet device and comes in a durable, inherently coloured polycarbonate shell to reduce appearance of finger marks. New accessories' line-upNokia also introduced two wireless charging solutions in its portfolio: the Nokia Wireless Charger and Nokia Portable Wireless Charger. Both devices support the universal Qi charging standard, and can work with compatible wireless charging devices, including the Nokia 9 PureView and Nokia 8 Sirocco.The Nokia Wireless Charger supports fast 10-watt wireless charging, making it perfect for a quick top up when at home or in the office. Availability in Pakistan Nokia 3.2 will be available in Pakistan from May at a retail price of Rs27,000.Nokia 1 Plus will be available in Pakistan from March at a retail price of Rs15,300.Nokia 210 will be available in Pakistan from March at a retail price of Rs5,500.Prices of the other two devices will be revealed at a later stage.Commenting on the unveiling of this line-up of devices, Florian Seiche, Chief Executive Officer, HMD Global, said, “We’ve had a phenomenal response from consumers to our entire portfolio, thanks to our unique approach to Android, delivering a pure, secure and always up-to-date experience. We have delivered on this commitment, changing the smartphone ownership paradigm by offering an experience that only gets better over time. Today, with these new phones, we are taking a leap forward by delivering the very latest innovations from Google across our entire portfolio.” "},"13":{"tilte":"Sarmayacar bets on mobile gaming by investing in Revolving Games\n","link":"https:\/\/www.dawn.com\/news\/1534007\/sarmayacar-bets-on-mobile-gaming-by-investing-in-revolving-games","img":"https:\/\/i.dawn.com\/medium\/2020\/02\/5e438b6416e6e.jpg","discription":"Revolving Games, a brainchild of brothers Ammar Zaeem and Shayan Zaeem who have a decade of mobile game development experience under their belt, is set to launch its first game next year, said Sarmayacar — a venture capital firm for tech startups — in a press statement. Revolving Games is developing a massively multiplayer online game, bringing together some of the world’s best gaming leadership, with development and design capabilities from a San Francisco office while benefiting from cost advantages that come with operations being primarily based out of Lahore, said the statement. Kyle Bricker, the executive producer at the San Francisco Studio, brings 25 years of experience in product and software. After an injection of $12 million from a global publishing giant and a seed investment led by Sarmayacar, Revolving Games is moving towards the launch of its first game in 2021.“Pakistan’s young engineering talent has the potential to make the country into a game development hub within the global gaming ecosystem,\" said Rabeel Warraich, founder and CEO of Sarmayacar.\"Revolving Games is a startup that has 10 years of hard work behind it [...]. Our team consists of veteran rock stars that have designed, engineered and produced games that generated over $3 billion in lifetime revenue,” said Ammar.Shayan, who is the president of Worldwide Studios, added, “We have spent almost a decade training talent in Pakistan, this type of a boutique game studio model is helping our Pakistan team grow at 5x the rate than it previously did in any other partnership.\" Ammar and Shayan, along with their brother Saad previously founded Caramel Tech Studios, a leading game studio that originated in Pakistan.Sarmayacar is a Netherlands-based venture capital firm that invests in budding tech-based startups with the aim to help build \"scalable, market-transforming enterprise and consumer technology businesses in Pakistan\", according to its website. The company's clients include local startups like Bykea, Dot & Line and Patari, among others."},"14":{"tilte":"Scientists reveal first-ever image of a black hole\n","link":"https:\/\/www.dawn.com\/news\/1475180\/scientists-reveal-first-ever-image-of-a-black-hole","img":"https:\/\/i.dawn.com\/medium\/2019\/04\/5cadf80e3d1d3.jpg","discription":"Scientists on Wednesday revealed the first image ever made of a black hole, depicting its hot, shadowy edges where light bends around itself in a cosmic funhouse effect. Assembling data gathered by eight radio telescopes around the world, astronomers created the picture showing the violent neighborhood around a supermassive black hole, the light-sucking monsters of the universe theorized by Einstein more than a century ago and confirmed by observations for decades. It looked like a flaming orange, yellow and black ring. “We have seen what we thought was unseeable. We have seen and taken a picture of a black hole. Here it is,” said Sheperd Doeleman of Harvard. Read: New map of universe shows 300,000 more galaxiesJessica Dempsey, a co-discoverer and deputy director of the East Asian Observatory in Hawaii, said it reminded her of the powerful flaming Eye of Sauron from the “Lord of the Rings” trilogy. Unlike smaller black holes that come from collapsed stars, supermassive black holes are mysterious in origin. Situated at the center of most galaxies, including ours, they are so dense that nothing, not even light, can escape their gravitational pull. This one's “event horizon” the point of no return around it, where light and matter begin to fall inexorably into the abyss is as big as our entire solar system. Three years ago, scientists using an extraordinarily sensitive observing system heard the sound of two much smaller black holes merging to create a gravitational wave, as Albert Einstein predicted. The new image, published in the Astrophysical Journal Letters and announced around the world in several news conferences, adds light to that sound. Outside scientists suggested the achievement could be worthy of a Nobel Prize, just like the gravitational wave discovery. While much around a black hole falls into a death spiral and is never to be seen again, the new image captures “lucky gas and dust” circling at just far enough to be safe and seen millions of years later on Earth, Dempsey said. Taken over four days when astronomers had “to have the perfect weather all across the world and literally all the stars had to align,” the image helps confirm Einstein's general relativity theory, Dempsey said. Einstein a century ago even predicted the symmetrical shape that scientists just found, she said. \n“It's circular, but on one side the light is brighter,” Dempsey said. That's because that light is approaching Earth. The measurements are taken at a wavelength the human eye cannot see, so the astronomers added color to the image. They chose “exquisite gold because this light is so hot,” Dempsey said. “Making it these warm gold and oranges makes sense.” What the image shows is gas heated to millions of degrees by the friction of ever-stronger gravity, scientists said. And that gravity creates a funhouse effect where you see light from both behind the black hole and behind you as the light curves and circles around the black hole itself, said astronomer Avi Loeb, director of the Black Hole Initiative at Harvard. (The lead scientists in the discovery are from Harvard, but Loeb was not involved.)  The project cost $50 million to $60 million, with $26 million of that coming from the National Science Foundation. Johns Hopkins astrophysicist Ethan Vishniac, who was not part of the discovery team but edits the journal where the research was published, pronounced the image “an amazing technical achievement” that “gives us a glimpse of gravity in its most extreme manifestation.” He added: “Pictures from computer simulations can be very pretty, but there's literally nothing like a picture of the real universe, however fuzzy and monochromatic.” “It's just seriously cool,” said John Kormendy, a University of Texas astronomer who wasn't part of the discovery team. “To see the stuff going down the tubes, so to speak, to see it firsthand. The mystique of black holes in the community is very substantial. That mystique is going to be made more real.” There is a myth that says a black hole would rip you apart, but Loeb and Kormendy said the one pictured is so big, someone could fall into it and not be torn to pieces. But the person would never be seen from again. Black holes are “like the walls of a prison. Once you cross it, you will never be able to get out and you will never be able to communicate,” Loeb said. The first image is of a black hole in a galaxy called M87 that is about 53 million light years from Earth. One light year is 5.9 trillion miles, or 9.5 trillion kilometers. This black hole is about 6 billion times the mass of our sun. The telescope data was gathered by the Event Horizon Telescope two years ago, but it took so long to complete the image because it was a massive undertaking, involving about 200 scientists, supercomputers and hundreds of terabytes of data delivered worldwide by plane. The team looked at two supermassive black holes, the M87 and the one at the center of our own Milky Way galaxy. The one in our galaxy is closer but much smaller, so they both look the same size in the sky. But the more distant one was easier to take pictures of because it rotates more slowly. “We've been hunting this for a long time,” Dempsey said. “We've been getting closer and closer with better technology.” "}}