{"0":{"tilte":"Trump administration axed CDC expert job in China months before coronavirus outbreak\n","link":"https:\/\/www.dawn.com\/news\/1543158\/trump-administration-axed-cdc-expert-job-in-china-months-before-coronavirus-outbreak","img":"https:\/\/i.dawn.com\/medium\/2020\/03\/5e78ae88e5422.jpg","discription":"\nSeveral months before the coronavirus pandemic began, the Trump administration eliminated a key American public health position in Beijing intended to help detect disease outbreaks in China, Reuters has learned.\nThe American disease expert, a medical epidemiologist embedded in China’s disease control agency, left her post in July, according to four sources with knowledge of the issue. The first cases of the new coronavirus may have emerged as early as November, and as cases exploded, the Trump administration in February chastised China for censoring information about the outbreak and keeping United States experts from entering the country to help.\n“It was heartbreaking to watch,” said Bao-Ping Zhu, a Chinese American who served in that role, which was funded by the US Centers for Disease Control and Prevention (CDC), between 2007 and 2011. \n“If someone had been there, public health officials and governments across the world could have moved much faster.”\nZhu and the other sources said the American expert, Dr Linda Quick, was a trainer of Chinese field epidemiologists who were deployed to the epicentre of outbreaks to help track, investigate and contain diseases.\nAs an American CDC employee, they said, Quick was in an ideal position to be the eyes and ears on the ground for the US and other countries on the coronavirus outbreak and might have alerted them to the growing threat weeks earlier.\nNo other foreign disease experts were embedded to lead the programme after Quick left in July, according to the sources. Zhu said an embedded expert can often get word of outbreaks early, after forming close relationships with Chinese counterparts.\nZhu and the other sources said Quick could have provided real-time information to US and other officials around the world during the first weeks of the outbreak, when they said the Chinese government tamped down on the release of information and provided erroneous assessments.\nQuick left amid a bitter US trade dispute with China when she learned her federally funded post, officially known as resident adviser to the US Field Epidemiology Training Program in China, would be discontinued as of September, the sources said. The US CDC said it first learned of a “cluster of 27 cases of pneumonia” of unexplained origin in Wuhan, China, on December 31.\nSince then, the outbreak of the disease known as Covid-19 has spread rapidly worldwide, killing more than 13,600 people, infecting more than 317,000. The epidemic has overwhelmed healthcare systems in some countries, including Italy, and threatens to do so in the US and elsewhere.\nDuring a press briefing on Sunday shortly after this story was first published, President Donald Trump dismissed the Reuters report as similar to other stories regarding the CDC that he described as “100 per cent wrong,” without addressing whether the role had been eliminated.\nUS CDC Director Dr Robert Redfield maintained the agency’s presence in China “is actually being augmented as we speak\", without elaborating.\nIn a statement to Reuters before the report was published, the CDC said the elimination of the adviser position did not hinder Washington’s ability to get information and “had absolutely nothing to do with CDC not learning of cases in China earlier\".\nThe agency said its decision not to have a resident adviser “started well before last summer and was due to China’s excellent technical capability and maturity of the programme\".\nThe CDC said it has assigned two of its Chinese employees as “mentors” to help with the training program. The agency did not respond to questions about the mentors’ specific role or expertise.\nThe CDC would not make Quick, who still works for the agency, available for comment.\nAsked for comment on Chinese transparency and responsiveness to the outbreak, China’s Ministry of Foreign Affairs referred Reuters to remarks by spokesman Geng Shuang on Friday. Geng said the country “has adopted the strictest, most comprehensive, and most thorough prevention and control measures in an open, transparent, and responsible manner, and informed the (World Health Organisation) and relevant countries and regions of the latest situation in a timely manner.”\nOne disease expert told Reuters he was skeptical that the US resident adviser would have been able to get earlier or better information to the Trump administration, given the Chinese government’s suppression of information.\n“In the end, based on circumstances in China, it probably wouldn’t have made a big difference,” Scott McNabb, who was a CDC epidemiologist for 20 years and is now a research professor at Emory University. “The problemme was how the Chinese handled it. What should have changed was the Chinese should have acknowledged it earlier and didn’t.”\nAlex Azar, secretary of Health and Human Services (HHS) said on Friday that his agency learned of the coronavirus in early January, based on Redfield’s conversations with “Chinese colleagues\".\nRedfield learned that “this looks to be a novel coronavirus” from Dr Gao Fu, the head of the China CDC, according to an HHS administration official, who spoke on condition of anonymity. “Dr Redfield always talked to Dr. Gao,” the official said.\nHHS and CDC did not make Azar or Redfield available for comment.\nZhu and other sources said US leaders should not have been relying on the China CDC director for alerts and updates. In general, they said, officials in China downplayed the severity of the outbreak in the early weeks and did not acknowledge evidence of person-to-person transmission until January 20.\nAfter the epidemic exploded and China had imposed strict quarantines, Trump administration officials complained that the Chinese had censored information about the outbreak and that the US had been unable to get American disease experts into the country to help contain the spread.\nAzar told CNN on February 14 that he and CDC director Redfield officially offered to send a CDC team into China on January 6 but still had not received permission for them to enter the country. HHS oversees the CDC.\n“Dr Redfield and I made the offer on January 6th — 36 days ago, 60,000 cases and 1,300 deaths ago,” Azar said. “We made the offer to send the CDC experts in to assist their Chinese colleagues to get to the bottom of key scientific questions like, how transmissible is this disease? What is the severity? What is the incubation period and can there be asymptomatic transmission?”\nDays later, the WHO secured permission to send a team that included two US experts. The team visited between February 16th and 24th. By then, China had reported more than 75,000 cases.\nOn February 25, the first day the CDC told the American public to prepare for an outbreak at home, U.S. Secretary of State Mike Pompeo accused China of mishandling the epidemic through its “censorship” of medical professionals and media.\nRelations between the two countries have deteriorated since then, as Trump has labeled the coronavirus the “Chinese virus” — a description the Chinese have condemned as stigmatising. Last week, the Chinese government announced that Americans from three US news organisations, The New York Times, Washington Post and Wall Street Journal, would be expelled from China.\nThe decision to eliminate Quick’s job came as the CDC has scaled back the number of US staffers in China over the last two years, the sources told Reuters.\n“We had already withdrawn many technical public health experts,” the same expert said.\nThe CDC, however, disputed that staffing was a problem or that its information had been limited by the move. “It was not the staffing shortage that limited our ability” it said.\nThe US CDC team in Beijing now includes three American citizens in permanent roles, an additional American who is temporary and around 10 Chinese nationals, the agency said. Of the Americans, one is an influenza expert with expertise in respiratory disease. Covid-19 is not influenza, though it can cause severe respiratory illness.\nThe CDC team, aside from Quick, was housed at US Embassy facilities. No American CDC staffer besides Quick was embedded with China’s disease control agency, the sources said.\nChina in recent weeks has reported a dramatic slowdown in new cases, the result of drastic containment measures including the lockdown of Hubei province, home to 60 million people.\nNevertheless, the infectious disease experts who spoke with Reuters said, the United States could use people like Quick with contacts on the ground, especially if fears of a second wave of infections materialises.\nThomas R. Frieden, a former director of the CDC, said that if the US resident adviser had still been in China, “it is possible that we would know more today about how this coronavirus is spreading and what works best to stop it.”\nDr. George Conway, a medical epidemiologist who knows Quick and had served as resident adviser between 2012 and 2015, said funding for the position had been tenuous for years because of a perennial debate among US health officials over whether China should be paying for funding its own training programme.\nYet since the training programme was launched in 2001, the sources familiar with it say, it has not only strengthened the ranks of Chinese epidemiologists in the field but also fostered collegial relationships between public health officials in the two countries.\n“We go there as credentialed diplomats and return home as close colleagues and often as friends,” Conway said.\nIn 2007, Dr Robert Fontaine, a CDC epidemiologist and one of the longest-serving US officials in the adviser’s position, received China’s highest honor for outstanding contributions to public health due to his contribution as a foreigner in helping to detect and investigate clusters of pneumonia of unknown cause.\nBut since last year, Frieden and others said, growing tensions between the Trump administration and China’s leadership have apparently damaged the collaboration.\n“The message from the administration was, ‘Don’t work with China, they’re our rival',” Frieden said.\nTrump’s re-election campaign sent out a statement on Sunday evening dismissing controversy about the CDC’S cut as a matter of politics.\n“Democrats are eager to politicise the coronavirus crisis and weaponise it against President Trump,\" the statement said. “In so doing, they’re siding with the Chinese and providing cover for Beijing’s cover-up.”"},"1":{"tilte":"UK calls in army, warns people to stay home or face lockdown\n","link":"https:\/\/www.dawn.com\/news\/1543149\/uk-calls-in-army-warns-people-to-stay-home-or-face-lockdown","img":"https:\/\/i.dawn.com\/medium\/2020\/03\/5e78aa1f73d39.jpg","discription":"\nBritain sent in the army to deliver protective equipment to hospitals on Monday and told people to stay at home and heed warnings over social distancing or the government would bring in more extreme measures to stop the coronavirus spread.\nWith some doctors saying they felt like “cannon fodder”, the government said the military would help ship millions of items of personal protective equipment (PPE) including masks to healthcare workers who have complained of shortages.\nSo far, 281 Britons have died from the coronavirus and, in the last few days, British authorities have rapidly stepped up action to try to limit the spread of the disease and prevent a repeat of the death toll seen in other countries where thousands have died.\nHowever, there have been complaints from frontline medical staff about shortages of kit, saying they did not feel safe at work. In a letter pleading with Prime Minister Boris Johnson to increase PPE supplies, more than 6,000 frontline doctors said they were being asked to put their lives at risk with out-of-date masks, and low stocks of equipment.\nHealth Secretary Matt Hancock admitted there had been issues but promised action was being taken. He said the army would drive trucks throughout the day and night to get supplies to medical staff.\n“It’s like a war effort, it is a war against this virus and so the army have been incredibly helpful in getting those logistics so we can get the supplies to protect people on the front line,” he told the BBC, saying the health service now had 12,000 ventilators, 7,000 more than at the start of the crisis.\nBritain has brought in a series of measures to try to curb the spread of the virus.\nOn Monday, a much-reduced rail service was introduced and jury trials were suspended, coming days after Johnson advised Britons to work from home if possible and ordered the closure of pubs, gyms and leisure centres.\nBut advice to stay at home and avoid social gatherings went unheeded by millions at the weekend who took advantage of sunny weather to flock to parks and beauty spots over the weekend, ignoring instructions to stay 2 metres (6 feet) apart.\nEmyr Williams, chief executive of the Snowdonia National Park Authority in Wales, said the past 24 hours had been unprecedented.\n“We have experienced the busiest visitor day in living memory. The area has been overwhelmed with visitors,” he said.\nThe government warned that Britain would face a shutdown with curfews and travel restrictions if people continued to flout the advice.\n“Well, we’re perfectly prepared to do that if we need to because the objective here is really clear which is to stop the spread of the virus. Of course we will enforce and bring in further strong measures if we need to,” Hancock told Sky News.\nThe government was also pondering whether to close all non-essential retail shops, the BBC’s political editor reported.\nSome firms have already acted because of slowing demand, with clothing retailer Primark and department store John Lewis saying on Monday they would temporarily close all of their shops.\nIt comes as Britain opened the first part of a 330 billion pound ($384 billion) loan guarantee scheme for businesses , which will help small and medium-sized firms borrow up to 5 million pounds to deal with coronavirus stoppages."},"2":{"tilte":"US becomes third worst affected country\n","link":"https:\/\/www.dawn.com\/news\/1543070\/us-becomes-third-worst-affected-country","img":"https:\/\/i.dawn.com\/medium\/2020\/03\/5e783707968ef.jpg","discription":"\nBritain sent in the army to deliver protective equipment to hospitals on Monday and told people to stay at home and heed warnings over social distancing or the government would bring in more extreme measures to stop the coronavirus spread.\nWith some doctors saying they felt like “cannon fodder”, the government said the military would help ship millions of items of personal protective equipment (PPE) including masks to healthcare workers who have complained of shortages.\nSo far, 281 Britons have died from the coronavirus and, in the last few days, British authorities have rapidly stepped up action to try to limit the spread of the disease and prevent a repeat of the death toll seen in other countries where thousands have died.\nHowever, there have been complaints from frontline medical staff about shortages of kit, saying they did not feel safe at work. In a letter pleading with Prime Minister Boris Johnson to increase PPE supplies, more than 6,000 frontline doctors said they were being asked to put their lives at risk with out-of-date masks, and low stocks of equipment.\nHealth Secretary Matt Hancock admitted there had been issues but promised action was being taken. He said the army would drive trucks throughout the day and night to get supplies to medical staff.\n“It’s like a war effort, it is a war against this virus and so the army have been incredibly helpful in getting those logistics so we can get the supplies to protect people on the front line,” he told the BBC, saying the health service now had 12,000 ventilators, 7,000 more than at the start of the crisis.\nBritain has brought in a series of measures to try to curb the spread of the virus.\nOn Monday, a much-reduced rail service was introduced and jury trials were suspended, coming days after Johnson advised Britons to work from home if possible and ordered the closure of pubs, gyms and leisure centres.\nBut advice to stay at home and avoid social gatherings went unheeded by millions at the weekend who took advantage of sunny weather to flock to parks and beauty spots over the weekend, ignoring instructions to stay 2 metres (6 feet) apart.\nEmyr Williams, chief executive of the Snowdonia National Park Authority in Wales, said the past 24 hours had been unprecedented.\n“We have experienced the busiest visitor day in living memory. The area has been overwhelmed with visitors,” he said.\nThe government warned that Britain would face a shutdown with curfews and travel restrictions if people continued to flout the advice.\n“Well, we’re perfectly prepared to do that if we need to because the objective here is really clear which is to stop the spread of the virus. Of course we will enforce and bring in further strong measures if we need to,” Hancock told Sky News.\nThe government was also pondering whether to close all non-essential retail shops, the BBC’s political editor reported.\nSome firms have already acted because of slowing demand, with clothing retailer Primark and department store John Lewis saying on Monday they would temporarily close all of their shops.\nIt comes as Britain opened the first part of a 330 billion pound ($384 billion) loan guarantee scheme for businesses , which will help small and medium-sized firms borrow up to 5 million pounds to deal with coronavirus stoppages.\nWASHINGTON: The United States now has the third highest number of confirmed coronavirus cases after China and Italy, as the global infection figures surpassed the 300,000 mark on Sunday. Statistics collected by various monitoring agencies in Washington showed that by Sunday afternoon, the United States had a total of 38,138 confirmed cases, including 13,931 new ones.\nTotal critical cases also rose to 708 while 396 people have already died of this fatal respiratory disease, including 94 new deaths.\nGlobally, coronavirus had infected 319,675 by Sunday afternoon and caused 13,699 deaths.\nThe respiratory virus, known officially as Covid-19, has reached every state in America since emerging in the Chinese city of Wuhan in December. It has also reached every continent except Antarctica.\nPhysicians appearing on various US television channels warned that the total number of infected people could be much higher as people with mild symptoms do not report their illness.\nThe physicians also said they could not over-emphasize the need for people to stay at home and wash their hands several times a day. They argued that these two precautionary measures could help prevent the disease from spreading further.\nThe World Health Organisation (WHO), which is leading the global fight against this deadly virus, says that almost 80 percent patients recover without external help. But the virus they carry can infect the sick and the elderly who are among the most vulnerable.\nIn the United States, the federal government has advised states to decide when to order people to stay at home, offering to provide them financial and administrative support if they do. So far, New York, California, Illinois and Oregon have issued stay-at-home orders.\nThe virus scare has affected more than 70 million people in the United States and more than a billion across the globe. In each of the 50 US states, tens of thousands of people have taken advantage of the option to stay at home.\nThe US Congress is working on a trillion-dollar package to give $3,000 dollars to a family of four if they opt to stay. Daily wage earners, who are among the worst affected by the Covid-19 outbreak, will be the first to receive this assistance.\nPublished in Dawn, March 23rd, 2020"},"3":{"tilte":"Global deaths surge past 13,000; 35 countries go into lockdown\n","link":"https:\/\/www.dawn.com\/news\/1543071\/global-deaths-surge-past-13000-35-countries-go-into-lockdown","img":"https:\/\/i.dawn.com\/medium\/2020\/03\/5e77e8b497456.jpg","discription":"\nBritain sent in the army to deliver protective equipment to hospitals on Monday and told people to stay at home and heed warnings over social distancing or the government would bring in more extreme measures to stop the coronavirus spread.\nWith some doctors saying they felt like “cannon fodder”, the government said the military would help ship millions of items of personal protective equipment (PPE) including masks to healthcare workers who have complained of shortages.\nSo far, 281 Britons have died from the coronavirus and, in the last few days, British authorities have rapidly stepped up action to try to limit the spread of the disease and prevent a repeat of the death toll seen in other countries where thousands have died.\nHowever, there have been complaints from frontline medical staff about shortages of kit, saying they did not feel safe at work. In a letter pleading with Prime Minister Boris Johnson to increase PPE supplies, more than 6,000 frontline doctors said they were being asked to put their lives at risk with out-of-date masks, and low stocks of equipment.\nHealth Secretary Matt Hancock admitted there had been issues but promised action was being taken. He said the army would drive trucks throughout the day and night to get supplies to medical staff.\n“It’s like a war effort, it is a war against this virus and so the army have been incredibly helpful in getting those logistics so we can get the supplies to protect people on the front line,” he told the BBC, saying the health service now had 12,000 ventilators, 7,000 more than at the start of the crisis.\nBritain has brought in a series of measures to try to curb the spread of the virus.\nOn Monday, a much-reduced rail service was introduced and jury trials were suspended, coming days after Johnson advised Britons to work from home if possible and ordered the closure of pubs, gyms and leisure centres.\nBut advice to stay at home and avoid social gatherings went unheeded by millions at the weekend who took advantage of sunny weather to flock to parks and beauty spots over the weekend, ignoring instructions to stay 2 metres (6 feet) apart.\nEmyr Williams, chief executive of the Snowdonia National Park Authority in Wales, said the past 24 hours had been unprecedented.\n“We have experienced the busiest visitor day in living memory. The area has been overwhelmed with visitors,” he said.\nThe government warned that Britain would face a shutdown with curfews and travel restrictions if people continued to flout the advice.\n“Well, we’re perfectly prepared to do that if we need to because the objective here is really clear which is to stop the spread of the virus. Of course we will enforce and bring in further strong measures if we need to,” Hancock told Sky News.\nThe government was also pondering whether to close all non-essential retail shops, the BBC’s political editor reported.\nSome firms have already acted because of slowing demand, with clothing retailer Primark and department store John Lewis saying on Monday they would temporarily close all of their shops.\nIt comes as Britain opened the first part of a 330 billion pound ($384 billion) loan guarantee scheme for businesses , which will help small and medium-sized firms borrow up to 5 million pounds to deal with coronavirus stoppages.\nWASHINGTON: The United States now has the third highest number of confirmed coronavirus cases after China and Italy, as the global infection figures surpassed the 300,000 mark on Sunday. Statistics collected by various monitoring agencies in Washington showed that by Sunday afternoon, the United States had a total of 38,138 confirmed cases, including 13,931 new ones.\nTotal critical cases also rose to 708 while 396 people have already died of this fatal respiratory disease, including 94 new deaths.\nGlobally, coronavirus had infected 319,675 by Sunday afternoon and caused 13,699 deaths.\nThe respiratory virus, known officially as Covid-19, has reached every state in America since emerging in the Chinese city of Wuhan in December. It has also reached every continent except Antarctica.\nPhysicians appearing on various US television channels warned that the total number of infected people could be much higher as people with mild symptoms do not report their illness.\nThe physicians also said they could not over-emphasize the need for people to stay at home and wash their hands several times a day. They argued that these two precautionary measures could help prevent the disease from spreading further.\nThe World Health Organisation (WHO), which is leading the global fight against this deadly virus, says that almost 80 percent patients recover without external help. But the virus they carry can infect the sick and the elderly who are among the most vulnerable.\nIn the United States, the federal government has advised states to decide when to order people to stay at home, offering to provide them financial and administrative support if they do. So far, New York, California, Illinois and Oregon have issued stay-at-home orders.\nThe virus scare has affected more than 70 million people in the United States and more than a billion across the globe. In each of the 50 US states, tens of thousands of people have taken advantage of the option to stay at home.\nThe US Congress is working on a trillion-dollar package to give $3,000 dollars to a family of four if they opt to stay. Daily wage earners, who are among the worst affected by the Covid-19 outbreak, will be the first to receive this assistance.\nPublished in Dawn, March 23rd, 2020\nROME: Nearly one billion people around the world were confined to their homes on Sunday, as the coronavirus death toll crossed 13,000 and factories were shut in worst-hit Italy after another single-day fatalities record.\nThe raging pandemic has forced lockdowns in 35 countries across the globe, disrupting lives, travel and businesses as governments scramble to shut borders and unleash hundreds of billions in emergency measures to avoid a widespread virus-fuelled economic meltdown.Across the Atlantic, more than a third of Americans were adjusting to life in various phases of lockdown, including in New York, Chicago and Los Angeles — the three biggest US cities. Other parts of the United States are expected to ramp up restrictions as well.\n“This is a time of shared national sacrifice, but also a time to treasure our loved ones,” US President Donald Trump said.  “We’re going to have a great victory.” As world leaders have vowed to fight the pandemic, the number of deaths and infections has continued to rise, especially in Europe — the main global hotspot.\nSpain reported a 32 per cent spike in new deaths on Saturday, and Prime Minister Pedro Sanchez warned in a TV address that the nation needs to prepare for  “very hard days ahead”.\nFatalities in France jumped to 562 as police officials said helicopters and drones were being deployed to boost the government’s attempts to keep people in their homes.\nThe unprecedented measures to counter the spread of COVID-19 have shredded the international sports calendar, and pressure is mounting on Olympic organisers to postpone the 2020 Tokyo Games.The drastic confinement measures follow the example of China, where the lockdown of Hubei province appears to have paid off. Wuhan, Hubei’s capital, is where the virus was first detected.\nChina reported its first local infection in four days on Sunday. While the number of cases in the mainland has slumped dramatically since the crisis began, there are fears of  “imported” cases from other hotspots like Europe.\nFrance, Italy, Spain and other European countries have ordered people to stay at home, threatening fines in some cases, while Australia on Sunday told citizens to cancel domestic travel plans.\nBritain has told pubs, restaurants and theatres to close and warned citizens to stop panic-buying.\nAnd India went into lockdown on Sunday with a one-day nationwide  “self-imposed curfew”.\nWhile the elderly and those with pre-existing medical conditions are the hardest hit by the virus, the WHO has warned that young people are also vulnerable.\nAccurate Covid-19 figures are difficult to reach because many of the victims suffered from other illnesses, and infection rates are uncertain because of a lack of testing in many countries.\nThe coronavirus has infected more than 1,000 across Africa too, where healthcare systems are limited and social distancing measures — like the ones being adopted in North America and Europe — are difficult in crowded cities.\nThe Middle East also remains on high alert, where Iran — which suffered a major outbreak — reporting 123 new deaths on Saturday. But the Islamic Republic has refused to join the rest of the world in imposing heavy restrictions.\nPublished in Dawn, March 23rd, 2020"},"4":{"tilte":"Virus ‘accelerating’ in UK as fears grow of Italy-like trajectory\n","link":"https:\/\/www.dawn.com\/news\/1543072\/virus-accelerating-in-uk-as-fears-grow-of-italy-like-trajectory","img":"https:\/\/i.dawn.com\/medium\/2020\/03\/5e782e99c0839.jpg","discription":"\nLONDON: Prime Minister Boris Johnson warned on Sun­day the coronavirus outbreak was  “accelerating”, as fears grew that the crisis in Britain was following the same path as the one devastating Italy.\nJohnson said the health service could be  “overwhelmed” as health department figures showed that 233 people died from Covid-19 in the UK, with the number of those testing positive for the virus standing at 5,018.\nBritain’s death toll now mirrors the figure that Rome decla­red just over two weeks ago, on March 7, before Italy became the world’s most affected country. On Sunday, Italy said that 4,825 people had died from the virus there, a third of the world’s total. The UK figure rose by at least 10 on Sunday, with announcements of further deaths in Scotland and Wales. An updated UK-wide figure was expected later.\n“The numbers are very stark, and they are accelerating,” Johnson said in a statement ahead of a planned press briefing later in the day.\n“We are only a matter of weeks — two or three — behind Italy. The Italians have a superb health care system. And yet their doctors and nurses have been completely overwhelmed by the demand.” Johnson’s warning came amid calls for police to enforce warnings to people to socially distance from each other.\nOn Friday, Downing Street announced stronger measures to combat the spread, including the closing of bars, pubs and restaurants. \nMinisters have outlined emergency legislation to give police, public health and immigration officers extra powers to contain the outbreak, expected to come into force this week.\nReports over the weekend of Britons flocking to cafes, beaches, parks and bars fuelled expectations that extra powers being imposed were now inevitable. In London, the worst affe­c­ted city, Mayor Sadiq Khan told the BBC police could have to enforce social distancing.\n“If it is the case that people continue to act in a way that’s leading to this disease spreading, then those sorts of things will have to be considered.” Scotland’s first minister Nicola Sturgeon, at a Sunday press briefing, criticised pubs which opened over the weekend despite being warned not to, claiming they  “put lives at risk”.\n“Close now. We’ll have emergency powers within days to force you to close and we will use these powers if we have to,” she said.\nThere were also signs of a political fallout. Downing Street denied a  “highly defamatory” Sunday Times newspaper story that Johnson’s chief adviser, Dominic Cummings, had initially argued against strict measures to contain the virus, in an argument summed up as  “if that means some pensioners die, too bad”.\nMounting concerns came as authorities in the UK told 1.5 million people most at risk to stay at home for 12 weeks.\nThe government advised vulnerable people such as those with bone or blood cancers to shield themselves from the virus, by confining themselves at home.\n“People should stay at home, protect our NHS and save lives,” said Housing secretary Robert Jenrick.\nHe said the government would get protective gear to NHS staff on the frontline  “as soon as possible” amid fears the virus could be spreading due to a lack of equipment for medics.\nIn a further sign of growing concern, environmental and heritage charity the National Trust said it would close all of its parks and gardens.\nPublished in Dawn, March 23rd, 2020"},"5":{"tilte":"German Chancellor Angela Merkel in quarantine after meeting infected doctor\n","link":"https:\/\/www.dawn.com\/news\/1543065\/german-chancellor-angela-merkel-in-quarantine-after-meeting-infected-doctor","img":"https:\/\/i.dawn.com\/medium\/2020\/03\/5e77e74948d67.jpg","discription":"\nLONDON: Prime Minister Boris Johnson warned on Sun­day the coronavirus outbreak was  “accelerating”, as fears grew that the crisis in Britain was following the same path as the one devastating Italy.\nJohnson said the health service could be  “overwhelmed” as health department figures showed that 233 people died from Covid-19 in the UK, with the number of those testing positive for the virus standing at 5,018.\nBritain’s death toll now mirrors the figure that Rome decla­red just over two weeks ago, on March 7, before Italy became the world’s most affected country. On Sunday, Italy said that 4,825 people had died from the virus there, a third of the world’s total. The UK figure rose by at least 10 on Sunday, with announcements of further deaths in Scotland and Wales. An updated UK-wide figure was expected later.\n“The numbers are very stark, and they are accelerating,” Johnson said in a statement ahead of a planned press briefing later in the day.\n“We are only a matter of weeks — two or three — behind Italy. The Italians have a superb health care system. And yet their doctors and nurses have been completely overwhelmed by the demand.” Johnson’s warning came amid calls for police to enforce warnings to people to socially distance from each other.\nOn Friday, Downing Street announced stronger measures to combat the spread, including the closing of bars, pubs and restaurants. \nMinisters have outlined emergency legislation to give police, public health and immigration officers extra powers to contain the outbreak, expected to come into force this week.\nReports over the weekend of Britons flocking to cafes, beaches, parks and bars fuelled expectations that extra powers being imposed were now inevitable. In London, the worst affe­c­ted city, Mayor Sadiq Khan told the BBC police could have to enforce social distancing.\n“If it is the case that people continue to act in a way that’s leading to this disease spreading, then those sorts of things will have to be considered.” Scotland’s first minister Nicola Sturgeon, at a Sunday press briefing, criticised pubs which opened over the weekend despite being warned not to, claiming they  “put lives at risk”.\n“Close now. We’ll have emergency powers within days to force you to close and we will use these powers if we have to,” she said.\nThere were also signs of a political fallout. Downing Street denied a  “highly defamatory” Sunday Times newspaper story that Johnson’s chief adviser, Dominic Cummings, had initially argued against strict measures to contain the virus, in an argument summed up as  “if that means some pensioners die, too bad”.\nMounting concerns came as authorities in the UK told 1.5 million people most at risk to stay at home for 12 weeks.\nThe government advised vulnerable people such as those with bone or blood cancers to shield themselves from the virus, by confining themselves at home.\n“People should stay at home, protect our NHS and save lives,” said Housing secretary Robert Jenrick.\nHe said the government would get protective gear to NHS staff on the frontline  “as soon as possible” amid fears the virus could be spreading due to a lack of equipment for medics.\nIn a further sign of growing concern, environmental and heritage charity the National Trust said it would close all of its parks and gardens.\nPublished in Dawn, March 23rd, 2020\nBERLIN: German Chancellor Angela Merkel will quarantine herself at home after being treated by a doctor who has since tested positive for the novel coronavirus, a government spokesman said on Sunday.\n“The Chancellor has decided to quarantine herself immediately at home. She will be tested regularly in the coming days [...] (and) fulfil her official business from home,” Steffen Seibert said in a statement.\nThe doctor had visited Merkel on Friday to vaccinate her against the pneumococcus bacteria.\nIt could take some time to determine whether the chancellor is herself infected as  “a test would not yet be fully conclusive,” Seibert said.\nDuring her 15-year term in office Merkel has largely enjoyed robust health, although she suffered repeated shaking spells in public appearances during a summer 2019 heatwave that were never fully explained.\nIn response to the tremors, she chose to sit on a chair when receiving guests with military honours outside the chancellor’s office in Berlin.\nPreviously the veteran leader broke her pelvis in a cross-country skiing accident in 2014.\nPublished in Dawn, March 23rd, 2020"},"6":{"tilte":"UK scientists to track mutations in coronavirus to map spread\n","link":"https:\/\/www.dawn.com\/news\/1543119\/uk-scientists-to-track-mutations-in-coronavirus-to-map-spread","img":"https:\/\/i.dawn.com\/medium\/2020\/03\/5e7867a5ef5fd.jpg","discription":"\nLONDON: Prime Minister Boris Johnson warned on Sun­day the coronavirus outbreak was  “accelerating”, as fears grew that the crisis in Britain was following the same path as the one devastating Italy.\nJohnson said the health service could be  “overwhelmed” as health department figures showed that 233 people died from Covid-19 in the UK, with the number of those testing positive for the virus standing at 5,018.\nBritain’s death toll now mirrors the figure that Rome decla­red just over two weeks ago, on March 7, before Italy became the world’s most affected country. On Sunday, Italy said that 4,825 people had died from the virus there, a third of the world’s total. The UK figure rose by at least 10 on Sunday, with announcements of further deaths in Scotland and Wales. An updated UK-wide figure was expected later.\n“The numbers are very stark, and they are accelerating,” Johnson said in a statement ahead of a planned press briefing later in the day.\n“We are only a matter of weeks — two or three — behind Italy. The Italians have a superb health care system. And yet their doctors and nurses have been completely overwhelmed by the demand.” Johnson’s warning came amid calls for police to enforce warnings to people to socially distance from each other.\nOn Friday, Downing Street announced stronger measures to combat the spread, including the closing of bars, pubs and restaurants. \nMinisters have outlined emergency legislation to give police, public health and immigration officers extra powers to contain the outbreak, expected to come into force this week.\nReports over the weekend of Britons flocking to cafes, beaches, parks and bars fuelled expectations that extra powers being imposed were now inevitable. In London, the worst affe­c­ted city, Mayor Sadiq Khan told the BBC police could have to enforce social distancing.\n“If it is the case that people continue to act in a way that’s leading to this disease spreading, then those sorts of things will have to be considered.” Scotland’s first minister Nicola Sturgeon, at a Sunday press briefing, criticised pubs which opened over the weekend despite being warned not to, claiming they  “put lives at risk”.\n“Close now. We’ll have emergency powers within days to force you to close and we will use these powers if we have to,” she said.\nThere were also signs of a political fallout. Downing Street denied a  “highly defamatory” Sunday Times newspaper story that Johnson’s chief adviser, Dominic Cummings, had initially argued against strict measures to contain the virus, in an argument summed up as  “if that means some pensioners die, too bad”.\nMounting concerns came as authorities in the UK told 1.5 million people most at risk to stay at home for 12 weeks.\nThe government advised vulnerable people such as those with bone or blood cancers to shield themselves from the virus, by confining themselves at home.\n“People should stay at home, protect our NHS and save lives,” said Housing secretary Robert Jenrick.\nHe said the government would get protective gear to NHS staff on the frontline  “as soon as possible” amid fears the virus could be spreading due to a lack of equipment for medics.\nIn a further sign of growing concern, environmental and heritage charity the National Trust said it would close all of its parks and gardens.\nPublished in Dawn, March 23rd, 2020\nBERLIN: German Chancellor Angela Merkel will quarantine herself at home after being treated by a doctor who has since tested positive for the novel coronavirus, a government spokesman said on Sunday.\n“The Chancellor has decided to quarantine herself immediately at home. She will be tested regularly in the coming days [...] (and) fulfil her official business from home,” Steffen Seibert said in a statement.\nThe doctor had visited Merkel on Friday to vaccinate her against the pneumococcus bacteria.\nIt could take some time to determine whether the chancellor is herself infected as  “a test would not yet be fully conclusive,” Seibert said.\nDuring her 15-year term in office Merkel has largely enjoyed robust health, although she suffered repeated shaking spells in public appearances during a summer 2019 heatwave that were never fully explained.\nIn response to the tremors, she chose to sit on a chair when receiving guests with military honours outside the chancellor’s office in Berlin.\nPreviously the veteran leader broke her pelvis in a cross-country skiing accident in 2014.\nPublished in Dawn, March 23rd, 2020\nUK scientists are to track the spread of the new coronavirus and watch for emerging mutations by using gene sequencing to analyse the strains causing thousands of Covid-19 infections across the country, Britain said on Monday.\nResearchers will collect data from samples from infected patients in England, Wales, Scotland and Northern Ireland, the government said in a statement.\nAt least 281 Britons have died from COVID-19, the disease caused by the new coronavirus that has spread around the world in a pandemic.\n\"This virus is one of the biggest threats our nation has faced in recent times, and crucial to helping us fight it is understanding how it is spreading,\" said Sharon Peacock, director of Public Health England’s (PHE) national infection service.\nWorking in teams across Britain, scientists will map out and analyse the full genetic codes of the Covid-19 samples.\n\"Genomic sequencing will help us understand Covid-19 and its spread. It can also help guide treatments in the future and see the impact of interventions,\" Patrick Vallance, the government’s chief scientific adviser, said in the statement.\nIn epidemics, genome sequencing can help scientists monitor small changes in the virus at a national or international scale to understand how it is spreading and whether different strains are emerging. \n\"Right now, the important questions we can help answer with sequencing are to help understand the role of international importations into the UK,\" said Nick Loman, a professor of microbial genomics and bioinformatics at Birmingham University.\nThe 20 million pound ($23 million) project, called the Covid-19 Genomics UK Consortium, will be co-led by the Wellcome Sanger Institute, which specialises in genetic research, PHE and other public health agencies, as well as the National Health Service and several academic institutions.\n\"All viruses accumulate mutations over time, some faster than others,\" said Paul Klenerman, a professor at Oxford University who will be involved in the work. \"For Covid-19, this has only just begun — but this emerging variation can be tracked in detail.\""},"7":{"tilte":"Gaza confirms first two Covid-19 cases linked to Pakistan\n","link":"https:\/\/www.dawn.com\/news\/1543088\/gaza-confirms-first-two-covid-19-cases-linked-to-pakistan","img":"https:\/\/i.dawn.com\/medium\/2020\/03\/5e77efb098005.jpg","discription":"\nLONDON: Prime Minister Boris Johnson warned on Sun­day the coronavirus outbreak was  “accelerating”, as fears grew that the crisis in Britain was following the same path as the one devastating Italy.\nJohnson said the health service could be  “overwhelmed” as health department figures showed that 233 people died from Covid-19 in the UK, with the number of those testing positive for the virus standing at 5,018.\nBritain’s death toll now mirrors the figure that Rome decla­red just over two weeks ago, on March 7, before Italy became the world’s most affected country. On Sunday, Italy said that 4,825 people had died from the virus there, a third of the world’s total. The UK figure rose by at least 10 on Sunday, with announcements of further deaths in Scotland and Wales. An updated UK-wide figure was expected later.\n“The numbers are very stark, and they are accelerating,” Johnson said in a statement ahead of a planned press briefing later in the day.\n“We are only a matter of weeks — two or three — behind Italy. The Italians have a superb health care system. And yet their doctors and nurses have been completely overwhelmed by the demand.” Johnson’s warning came amid calls for police to enforce warnings to people to socially distance from each other.\nOn Friday, Downing Street announced stronger measures to combat the spread, including the closing of bars, pubs and restaurants. \nMinisters have outlined emergency legislation to give police, public health and immigration officers extra powers to contain the outbreak, expected to come into force this week.\nReports over the weekend of Britons flocking to cafes, beaches, parks and bars fuelled expectations that extra powers being imposed were now inevitable. In London, the worst affe­c­ted city, Mayor Sadiq Khan told the BBC police could have to enforce social distancing.\n“If it is the case that people continue to act in a way that’s leading to this disease spreading, then those sorts of things will have to be considered.” Scotland’s first minister Nicola Sturgeon, at a Sunday press briefing, criticised pubs which opened over the weekend despite being warned not to, claiming they  “put lives at risk”.\n“Close now. We’ll have emergency powers within days to force you to close and we will use these powers if we have to,” she said.\nThere were also signs of a political fallout. Downing Street denied a  “highly defamatory” Sunday Times newspaper story that Johnson’s chief adviser, Dominic Cummings, had initially argued against strict measures to contain the virus, in an argument summed up as  “if that means some pensioners die, too bad”.\nMounting concerns came as authorities in the UK told 1.5 million people most at risk to stay at home for 12 weeks.\nThe government advised vulnerable people such as those with bone or blood cancers to shield themselves from the virus, by confining themselves at home.\n“People should stay at home, protect our NHS and save lives,” said Housing secretary Robert Jenrick.\nHe said the government would get protective gear to NHS staff on the frontline  “as soon as possible” amid fears the virus could be spreading due to a lack of equipment for medics.\nIn a further sign of growing concern, environmental and heritage charity the National Trust said it would close all of its parks and gardens.\nPublished in Dawn, March 23rd, 2020\nBERLIN: German Chancellor Angela Merkel will quarantine herself at home after being treated by a doctor who has since tested positive for the novel coronavirus, a government spokesman said on Sunday.\n“The Chancellor has decided to quarantine herself immediately at home. She will be tested regularly in the coming days [...] (and) fulfil her official business from home,” Steffen Seibert said in a statement.\nThe doctor had visited Merkel on Friday to vaccinate her against the pneumococcus bacteria.\nIt could take some time to determine whether the chancellor is herself infected as  “a test would not yet be fully conclusive,” Seibert said.\nDuring her 15-year term in office Merkel has largely enjoyed robust health, although she suffered repeated shaking spells in public appearances during a summer 2019 heatwave that were never fully explained.\nIn response to the tremors, she chose to sit on a chair when receiving guests with military honours outside the chancellor’s office in Berlin.\nPreviously the veteran leader broke her pelvis in a cross-country skiing accident in 2014.\nPublished in Dawn, March 23rd, 2020\nUK scientists are to track the spread of the new coronavirus and watch for emerging mutations by using gene sequencing to analyse the strains causing thousands of Covid-19 infections across the country, Britain said on Monday.\nResearchers will collect data from samples from infected patients in England, Wales, Scotland and Northern Ireland, the government said in a statement.\nAt least 281 Britons have died from COVID-19, the disease caused by the new coronavirus that has spread around the world in a pandemic.\n\"This virus is one of the biggest threats our nation has faced in recent times, and crucial to helping us fight it is understanding how it is spreading,\" said Sharon Peacock, director of Public Health England’s (PHE) national infection service.\nWorking in teams across Britain, scientists will map out and analyse the full genetic codes of the Covid-19 samples.\n\"Genomic sequencing will help us understand Covid-19 and its spread. It can also help guide treatments in the future and see the impact of interventions,\" Patrick Vallance, the government’s chief scientific adviser, said in the statement.\nIn epidemics, genome sequencing can help scientists monitor small changes in the virus at a national or international scale to understand how it is spreading and whether different strains are emerging. \n\"Right now, the important questions we can help answer with sequencing are to help understand the role of international importations into the UK,\" said Nick Loman, a professor of microbial genomics and bioinformatics at Birmingham University.\nThe 20 million pound ($23 million) project, called the Covid-19 Genomics UK Consortium, will be co-led by the Wellcome Sanger Institute, which specialises in genetic research, PHE and other public health agencies, as well as the National Health Service and several academic institutions.\n\"All viruses accumulate mutations over time, some faster than others,\" said Paul Klenerman, a professor at Oxford University who will be involved in the work. \"For Covid-19, this has only just begun — but this emerging variation can be tracked in detail.\"\nGAZA CITY: Authorities in Gaza on Sunday confirmed the first two cases of novel coronavirus, identifying them as Palestinians who had travelled to Pakis­tan and were being held in quarantine since their return. \nThe United Nations has warned that a Covid-19 outbreak in Gaza could be disastrous, given the high poverty rates and weak health system in the coastal strip under Israeli blockade since 2007. \nFollowing the confirmed cases, a World Health Organisation (WHO) delegation arrived in Gaza to assess the situation, a Palestinian security source said. \nGaza’s health ministry said the two people who tested positive had been held in quarantine since their return from Pakistan on Thursday and had not interacted with the wider population. \n“These two cases were recorded among those who returned to Gaza ... (and) did not mix with the residents of the Gaza Strip,” deputy health minister Yousef Abu Al-Reesh told reporters. \nThe sick, identified as two men, were in stable condition, the health ministry said. \nIsrael has enforced a blockade on Gaza since 2007, when Hamas seized control of the territory. \nIsrael argues the measures are necessary to isolate Hamas, considered a terrorist organisation by most Western countries. \nIsrael and Hamas have fought three wars since 2008. \nMovement in and out of the territory — which was severely restricted by Israel and Egypt before the pandemic — has tightened in response to the coronavirus threat. \nAuthorities in Gaza have said that more than 2,700 Palestinians are in home-isolation, mostly people who had returned from Egypt. \nA civilian group called the Al-Shajaiyah initiative hit the streets of Gaza City on Sunday after the cases were confirmed, working to clean the street with sanitising spray. \n“We in the Gaza Strip have been under siege for 14 years and the possibilities (to protect ourselves) are very limited,” said Ahmad Al Wadya, a doctor helping to coordinate the effort. \nPublished in Dawn, March 23rd, 2020"},"8":{"tilte":"Europe virus toll soars as Asia braces for second wave\n","link":"https:\/\/www.dawn.com\/news\/1542963\/europe-virus-toll-soars-as-asia-braces-for-second-wave","img":"https:\/\/i.dawn.com\/medium\/2020\/03\/5e77add99ba82.jpg","discription":"\nThe death toll from the coronavirus pandemic engulfing Europe catapulted in several hotspots across the continent despite ramped up restrictions to contain the ballooning outbreak, as Asia braced for a possible second wave of infections on its shores.\nThe virus has upended lives across the world, forcing nearly a billion people indoors, closing businesses and schools and sparking economic upheaval that many fear could lead to a global recession unlike any experienced for decades.\nIt has so far killed more than 13,000 people and infected over 300,000 around the world, with the epicentre now in Europe after shifting from China where the virus first emerged late last year.\nItaly marked a grim milestone Saturday, surpassing China's death toll as it confirmed more than 4,800 fatalities — now the worst anywhere in the world.\nSpain, France and the United Kingdom all reported spikes in fatalities and caseloads over the weekend too, with fears mounting that numbers could mushroom in line with Italy's in the coming weeks.\nLockdown measures in Italy have done little to stem the outbreak and the government announced the closure of all non-essential factories.\nPolice patrolled the deserted streets of Rome on Sunday, while checks were carried out on beaches after local officials complained people were defying orders to catch some time in the sun.\nIn his weekly prayer — now being streamed live to avoid attracting crowds — the Pope urged all Italians to follow isolation measures.\n\"Let us do the things that the government asks us to do for the good of us all,\" Pope Francis said.\nSpain has imposed similar restrictive measures, locking millions in their homes and shutting businesses and schools across the country, which has failed to slow the tidal wave.\nIt recorded close to 400 new fatalities on Sunday, bringing the total to 1,720, prompting a dire warning from the Prime Minister.\n\"We must prepare ourselves emotionally and psychologically for very hard days ahead,\" Pedro Sanchez said Saturday.\nResidents across France — where the death toll jumped to 562 — remained shut in their homes, as a curfew was imposed in some regions and the mayor of Paris called for even more drastic confinement measures in a city under lockdown.\nThe UK, meanwhile, inched toward similar measures.\nBritish Prime Minister Boris Johnson on Sunday told 1.5 million high-risk people to stay indoors, as he warned of \"accelerating\" cases.\n\"We are only a matter of weeks — two or three — behind Italy. The Italians have a superb health care system. And yet their doctors and nurses have been completely overwhelmed by the demand,\" he said.\nPubs, restaurants, theatres and leisure centres had already been closed across the country, and the government said it could give police, public health and immigration officers extra powers to contain the outbreak.\nWhile the number of cases in China — which reported its first local infection in four days on Sunday — has slumped dramatically since the crisis began, there are fears in Asia of \"imported\" cases from other hotspots like Europe.\nThailand reported its highest daily rise in cases, taking its total to nearly 600, while Singapore, Hong Kong and Malaysia have also reported a spike after numbers had plateaued earlier.\nMillions of people in India were confined to their homes on Sunday as the country went into lockdown with a one-day nationwide \"self-imposed curfew\".\nNormally bustling streets in the capital New Delhi and the financial hub of Mumbai were mostly deserted and many shops shuttered.\n\"If this helps stop the spread, then the government can think of extending it for two to three more days,\" said Jaiveer Singh, a security guard at Delhi's Lodhi Gardens park, largely empty on Sunday.\nTighter restrictions are now in place elsewhere in Asia, with Australia shutting its borders to foreigners and non-residents and Pakistan suspending international flights.\nMore than a third of Americans were meanwhile adjusting to life in various phases of lockdown, including in New York, Chicago and Los Angeles. Other parts of the United States are expected to ramp up restrictions as well after New Jersey on Saturday told residents to stay indoors.\n\"This is a time of shared national sacrifice, but also a time to treasure our loved ones,\" US President Donald Trump said. \"We're going to have a great victory.\"\nThe US Food and Drug Administration also approved the first coronavirus test that can be conducted entirely at the point of care for a patient — and deliver results in 45 minutes.\nVice President Mike Pence and his wife tested negative for the coronavirus, his press secretary tweeted on Saturday. The couple had taken the test after one of Pence's staffers contracted the illness.\nThe pandemic has bludgeoned global stock markets, and the US — the world's biggest economy — is preparing a huge emergency stimulus package that could reach $4 trillion.\nSeveral European countries have already announced their own stimulus packages to stave off economic collapse, and experts warned the global fallout from the virus could be the worst in decades.\n\"At least for the months March to May, economic data will probably show a contraction not seen before in peacetime,\" Holger Schmieding, an economist with Berenberg, said Sunday.\nThe coronavirus has infected more than 1,200 across Africa, where healthcare systems are limited and social distancing measures are difficult in crowded cities.\nThe Middle East also remains on high alert, where Iran — which suffered a major outbreak — reported 129 deaths on Sunday. But the Islamic Republic has refused to join the rest of the world in imposing heavy restrictions.\nEl Salvador joined several central and South American countries in imposing quarantine measures on Saturday, as Colombia announced its first coronavirus death.\nWhile the elderly and those with pre-existing medical conditions are the hardest hit by the virus, the World Health Organisation has warned that young people are also vulnerable.\nAccurate Covid-19 figures are difficult to reach because many of the victims suffered from other illnesses, and infection rates are uncertain because of a lack of testing in many countries."},"9":{"tilte":"Business, transport suspended in India during 14-hour lockdown for coronavirus\n","link":"https:\/\/www.dawn.com\/news\/1542880\/business-transport-suspended-in-india-during-14-hour-lockdown-for-coronavirus","img":"https:\/\/i.dawn.com\/medium\/2020\/03\/5e772d957485d.png","discription":"\nThe death toll from the coronavirus pandemic engulfing Europe catapulted in several hotspots across the continent despite ramped up restrictions to contain the ballooning outbreak, as Asia braced for a possible second wave of infections on its shores.\nThe virus has upended lives across the world, forcing nearly a billion people indoors, closing businesses and schools and sparking economic upheaval that many fear could lead to a global recession unlike any experienced for decades.\nIt has so far killed more than 13,000 people and infected over 300,000 around the world, with the epicentre now in Europe after shifting from China where the virus first emerged late last year.\nItaly marked a grim milestone Saturday, surpassing China's death toll as it confirmed more than 4,800 fatalities — now the worst anywhere in the world.\nSpain, France and the United Kingdom all reported spikes in fatalities and caseloads over the weekend too, with fears mounting that numbers could mushroom in line with Italy's in the coming weeks.\nLockdown measures in Italy have done little to stem the outbreak and the government announced the closure of all non-essential factories.\nPolice patrolled the deserted streets of Rome on Sunday, while checks were carried out on beaches after local officials complained people were defying orders to catch some time in the sun.\nIn his weekly prayer — now being streamed live to avoid attracting crowds — the Pope urged all Italians to follow isolation measures.\n\"Let us do the things that the government asks us to do for the good of us all,\" Pope Francis said.\nSpain has imposed similar restrictive measures, locking millions in their homes and shutting businesses and schools across the country, which has failed to slow the tidal wave.\nIt recorded close to 400 new fatalities on Sunday, bringing the total to 1,720, prompting a dire warning from the Prime Minister.\n\"We must prepare ourselves emotionally and psychologically for very hard days ahead,\" Pedro Sanchez said Saturday.\nResidents across France — where the death toll jumped to 562 — remained shut in their homes, as a curfew was imposed in some regions and the mayor of Paris called for even more drastic confinement measures in a city under lockdown.\nThe UK, meanwhile, inched toward similar measures.\nBritish Prime Minister Boris Johnson on Sunday told 1.5 million high-risk people to stay indoors, as he warned of \"accelerating\" cases.\n\"We are only a matter of weeks — two or three — behind Italy. The Italians have a superb health care system. And yet their doctors and nurses have been completely overwhelmed by the demand,\" he said.\nPubs, restaurants, theatres and leisure centres had already been closed across the country, and the government said it could give police, public health and immigration officers extra powers to contain the outbreak.\nWhile the number of cases in China — which reported its first local infection in four days on Sunday — has slumped dramatically since the crisis began, there are fears in Asia of \"imported\" cases from other hotspots like Europe.\nThailand reported its highest daily rise in cases, taking its total to nearly 600, while Singapore, Hong Kong and Malaysia have also reported a spike after numbers had plateaued earlier.\nMillions of people in India were confined to their homes on Sunday as the country went into lockdown with a one-day nationwide \"self-imposed curfew\".\nNormally bustling streets in the capital New Delhi and the financial hub of Mumbai were mostly deserted and many shops shuttered.\n\"If this helps stop the spread, then the government can think of extending it for two to three more days,\" said Jaiveer Singh, a security guard at Delhi's Lodhi Gardens park, largely empty on Sunday.\nTighter restrictions are now in place elsewhere in Asia, with Australia shutting its borders to foreigners and non-residents and Pakistan suspending international flights.\nMore than a third of Americans were meanwhile adjusting to life in various phases of lockdown, including in New York, Chicago and Los Angeles. Other parts of the United States are expected to ramp up restrictions as well after New Jersey on Saturday told residents to stay indoors.\n\"This is a time of shared national sacrifice, but also a time to treasure our loved ones,\" US President Donald Trump said. \"We're going to have a great victory.\"\nThe US Food and Drug Administration also approved the first coronavirus test that can be conducted entirely at the point of care for a patient — and deliver results in 45 minutes.\nVice President Mike Pence and his wife tested negative for the coronavirus, his press secretary tweeted on Saturday. The couple had taken the test after one of Pence's staffers contracted the illness.\nThe pandemic has bludgeoned global stock markets, and the US — the world's biggest economy — is preparing a huge emergency stimulus package that could reach $4 trillion.\nSeveral European countries have already announced their own stimulus packages to stave off economic collapse, and experts warned the global fallout from the virus could be the worst in decades.\n\"At least for the months March to May, economic data will probably show a contraction not seen before in peacetime,\" Holger Schmieding, an economist with Berenberg, said Sunday.\nThe coronavirus has infected more than 1,200 across Africa, where healthcare systems are limited and social distancing measures are difficult in crowded cities.\nThe Middle East also remains on high alert, where Iran — which suffered a major outbreak — reported 129 deaths on Sunday. But the Islamic Republic has refused to join the rest of the world in imposing heavy restrictions.\nEl Salvador joined several central and South American countries in imposing quarantine measures on Saturday, as Colombia announced its first coronavirus death.\nWhile the elderly and those with pre-existing medical conditions are the hardest hit by the virus, the World Health Organisation has warned that young people are also vulnerable.\nAccurate Covid-19 figures are difficult to reach because many of the victims suffered from other illnesses, and infection rates are uncertain because of a lack of testing in many countries.\nHundreds of millions of Indians stayed indoors on Sunday, heeding Prime Minister Narendra Modi’s appeal to citizens to self-isolate as authorities battled to contain the fast-spreading coronavirus epidemic.\nAt least 341 people have so far contracted the disease and four deaths have been reported in India due to the coronavirus, according to official data on Sunday.\nWhile the curfew was voluntary and not an outright ban on the movement of people, Modi’s national appeal for social distancing dramatically reduced the number of people taking to India’s densely crowded streets.\n \nIndian Railways, which carries more than 25 million commuters every day, said it has canceled all passenger train services until March 31.\nFirefighters in western India fumigated areas around closed markets, public squares and urban slum districts.\nExperts have warned that the country’s cases are growing at rates seen during the early stages of the outbreak in other countries, which subsequently reported exponential increases in infections.\nWith over 1.3 billion people, India is trying to battle a pandemic with limited resources.\nMinutes before the self-imposed curfew kicked in, Modi said the curbs would help authorities better fight the Covid-19 menace.\n“The steps we take now will help in the times to come,” he said in the tweet.\n \nWhile the curfew will be relaxed by Sunday evening, authorities have declared lockdowns in many cities and suspended several rail and road transport services as fears of community transmission of the virus grew across India.\n \n“The curfew period has given us a chance to scale down each and every activity across India,” said a senior aide to Modi, adding that a more rigid approach could trigger protests or unrest.\n“A breakdown of law and order will be the worst thing to happen at this point of time,” he said, while speaking on condition of anonymity.\nIn India’s financial capital, Mumbai, where millions of people depend on urban rail systems, only workers involved in essential services were allowed to travel on truncated services.\nFactories, large industrial parks and banks were declaring a shutdown or finding ways to minimise public movement in offices.\nVegetable vendors and small tea shop owners were quietly closed down by local police and truck drivers were given free masks and sanitisers at check points on inter-state highways.\nState leaders urged citizens not to rush to villages to prevent the virus spread but tensions have mounted as angry labourers protested at some bus stations against sudden closures of basic transport services.\nRead: Poor Indians flee to villages as coronavirus measures take heavy toll\nPrivate events, such as weddings, and local elections were canceled. The federal government was accelerating the production of masks and has allowed deodorant manufacturers to produce sanitisers.\n \nModi has requested citizens to stand at balconies and near windows on Sunday evening to clap and ring bells to praise emergency personnel and sanitation workers who are on the frontlines in the fight against coronavirus.\nIndia has canceled most entry visas for people flying in from other countries.\nFacebook Inc’s WhatsApp launched a helpline number to ensure circulation of accurate information after India’s technology ministry asked it to ramp up vigilance to prevent spread of misinformation about the virus outbreak.\nWith 400 million users, India is WhatsApp messenger’s biggest market."},"10":{"tilte":"Coronavirus: Can it be contracted twice?\n","link":"https:\/\/www.dawn.com\/news\/1543115\/coronavirus-can-it-be-contracted-twice","img":"https:\/\/i.dawn.com\/medium\/2020\/03\/5e7862c83c09b.jpg","discription":"\nAs the world was still grappling with the spread — and containment — of Covid-19, reports from Japan last month claimed a woman there had contracted the virus for the second time after testing negative for the virus a week earlier and having recovered. \nThe news was troubling for scientists as it is only in very rare circumstances that people contract a virus for a second time as the human body develops immunity to it after the first occurrence. So, is the coronavirus disease any different?\nReports of the relapse in Japan were not the first as cases had earlier been reported in China. However, the authorities had later clarified that they were due to discrepancies in testing and the patients had not contracted the virus again. \nSince then, scientists across the globe have been trying to figure out whether relapse was a possibility, especially considering some countries — United Kingdom and Netherlands most prominently — had chosen to take the ‘herd immunity’ route, which relies on letting a large part of population contract the virus with the expectation that it would strengthen immunity against it. \nWhile experts are struggling to figure out what happened in the case of the Japanese woman, a study in China has revealed that re-exposure to the virus among monkeys who recovered from it once did not result in them contracting the virus for the second time. The study, however, needs to be taken with a pinch of salt as research on the virus is still ongoing and conclusions are yet to be reached.\nMeanwhile, experts are predicting that it is unlikely that a person who has recovered will contract the virus again. \n“It is very likely, based on other viral infections, that yes, once a person has had the infection they will generally be immune and won’t get it again. There will always be the odd exception, but that is certainly a reasonable expectation,” Prof Jon Cohen, emeritus professor of infectious diseases at Brighton and Sussex Medical School, told The Guardian.\n“For the most part, the feeling is once you’ve had a specific coronavirus, you are immune. We don’t have enough data to say that with this coronavirus, but it is likely,” Dr Stephen Gluckman, an infectious diseases physician at Penn Medicine told The Huffington Post. \nThese views are in line with the expectations of United States’ Centres for Disease Control and Prevention (CDC) which said that the virus was dangerous right now because “there’s essentially no immunity against this virus in the population because it’s a new virus”.\nIn short, experts are unsure whether the possibilities of reinfections exist among Covid-19 patients but the majority opinion is that people will eventually develop immunity and it is only in rare cases that the virus will attack again. \nWhile little else is known about the virus, what has been established so far after more than 330,000 cases across the globe, is that it affects different people differently. Some face minor, or no symptoms at all, while others are severely impacted with lung infections and respiratory problems. \nIn many cases, symptoms also take some time in appearing after a person has contracted the virus. A study on Chinese patients showed an inverse relationship between time spent after contracting Covid-19 and lung function, meaning that once it starts affecting the lungs, it continues to cause greater damage until it goes away.\nScientists are also not exactly sure about how much time it takes for a patient to recover but the consensus is that it takes up to 14 days after symptoms begin showing for a patient to recover. In most cases — around 80 per cent — patients recover after showing symptoms such as fever and not much damage to overall body functions takes place. \nThese are categorised by the World Health Organisation (WHO) as mild cases and in these cases. \n \nData from China is now showing that the recovery rates and processes for men and women differ although they are equally likely to contract the disease. \nChinese Centre for Disease Control and Prevention data shows that while 2.8 pc of men who contracted the virus died, only 1.7pc of women did, CNN reported. \nMeanwhile, in South Korea where 61 percent of confirmed infections have been in women, 54 percent of fatalities were made up of men, according to The Washington Post. \nScientists say there could be a number of factors contributing to why men may be more vulnerable, including women having a stronger immune response to viral infections, particularly of the respiratory tract. \nThe group most at risk are the elderly, around a 15pc of whom died because of the virus, followed by those who had cardiovascular disease, diabetes or respiratory diseases. \nWhile most of the mild cases require no treatment, severe cases require supplemental oxygen and for critical patients intensive care and ventilators may be required. \nMild cases take 7-12 for full recovery, but it could take upwards of two weeks for critical patients to fully recover. It is only after two tests taken 24-hours apart that doctors can be confident of a full recovery and discharge patients, European Centre for Disease Prevention and Control says.  \nWhile over 96pc of those who were tested positive for Covid-19 in China recovered, scientists are now reporting that some patients could suffer from reduced lung function even after “full” recovery. Dr Owen Tsang Tak-yin, medical director of the Hong Kong’s Hospital Authority’s Infectious Disease Centre, said two to three of the 12 recover patients were “unable to do things as they had in the past,\" South China Morning Post reported. \n“Some patients might have around a drop of 20 to 30 per cent in lung function,” Dr Tak-yin added.\nRead an account of Chris Gough, an anaesthetist from Oxord, United Kingdom who made a full recovery in 10 days:\n \nResearch by Ebad Pasha "},"11":{"tilte":"Stay indoors, we'll provide the entertainment, says Riz Ahmed\n","link":"https:\/\/www.dawn.com\/news\/1542872\/stay-indoors-well-provide-the-entertainment-says-riz-ahmed","img":"https:\/\/i.dawn.com\/medium\/2020\/03\/5e771cecac426.jpg","discription":"\nWith Covid-19 spreading fast and proving lethal, many across the globe have self-quarantined to not only stay safe but to stop the virus from spreading any further.\nDozens of artists have canceled their tours but are still doing what they do best; provide entertainment. And Riz Ahmed is no different.\nThe rapper, who was set to launch his Long Goodbye tour, took to Instagram to let his fans and followers know that he is still ready to provide entertainment, just with a twist.\nA photo posted by Instagram (@instagram) on Mar 22, 2015 at 11:21am PDT\n \n\"The Long Goodbye tour is turning into the Long Lockdown Festival,\" said Riz.\n\"We want to encourage you to still stay at home though so what we're going to do is, we're going to provide you with some entertainment.\"\nThe Long Lockdown Festival will kick off on Monday with a live viewing of 2010's Four Lions - which turns ten this year - with commentary. The festival also includes the release of a new music video and a live discussion with Hasan Minhaj.\nRiz ended his note repeating, \"Stay indoors, we'll provide the entertainment.\""},"12":{"tilte":"Rihanna donates $5 million to Covid-19 relief efforts\n","link":"https:\/\/www.dawn.com\/news\/1542859\/rihanna-donates-5-million-to-covid-19-relief-efforts","img":"https:\/\/i.dawn.com\/medium\/2020\/03\/5e76fe2681dee.jpg","discription":"\nRihanna‘s Clara Lionel Foundation is giving $5 million to the response efforts against the coronavirus.\nThe money will support “on-the-ground partners working on the frontlines of disaster response especially those focused on protecting and serving marginalized communities — helping the most vulnerable in the United States, the Caribbean and in Africa prepare for what is to come,” the foundation said in a statement.\nThe funding will be channeled through Direct Relief, Partners In Health, Feeding America, the International Rescue Committee, the World Health Organization’s Covid-19 Solidarity Response Fund and others.\n“Never has it been more important or urgent to protect and prepare marginalized and underserved communities –those who will be hit hardest by this pandemic,” CLF’s executive director Justine Lucas said in the statement.\nThe money will go to food banks, testing, healthcare worker training, virus prevention and distribution of critical respiratory supplies."},"13":{"tilte":"The hottest Hollywood party over the weekend happened on Instagram\n","link":"https:\/\/www.dawn.com\/news\/1543129\/the-hottest-hollywood-party-over-the-weekend-happened-on-instagram","img":"https:\/\/i.dawn.com\/medium\/2020\/03\/5e7891ad05d38.jpg","discription":"\nThe most lit party in town Saturday night was on DJ D-Nice’s Instagram, where over 100,000 accounts tuned in during his epic 10-hour set including the likes of Michelle Obama, Oprah, Rihanna and Will Smith.\nOprah tweeted that it was the “best party of 1 and 100K I’ve ever been to.” Smith expressed a similar sentiment. \n \nAs the world practices social distancing to slow the spread of the coronavirus, many have been looking for ways to hang out virutally and D-Nice’s joyous dance party proved to be just the ticket. \nD-Nice has been hosting Club Quarantine parties on his Instagram Live since Wednesday, but it hit a peak Saturday night, attracting entertainers, athletes and politicians to the account, like Missy Elliott, Ellen DeGeneres, Mark Zuckerberg and Magic Johnson.\n \nPresidential hopefuls Joe Biden and Bernie Sanders also stopped by the virtual party, as did Sens. Elizabeth Warren and Kamala Harris. \nA photo posted by Instagram (@instagram) on Mar 22, 2015 at 11:21am PDT\n \nFor most people, the new coronavirus causes only mild or moderate symptoms, such as fever and cough. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia. "},"14":{"tilte":"Harvey Weinstein tests positive for coronavirus in prison\n","link":"https:\/\/www.dawn.com\/news\/1543111\/harvey-weinstein-tests-positive-for-coronavirus-in-prison","img":"https:\/\/i.dawn.com\/medium\/2020\/03\/5e785137dd6a3.jpg","discription":"\nFormer movie producer Harvey Weinstein, who is serving a prison sentence for sexual assault and rape, has tested positive for the coronavirus, according to the head of the state corrections officers union. \nWeinstein, 68, has been placed in isolation at Wende Correctional Facility, said Michael Powers, president of the New York State Correctional Officers and Police Benevolent Association. \nPowers said he learned that the test came back positive on Sunday morning and is concerned about the corrections officers, who he said lack proper protective equipment. Several staff have been quarantined, Powers said. \nWeinstein arrived at Wende Correctional Facility, a maximum security prison east of Buffalo, New York, on Wednesday after being housed at New York City’s Rikers Island jail. \nHe was sentenced to 23 years in prison on March 11 for sexually assaulting former production assistant Mimi Haleyi and raping Jessica Mann, a onetime aspiring actress. \nFollowing the sentencing, Weinstein spent time at Bellevue Hospital in Manhattan for heart problems, according to his spokesman, Juda Engelmayer. He also has other medical issues, including diabetes and high blood pressure. \nA lawyer for Weinstein said on Sunday night that his legal team had not been notified of the coronavirus diagnosis. \n“Given Mr. Weinstein’s state of health, we are of course concerned, if this is the case, and we are vigilantly monitoring the situation,” said lawyer Imran Ansari, who is based in New York. \nThe Niagara Gazette, a local newspaper in upstate New York, reported that Weinstein had tested positive for the highly contagious virus earlier Sunday, citing anonymous officials. \nTwo prisoners at the Wende Facility have confirmed cases of COVID-19, a state prison official told Reuters. The official said he could not comment on any individual prisoner’s medical record. \nThe official told Reuters that, with each confirmed case, the Department of Corrections works with the Department of Health to identify potentially exposed people. \nMark David Chapman, who murdered Beatle John Lennon in 1980, served some of his time at Wende Correctional Facility, as did Robert Chambers, dubbed the “Preppie killer,” who strangled 18-year-old Jennifer Levin in New York City’s Central Park in 1986. \nWeinstein’s conviction was hailed as a victory for the #MeToo movement against sexual misconduct by powerful men. \nMore than 100 women, including famous actresses, have accused Weinstein of sexual misconduct stretching back decades. He has denied the allegations, saying any sex was consensual.\nWeinstein also faces separate sexual assault charges in Los Angeles. \nWeinstein won an Academy Award for producing Shakespeare in Love and was responsible for other acclaimed films including Pulp Fiction, The English Patient and Gangs of New York."},"15":{"tilte":"Qureshi talks to regional peers to fight virus together\n","link":"https:\/\/www.dawn.com\/news\/1543085\/qureshi-talks-to-regional-peers-to-fight-virus-together","img":"https:\/\/i.dawn.com\/medium\/2020\/03\/5e782cd13c34a.jpg","discription":"\nISLAMABAD: Foreign Minister Shah Mehmood Qureshi on Sunday spoke to his counterparts in three countries of the region, including Iran, over the telephone and discussed the prevailing situation regarding the coronavirus outbreak and avenues to fight the pandemic.  \nAccording to separate press releases issued by the Foreign Office, Mr Qureshi talked to Iranian Foreign Minister Javad Zarif, Sri Lanka’s Minister for Foreign Affairs Dinesh Gunawardena and Nepal’s Foreign Minister Pradeep Kumar Gyawali. \nMeanwhile, Prime Minister Imran Khan on Sunday through his official Twitter account once again appealed to the US to lift sanctions on Iran on humanitarian grounds. \n“I want to appeal to (US) President Trump on humanitarian grounds to lift sanctions against Iran till the Covid-19 pandemic is over. The people of Iran are facing untold sufferings as sanctions are crippling Iran’s efforts to fight Covid-19. Humanity must unite to fight this pandemic,” the prime minister tweeted.  \nDuring his telephonic conversation with the Iranian foreign minister, Mr Qureshi conveyed his sorrow over the tragic loss of lives in Iran in the ongoing pandemic. Mr Qureshi commended the government and people of Iran for “valiantly combating the Covid-19 global pandemic”.  \nHe underscored that the pandemic was one of the greatest challenges to confront humanity in a century and successfully overcoming it necessitated both compassion and innovation. \nMr Zarif appreciated Pakis­­tan’s reaffirmation solidarity and call to lift sanctions on Iran.      \nDuring his telephonic conversations with his Sri Lankan and Nepalese counterparts, Mr Qureshi reaffirmed the abiding commitment to the Saarc process and reiterated Pakistan’s readiness to host the Saarc health ministers’ conference to enhance cooperation among member countries and development partners in the health sector particularly focusing on Covid-19. He said a video conference could also be organised first in view of the prevailing global health emergency.\nPublished in Dawn, March 23rd, 2020"},"16":{"tilte":"Pakistan rejects Indian charge of politicising Saarc video moot\n","link":"https:\/\/www.dawn.com\/news\/1542550\/pakistan-rejects-indian-charge-of-politicising-saarc-video-moot","img":"https:\/\/i.dawn.com\/medium\/2020\/03\/5e7579401687e.jpg","discription":"\nISLAMABAD: Foreign Minister Shah Mehmood Qureshi on Sunday spoke to his counterparts in three countries of the region, including Iran, over the telephone and discussed the prevailing situation regarding the coronavirus outbreak and avenues to fight the pandemic.  \nAccording to separate press releases issued by the Foreign Office, Mr Qureshi talked to Iranian Foreign Minister Javad Zarif, Sri Lanka’s Minister for Foreign Affairs Dinesh Gunawardena and Nepal’s Foreign Minister Pradeep Kumar Gyawali. \nMeanwhile, Prime Minister Imran Khan on Sunday through his official Twitter account once again appealed to the US to lift sanctions on Iran on humanitarian grounds. \n“I want to appeal to (US) President Trump on humanitarian grounds to lift sanctions against Iran till the Covid-19 pandemic is over. The people of Iran are facing untold sufferings as sanctions are crippling Iran’s efforts to fight Covid-19. Humanity must unite to fight this pandemic,” the prime minister tweeted.  \nDuring his telephonic conversation with the Iranian foreign minister, Mr Qureshi conveyed his sorrow over the tragic loss of lives in Iran in the ongoing pandemic. Mr Qureshi commended the government and people of Iran for “valiantly combating the Covid-19 global pandemic”.  \nHe underscored that the pandemic was one of the greatest challenges to confront humanity in a century and successfully overcoming it necessitated both compassion and innovation. \nMr Zarif appreciated Pakis­­tan’s reaffirmation solidarity and call to lift sanctions on Iran.      \nDuring his telephonic conversations with his Sri Lankan and Nepalese counterparts, Mr Qureshi reaffirmed the abiding commitment to the Saarc process and reiterated Pakistan’s readiness to host the Saarc health ministers’ conference to enhance cooperation among member countries and development partners in the health sector particularly focusing on Covid-19. He said a video conference could also be organised first in view of the prevailing global health emergency.\nPublished in Dawn, March 23rd, 2020\nISLAMABAD: Pakistan on Friday rejected Indian allegation of politicising Saarc leaders’ video conference on Covid-19 by calling for an end to communication blockade and lockdown of occupied Kashmir as “misleading and mischievous”. \nIn a statement, the Foreign Office said that the Indian Ministry of External Affairs attempted to twist remarks made by the Minister of State for Health Dr Zafar Mirza at the Covid-19 Video Conference of Saarc member countries on March 15. \nDr Mirza, while participating in the conference, had said it was a matter of concern that Covid-19 had been reported from Jammu and Kashmir and in view of the health emergency, it was imperative that the lockdown there must be lifted immediately.  \n“Opening up communication and movement would facilitate dissemination of information, allow distribution of medical supplies and allow containment and relief efforts to proceed unimpeded,” he further said. \nReacting to Dr Mirza’s statement at the conference, Indian External Affairs Ministry Spokesman Raveesh Kumar said: “We believe that the platform was to bring the countries of the region together to address the pandemic. This was not a political platform, but a humanitarian one, and Pakistan misused it.” \nFO says entire world has called for an end to lockdown in Kashmir\nThe FO statement said that Pakistan was not alone in calling for an end to communication blockade and lockdown and numerous voices from within occupied Jammu and Kashmir, India, and the world have also called for the same. \nPakistan, the FO said, participated in the video conference to show solidarity with Saarc members and reaffirm its abiding commitment to the Saarc process. \nThe people of South Asia are well aware as to which country has been seeking to “politicise” the Saarc process and continues to obstruct its onward march, the FO statement reminded. \nThe statement underscored that Pakistan believed the collective endeavours of South Asian nations to fight common challenges should not be allowed to become victim of self-serving propaganda. \nPakistan, it said, had reaffirmed its readiness to host Saarc Health Ministers’ Conference.\nPublished in Dawn, March 21st, 2020"},"17":{"tilte":"Pakistan asks India to lift blockade on IOK to curb spread of coronavirus\n","link":"https:\/\/www.dawn.com\/news\/1542307\/pakistan-asks-india-to-lift-blockade-on-iok-to-curb-spread-of-coronavirus","img":"https:\/\/i.dawn.com\/medium\/2020\/03\/5e7436baadc18.jpg","discription":"\nISLAMABAD: Foreign Minister Shah Mehmood Qureshi on Sunday spoke to his counterparts in three countries of the region, including Iran, over the telephone and discussed the prevailing situation regarding the coronavirus outbreak and avenues to fight the pandemic.  \nAccording to separate press releases issued by the Foreign Office, Mr Qureshi talked to Iranian Foreign Minister Javad Zarif, Sri Lanka’s Minister for Foreign Affairs Dinesh Gunawardena and Nepal’s Foreign Minister Pradeep Kumar Gyawali. \nMeanwhile, Prime Minister Imran Khan on Sunday through his official Twitter account once again appealed to the US to lift sanctions on Iran on humanitarian grounds. \n“I want to appeal to (US) President Trump on humanitarian grounds to lift sanctions against Iran till the Covid-19 pandemic is over. The people of Iran are facing untold sufferings as sanctions are crippling Iran’s efforts to fight Covid-19. Humanity must unite to fight this pandemic,” the prime minister tweeted.  \nDuring his telephonic conversation with the Iranian foreign minister, Mr Qureshi conveyed his sorrow over the tragic loss of lives in Iran in the ongoing pandemic. Mr Qureshi commended the government and people of Iran for “valiantly combating the Covid-19 global pandemic”.  \nHe underscored that the pandemic was one of the greatest challenges to confront humanity in a century and successfully overcoming it necessitated both compassion and innovation. \nMr Zarif appreciated Pakis­­tan’s reaffirmation solidarity and call to lift sanctions on Iran.      \nDuring his telephonic conversations with his Sri Lankan and Nepalese counterparts, Mr Qureshi reaffirmed the abiding commitment to the Saarc process and reiterated Pakistan’s readiness to host the Saarc health ministers’ conference to enhance cooperation among member countries and development partners in the health sector particularly focusing on Covid-19. He said a video conference could also be organised first in view of the prevailing global health emergency.\nPublished in Dawn, March 23rd, 2020\nISLAMABAD: Pakistan on Friday rejected Indian allegation of politicising Saarc leaders’ video conference on Covid-19 by calling for an end to communication blockade and lockdown of occupied Kashmir as “misleading and mischievous”. \nIn a statement, the Foreign Office said that the Indian Ministry of External Affairs attempted to twist remarks made by the Minister of State for Health Dr Zafar Mirza at the Covid-19 Video Conference of Saarc member countries on March 15. \nDr Mirza, while participating in the conference, had said it was a matter of concern that Covid-19 had been reported from Jammu and Kashmir and in view of the health emergency, it was imperative that the lockdown there must be lifted immediately.  \n“Opening up communication and movement would facilitate dissemination of information, allow distribution of medical supplies and allow containment and relief efforts to proceed unimpeded,” he further said. \nReacting to Dr Mirza’s statement at the conference, Indian External Affairs Ministry Spokesman Raveesh Kumar said: “We believe that the platform was to bring the countries of the region together to address the pandemic. This was not a political platform, but a humanitarian one, and Pakistan misused it.” \nFO says entire world has called for an end to lockdown in Kashmir\nThe FO statement said that Pakistan was not alone in calling for an end to communication blockade and lockdown and numerous voices from within occupied Jammu and Kashmir, India, and the world have also called for the same. \nPakistan, the FO said, participated in the video conference to show solidarity with Saarc members and reaffirm its abiding commitment to the Saarc process. \nThe people of South Asia are well aware as to which country has been seeking to “politicise” the Saarc process and continues to obstruct its onward march, the FO statement reminded. \nThe statement underscored that Pakistan believed the collective endeavours of South Asian nations to fight common challenges should not be allowed to become victim of self-serving propaganda. \nPakistan, it said, had reaffirmed its readiness to host Saarc Health Ministers’ Conference.\nPublished in Dawn, March 21st, 2020\nISLAMABAD: Pakistan on Thursday again called on India to lift communication blockade on occupied Jammu and Kashmir and ensure supplies of essential commodities in the valley to contain the spread of COVID-19 and mitigate the suffering of Kashmiris.\n“We call upon the Indian government to lift the communication blackout. Especially in view of the outbreak of COVID-19 and reported cases of affected people in IOK, Pakistan urges India to lift the blockade in the region in order to obtain full information on affected people and provision of essential items and medical supplies to the affected people,” Foreign Office Spokesperson Aisha Farooqui said at the weekly media briefing.\nThe media briefing was held under the new format introduced as part of social distancing measures taken by FO in view of COVID-19. The opening remarks of the spokesperson were televised, while replies to questions received from media persons through emails were included in the transcript issued later.\nSpecial Assistant to Prime Minister Dr Zafar Mirza, while participating in Saarc leaders’ video conference on COVID-19 last Sunday, had emphasised that it was imperative in view of the health emergency that the lockdown in the occupied territory was lifted immediately opening up communications and movement for facilitating dissemination of information, distribution of medical supplies and relief efforts.\nAs of Thursday, four cases were reported from Jammu and Kashmir, while another eight from Ladakh. Two parts of occupied Kashmir were split last August when the Indian government revoked the special status of the occupied region. Despite the growing number of coronavirus cases in the occupied territory, Indian authorities have continued the communication blockade and lockdown of the valley.\nThe Indian government on March 17 extended restrictions on high speed internet in the occupied valley on the pretext of security. Curbs on internet have been in place since Aug 5, when Delhi revoked Article 370 that provided for occupied Kashmir’s special status.\nThe spokesperson said that because of the continuing lockdown, the Kashmiris were being deprived of their fundamental freedoms; their right to liberty, health, education and food.\nAfghanistan\nThe spokesperson called on Afghan factions to implement the US-Taliban Peace Agreement and hoped that it would lead to start of intra-Afghan negotiations.\n“Pakistan has always supported an Afghan-led and Afghan-owned peace process. We hope that after the peace agreement in Doha on 29 February 2020 all sides will move towards intra-Afghan negotiations to establish long-lasting peace in Afghanistan,” Ms Farooqui said.\nThe intra-Afghan talks were scheduled to commence on March 10, but differences between the Afghan government and Taliban over prisoners’ swap agreed under the Doha Accord have blocked further progress.\nUnder the agreement, the Afghan government was to set free 5000 Taliban prisoners and insurgents were to release 1000 captives, but no prisoners have been released so far.\nThe Afghan government, which was not part of US-Taliban negotiations that led to the agreement, conditionally agreed to release 1500 Taliban prisoners in batches, but Taliban refused to accept Kabul’s plan. This difference has led to impasse in the implementation of the peace plan.\nThe situation has been further complicated by the political crisis in Afghanistan because of the controversy over presidential elections.\nPublished in Dawn, March 20th, 2020"}}