{"1":{"tilte":"\n\t\t\tFairview Development Center in Costa Mesa considered for housing coronavirus patients, city asks court for injunction\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/costa-mesa-asks-court-to-stop-relocation-of-patients-diagnosed-with-coronavirus-to-fairview-development-center\/","discription":"\nCosta Mesa officials asked a federal court to block possible plans to house patients who have been exposed to coronavirus at the Fairview Development Center.\nU.S. District Judge Josephine L. Staton issued a temporary restraining order late Friday, Feb. 21, and scheduled a hearing for 2 p.m. Monday, Feb. 24.\nThe city filed its request for a legal injunction on Friday after learning a day earlier that Fairview was being considered by federal and state officials as a quarantine site. State Assemblywoman Cottie Petrie-Norris, whose district includes Costa Mesa, said other sites are also under consideration.  It wasn’t immediately clear where those are.\nFairview is a 60-year-old, state-owned campus on Harbor Boulevard that was once home to about 2,000 people with intellectual and developmental disabilities. It’s now nearly empty as the state has moved residents into community homes and other living situations.\nCity officials don’t yet know how many people might be placed at Fairview, whether they would have tested positive for or be showing symptoms of coronavirus (officially known as COVID-19), what protocols would be followed or how long the center might be used, Costa Mesa Mayor Katrina Foley said. Americans returning from overseas who may have been exposed to the virus have typically been quarantined for 14 days.\n“There’s just so many unknowns. We don’t know what the plan is,” Foley said. “The city has not been part of any of the process that led to the consideration of the site and it would be unfair to not include us in this kind of significant decision that has great impact on our community.”\nWhile the virus can cause severe illness and even death, health and infectious disease experts have said the risk to most Americans is low, noting that it is mainly passed between people who are in close contact via droplets from coughs or sneezes. The Centers for Disease Control and Prevention’s website late Friday listed 14 confirmed cases in the U.S., but a CNN article said the agency is reporting 34 domestic cases, including American cruise ship passengers who just returned to the U.S.\nCosta Mesa’s court filing said federal authorities (including the CDC, Department of Health and Human Services and Department of Defense) and state agencies (including the Governor’s Office of Emergency Services and Department of General Services) propose to relocate “35 to 50 patients already diagnosed with the coronavirus from a secure location on Travis Air Force Base” to Fairview, which was “not intended to house individuals infected with a highly contagious and deadly disease.”\nCity officials are asking the federal court to block a transfer until the site is determined suitable to house the patients.\nFoley said city officials learned of the proposal to quarantine patients at Fairview late Thursday, Feb. 20, and have been trying to get information since then, largely to no avail.\nState Department of General Services spokeswoman Monica Hassan wrote in an email that the directive came from the CDC and any questions should be directed to that agency. Hassan’s department is in charge of state-owned properties including Fairview.\nOfficials with the CDC and state Health and Human Services Agency could not immediately be reached for comment late Friday.\n“The federal government is evaluating a number of potential secondary sites for the treatment of California coronavirus patients,” Petrie-Norris said in an email. She added that she would be shocked if Fairview is chosen, given its location in “a densely populated urban community,” and that her office will share information as it becomes available.\nFairview is surrounded on three sides by a golf course and abuts a residential neighborhood. It includes more than a dozen mostly empty buildings that would likely require substantial preparation to serve as a medical facility."},"2":{"tilte":"\n\t\t\tThe tale of this Marine in the ‘other’ Iwo Jima photo can, at last, be told\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/the-tale-of-this-marine-in-the-other-iwo-jima-photo-can-at-last-be-told\/","discription":"\nBill Seltzer is the fourth Marine on the right in the photo above, the one with his foot on the stump in front of the American flag flying over Mt. Suribachi on Iwo Jima, 75 years ago this Sunday, Feb. 23.\nWe’ve all seen the iconic picture AP Photographer Joe Rosenthal took of the flag being raised, but not many have seen this one he took of a platoon of Marines who made it to the top, smiling and celebrating in front of the flag.\nThose smiles would soon fade as they made the treacherous journey back down the hill.\nSeltzer was attached to Easy Co., 2nd Battalion, 28th Marines, 5th Marine Division. Thirty-six battle-weary members of his platoon began the assault on Mount Suribachi that day — 18 made it to the top.\nBefore he died in 2016 at 89, he opened up about that day to a close friend, J.L. Prieto, also a Marine, who contacted me on behalf of Bill’s widow, Sallie. If I was planning to write anything on the anniversary of the flag raising, could I please mention Bill, they asked?\nThere were a lot of Marines and Navy men who went up that hill after it was secured, but they didn’t fight their way up, Sallie said. Bill did, and he never laid claim to any fame, notoriety, or the title hero — even shying away from the Silver Star, Bronze Star, and Purple Heart he received for being wounded by a sniper’s bullet on his last day on Iwo.\nWould I mention him? I’d be honored to.\n“During the assault, as you can imagine, he lost friends and watched some die just a few feet away, and others in his arms,” Prieto said. “It’s hard for some to believe that after the carnage, the grueling meat grinder that was Mount Suribachi, the men would have smiles on their faces. They thought the worst was behind them.”\nBut soon after this picture was taken, Seltzer’s platoon was ordered to move out, the fight was not done. The Japanese, who had been lying in wait in the tunnels and spider holes, attacked them from the rear, killing another four men in this picture.\n“As Bill was telling me the story, he was reliving the battle again in his mind,” Pietro said. “He was back in the tunnels and the hours of hand to hand combat that he endured after becoming lost inside them. He talked of the relief he felt of finally getting out.\n“None of that ever escaped him, just like the men who died in that place and would never escape their fate – the men he would always call heroes. Bill believed he was the last, living survivor of the men who fought their way to the top of Mount Suribachi, an honor he held, but lamented, as well. I hope you can understand why.\n“He was that man next to you in the grocery aisle, or driving alongside you down Magnolia or Buena Vista boulevards in his beloved Burbank. You would never suspect that he, along with his comrades and brothers in arms, changed the world.”\nSeltzer came home to a 32-year career with NASA, helping put John Glenn and Alan Shepard into space, and piloting his own plane at Whiteman Airport. While at NASA, he also got a P.H.D in medical clinical engineering from UCLA, helping develop the CT scanner and MRI technology.\nOn the seventh day, he rested.\nWith all his accomplishments, the one he was most proud of, and yes, lamented, as well, was standing in front of that American flag on Mount Siribachi with his Marine platoon, he told his wife and Pietro.\nAll of them smiling on the outside for Rosenthal’s camera, but crying inside for their buddies who didn’t make it to the top.\nThe real heroes, Bill Seltzer called them."},"3":{"tilte":"\n\t\t\tNew bill would cap mobile home rent hikes statewide\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/new-bill-would-cap-mobile-home-rent-hikes-statewide\/","discription":"\nCalifornia legislators passed a law last year that limited rent increases for tenants in buildings at least 15 years old.\nBut the measure, AB 1482, did not include mobile homes, allowing park owners to raise space rent as much as they want.\nA new bill unveiled Friday, Feb. 21, would change that.\nAssemblymember Sharon Quirk-Silva, D-Fullerton, unveiled a plan to place rent caps on all California mobile homes. Patterned after AB 1482, the bill would limit future increases to 5% a year plus the cost of living, up to a maximum of 10% a year. Landlords also would be prohibited from raising mobile home rents more than two times a year.\nThe bill would apply both to Californians who rent a mobile home and those who own their own mobile home and rent the land it sits on.\nHomes in the Anaheim section of the Rancho La Paz Mobile Home Park in Anaheim, CA, on Tuesday, March 19, 2019. Residents in the park, which straddles Anaheim and Fullerton, are concerned about steep increases in their rent. (Photo by Jeff Gritchen, Orange County Register\/SCNG)\n\nHomes in the Fullerton section of the Rancho La Paz Mobile Home Park in Fullerton, CA, on Tuesday, March 19, 2019. Residents in the park, which straddles Anaheim and Fullerton, are concerned about steep increases in their rent. (Photo by Jeff Gritchen, Orange County Register\/SCNG)\n\nThe community pool at Rancho La Paz Mobile Home Park in Anaheim, CA, on Tuesday, March 19, 2019. Residents in the park, which straddles Anaheim and Fullerton, are concerned about steep increases in their rent. (Photo by Jeff Gritchen, Orange County Register\/SCNG)\n\nLupe Ramirez, right, led a group of residents in the Rancho La Paz mobile home park to fight significant rent hikes proposed by the park’s new owner. The owner is still increasing the park’s rents, albeit now over time, and the residents also encouraged Fullerton and Anaheim to offer a rent assistance program for seniors. (File Photo by Jeff Gritchen, Orange County Register\/SCNG)\n\nResidents of the Rancho La Paz Mobile Home Park attend a press conference unveiling a new bill to extend rent caps to mobile home tenants statewide. (Photo by Jeff Collins, Orange County Register\/SCNG)\n\nSpeaking at a press conference outside Fullerton City Hall Friday morning, Quirk-Silva said rent protections provided last year to people living in apartments and other rentals need to be extended to those living in mobile homes.\n“Just as (apartment) rents have dramatically increased, mobile-home owners are also faced with drastic rent increases,” a statement from Quirk-Silva’s office said.\nUnlike tenants who rent an apartment or a house, however, those living in mobile homes can’t easily move when their rent becomes unaffordable, Quirk-Silva added at Friday’s press conference.\n“The reality of these is many are built on a foundation,” she said. “And even if they could be moved, where would they move them to (with) rent increasing every day?”\nQuirk-Silva said many residents are one paycheck away from poverty or homelessness.\n“We know that any increases for some members of our community, specifically those who are on a fixed income, can be the next step for them not being able to stay in their home,” she said.\nThe press conference was attended by about 15 residents of the Rancho La Paz Mobile Home Park, a property in Fullerton and Anaheim that faced big rent increases after it changed hands. The new owner reduced the rent hikes and spread them out over time after negotiations with residents, but tenants say the increases eventually will force them out of their homes.\nFor example, rents are set to rise by more than 50% over the next three years.\n“We needed this bill. … A third of our park will probably be homeless after that third increase because there’s no way somebody on a fixed income can come up with this amount of money,” said Lupe Ramirez, head of the Rancho La Paz residents association. “We didn’t get the huge increase, but we still got substantial increases that are not sustainable by our people.”"},"4":{"tilte":"\n\t\t\tUSA Gymnastics asks Nassar survivors to release Steve Penny, USOPC, Karolyis, Don Peters from legal claims\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/usa-gymnastics-asks-nassar-survivors-to-release-steve-penny-usopc-karolyis-don-peters-from-legal-claims\/","discription":"\nSpeaking during a 2018 sentencing hearing for former U.S. Olympic and national team physician Larry Nassar, Rachael Denhollander, a former gymnast and Nassar survivor, asked “How much is a little girl worth?” \n\nAccording to a USA Gymnastics bankruptcy filing Friday night, it’s as little as $82,000. \n\t\t\t\t\t\t\nIn a disclosure statement filed with U.S. Bankruptcy Court for the Southern District of Indiana, USA Gymnastics said it is asking Nassar survivors to accept a settlement agreement that would pay $1.25 million to former Olympic and World Championships team members who were abused by Nassar but $82,550 to others. \n\nThe settlement agreement releases the U.S. Olympic and Paralympic Committee, former USA Gymnastics CEO Steve Penny and former national team directors Bela and Martha Karolyi from all claims but does not address the extent USA Gymnastics officials were aware of the predatory behavior of Nassar and others and to what steps, if any, they took to conceal that sexual abuse from unknowing potential victims. \nThe proposed $217-million settlement is part of a reorganization plan USA Gymnastics filed with the court earlier this year. USA Gymnastics filed for Chapter 11 protection in December 2018. \n\nThe 77-page filing states that if they approve the settlement agreement, the 517 Nassar survivors would agree to release “any and all claims arising from or related to Abuse Claims or Future Claims.” \n\nIn addition to the USOPC, Penny, the Karolyis and five Karolyi-related businesses, the settlement proposal also calls for the release of former U.S. Olympic team and SCATS coach Don Peters, 2012 Olympic coach John Geddert, former USA Gymnastics senior vice president Rhonda Faehn, former USA Gymnastics board chairman Paul Parilla, former USA Gymnastics president Bob Colarossi, former USA Gymnastics national teams manager Amy White, former USA Gymnastics sports medicine official Debra Van Horn and the All Olympia Gymnastics Center in Southern California. \n\n“USOPC is a beneficiary of the Settlement Election’s release and its injunctions,” according to the filing. \n\n“The only way the USOPC will agree to” the settlement “is if it is protected by the release and injunctions described” in the agreement. \nThe proposed settlement, an attorney for USA Gymnastics wrote in the filing, “is in the best interests of, and provides the highest and most expeditious recovery to, all parties who hold claims” against the organization. \n\nThe disclose statement outlines how the survivors would be broken up into four groups. Women who were sexually abused by Nassar at the Olympics, Worlds, national team training camps or other national team events would receive $1,250,757 each. Simone Biles, the four-time Olympic and 19-time World champion, and all five members of the record setting 2012 Olympic gold medal-winning team said they were abused by Nassar while they represented the U.S. at the Olympic Games, World Championships and other major international competitions as well as national team training camps at the Karolyi Ranch in Central Texas. \n\nNon-elite gymnasts sexually abused at USA Gymnastics-sanctioned events would receive $508,670 each. Individuals abused at non-USA Gymnastics locations would receive $174,401 each and individuals with “derivative claims” $82,550 each. \n\n“Let’s be clear for parents considering putting your child in a gym sanctioned by USA Gymnastics what USA Gymnastics is saying if we place a known pedophile in that gym and that individual rapes your child then your child is worth $82,000,” said John Manly, an attorney for dozens of Nassar survivors. “My client Rachael Denhollander asked what is a little girl worth. Apparently if you’re raped by the national team doctor you’re worth $82,000 to USA Gymnastics. \n\n“This is the most disgusting, reprehensible, vile view of children I can imagine. And for (USA Gymnastics) to put this out there and act like it is a constructive step shows how out of touch they are. Steve Penny was so bad USA Gymnastics banned him for life, the Karolyis, every one of them, and they pay nothing. They have no consequences. What message does that send to the next Steve Penny? The message is you get off scot free. You’re better off putting your kids in roller derby.” \n\n Under the heading “non-monetary commitments and reforms” USA Gymnastics states in the filing that “in addition to compensating survivors…USAG is committed to taking concrete action to address concerns that survivors and others have raised about the organization and its culture.” But neither the disclosure statement or a reorganization plan filed with the bankruptcy court last month make any mention of USA Gymnastics disclosing documents or information that would reveal the organization’s role and that of others in creating the culture of abuse within the sport that enabled Nassar’s abuse. \n\nUSA Gymnastics in the disclosure statement does assert that the organization has made “significant progress” in taking steps to prevent future abuse. The filing states that “one of the most significant changes USAG made during the case was its decision to hire Li Li Leung” as the organization’s CEO last year. \n\nLeung receives $450,000 in annual compensation and as much as $90,000 annual in bonuses, according to financial records and court filings. \n\nUSA Gymnastics is facing hundreds of lawsuits across the country that allege the organization and its top officials and coaches fostered a culture of abuse that enabled the predatory behavior of Nassar and other coaches and officials, and then, in consultation with U.S. Olympic and Paralympic Committee and FBI officials, attempted to conceal that sexual abuse from the public. \n\nUSA Gymnastics filed for protection under Chapter 11 in U.S. Bankruptcy for the Southern District of Indiana in December 2018. \n\nThat Chapter 11 filing prompted an automatic stay on all legal proceedings and litigation, including discovery, against USA Gymnastics, and the USOPC’s efforts to strip the organization of its national governing body status. \n\nThe USOPC has not said if it proceed with the decertification process, should a settlement be reached. \n\nThe proposal comes after months of talks between attorneys for USA Gymnastics and the hundreds of Nassar survivors have stalled with the two sides still hundreds of millions of dollars apart. It also follows a motion filed by attorneys for the survivors in January asking the bankruptcy court to dismiss USA Gymnastics’ bid for Chapter 11 protection. \n\n“USAG\/USOC, and its revolving door of executives since, have done everything in their collective power to conceal the truth from Nassar’s hundreds of survivors, the more than 100 survivors of abuse suffered at the hands of coaches over the past several decades, law enforcement authorities, and the American public,” James I. Stang, an attorney for a committee representing survivor wrote in the January filing. “The coordinated strategy of USAG and the USOC was, and remains to be, to delay, deflect and deny them and non-Nassar survivors justice for the horrible crimes committed upon them as children. Sadly, USAG and the USOC have used this bankruptcy proceeding as yet another tool to inflict pain upon these sexual abuse survivors – both Nassar and non-Nassar survivors – and to deny justice to these girls and women who competed for this institution and their country.” \n\nUnder the reorganization plan, USA Gymnastics proposes two options of for sexual abuse survivors: accept $215 million to settle all claims or continue to pursue judgments in civil suits from insurance policies available to the organization. \n\nIf the survivors vote to accept the settlement, the insurers for a Michigan gym owned by the family of former U.S. Olympic coach John Geddert would also contribute an additional $2.125 million to the settlement amount. Nassar routinely treated young athletes at the gym, Twistars, located near Lansing. \n\nUSA Gymnastics’ proposed settlement is less than half the $500 million settlement Michigan State reached with survivors of sexual abuse by Nassar, a former member of the Michigan State sports medicine staff. \n\nNassar is serving a 60-year federal prison sentence on child pornography charges. He was also sentenced in Ingham County, Michigan, last January to 40 to 175 years for child sexual assault and 40-125 years in Eaton County, Michigan, on similar charges in February. \n\nPenny was first informed of Nassar’s sexual abuse of U.S. national team member Maggie Nichols in June 2015. In the following weeks Penny was also informed that Olympic champions Aly Raisman and McKayla Maroney had also likely been sexually assaulted by Nassar. Yet Penny kept the abuse hidden from the public until September 2016, working with FBI agents in the bureau’s Indianapolis office, other USA Gymnastics officials and board members, as well as an attorney for the organization, according to documents obtained by the Southern California News Group. \n\nNassar, according to court documents, sexually abused at least 40 young athletes between Penny’s first contact with the FBI agent in charge of the bureau’s Indianapolis office in July 2015 and September 2016, when Nassar’s abuse became public. The number of victims in that window could actually surpass 100, according to persons familiar with dozens of Nassar-related lawsuits. \n\nNassar was allowed to retire as U.S. national team coach in September 2015 without he or USA Gymnastics describing the reason behind his departure. \n\nPenny was arrested in October 2018 after a Texas grand jury indicted him on felony evidence tampering charges. The indictment alleges Penny ordered the removal of documents from the Karolyi Ranch related to Nassar’s activities. \n\n“The indictment further alleges that the removal of the documents was done for the purpose of impairing the ongoing investigation by destroying or hiding the documents,” according to the Walker County, Texas District Attorney’s office. \n\nPenny was fired as USA Gymnastics CEO and president in March 2017 under pressure from the USOPC. He has denied any wrongdoing. \n\nFaehn, then USA Gymnastics senior vice president for its women’s program, was informed of concerns about Nassar’s procedures on June 17, 2015 by Sarah Jantzi, Maggie Nichols’ club coach. Jantzi told Faehn that Nichols described “three uncomfortable encounters of therapy with Nassar”  including massaging her groin area “too close to the vagina.” \n\nFaehn reported the call to Penny that day. It would be weeks, however, before Penny and other USA Gymnastics officials contacted the FBI about Nassar. Faehn was forced out at USA Gymnastics in May 2018. \n\n“Unbelievably painful… total disregard for the athletes that were used, abused, and now swept to the side!” John Nichols, Maggie’s father, wrote on twitter Friday night after the Orange County Register first posted details from the disclosure statement. \n\nWhite, the USA Gymnastics national teams manager, on Penny’s orders removed several boxes of medical records and other documents relevant to the Larry Nassar investigation from the Karolyi Ranch in November 2016, according to Faehn in a sworn deposition. \n\nFaehn said in the deposition that White in March confided to her that Penny called her and told her to remove records from the Karolyi Ranch and transport them to USA Gymnastics headquarters in Indianapolis. \n\nWhite told Faehn that after returning to the headquarters “she gave them to Steve Penny,” Faehn said referring to the medical records. \n\nPeters, the coach of the groundbreaking 1984 U.S. Olympic women’s team, was banned for life by USA Gymnastics in 2011 following a Register investigation that reported he had sex with three teenage gymnasts. \n\n  \n\n  \n\n  \n  \n\t\t\t"},"5":{"tilte":"\n\t\t\tCaltrans identifies sites, many near freeways, for emergency homeless shelters\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/caltrans-identifies-sites-many-near-freeways-for-emergency-homeless-shelters\/","discription":"\nSmall, undeveloped pieces of Caltrans property near freeway ramps and interchanges account for all but one of nine state-owned sites in Orange County identified Friday as spots where emergency shelters could be placed.\nThe one exception: the state-owned Fairview Developmental Center in Costa Mesa, where earlier this month only two residents remained in the cluster of buildings designed to hold hundreds of people with developmental and intellectual disabilities.\nIn a Feb. 21 news release to accompany the \n“The state is stepping up by making land available to cities and counties willing to meet this moment head-on,” Newsom is quoted in the release. Newsom made a similar pledge in his \n“I invite local leaders to use this land.”\nIn addition to the parcels identified in Orange County, the map released Friday shows 19 sites in Los Angeles County, three in Riverside County, and 20 in San Bernardino County.\nThe properties would be leased to local governments for $1 and could be converted to help the homeless on a temporary, emergency basis. The governor’s plan includes $650 million in State Emergency Homeless Aid to help build out the sites.\nThe response from the Orange County communities that hold the state-owned sites — Anaheim, Costa Mesa, Newport Beach, Santa Ana — is unclear.\nSanta Ana is home to five of the locations identified by the state. The city’s residents and officials have long complained that Santa Ana is the dumping ground for the county’s homeless population and last month filed a lawsuit against the county and three cities suggesting race plays a role in that pattern. That \nHomeless advocates repeatedly have called for using the 114-acre Fairview campus in Costa Mesa to house people. The "},"6":{"tilte":"\n\t\t\tKobe Bryant’s pilot counseled on flying in low visibility after improper flight path in 2015\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/kobe-bryants-pilot-counseled-on-flying-in-low-visibility-after-improper-flight-path-in-2015\/","discription":"\nKobe Bryant’s helicopter pilot violated federal flight rules in 2015 when he flew without permission into Los Angeles International Airport’s airspace in weather conditions that affected his ability to maintain visual clearance as required by the tower, records show.\nAra Zobayan, who piloted the Island Express Helicopter that crashed last month into a fog-shrouded hillside in Calabasas, killing Bryant, his daughter and seven other people, was counseled after the 2015 incident on, among other things, “reviewing weather and anticipating required action,” according to Federal Aviation Administration enforcement records obtained Friday under the Freedom of Information Act.\nZobayan’s history as a pilot is part of the National Transportation Safety Board’s investigation into the cause of the fiery crash. The NTSB has issued an initial report that the engine did not appear to have failed.\nThe FAA enforcement documents said on May 11, 2015 Zobayan was operating an AS350 helicopter near Hawthorne Airport and the 105 Freeway. He was expecting, the report says, to enter the busy LAX airspace.\nZobayan was told by the tower that the airfield was reporting less than what is called basic visual flight rules – that is, three miles of visibility and a cloud ceiling of at least 1,000 feet.\nThe tower denied Zobayan’s request to circumvent the visual requirement, but he still entered – flying by sight – while communicating with the tower, records show. FAA officials later concluded that “had Mr. Zobayan properly planned and reviewed current weather at LAX, he would have been able to anticipate the required action to transit (LAX airspace).”\nZobayan subsequently reported the incident to the proper authorities and admitted his error, records say. No remedial training was required. However, he was counseled on operating in LAX airspace and flying under special visual flight rules for bad weather.\n“There are no indications this is a repeated incident and there are no signs that this incident is a trend with Mr. Zobayan,” the FAA documents say.\nSince the crash, questions were raised about the absence of a terrain warning system, which the helicopter was not required to have. The system gives detailed visuals of surrounding terrain and triggers alerts.\nA recurring topic about the incident has been the presence of fog that Sunday morning.\nA witness on a bike trail told investigators that the area was surrounded by mist when he heard the helicopter. The sound got louder and he saw the blue and white aircraft emerge from clouds before hitting the ground.\nSince then, memorials for the basketball star and the other passengers have been held all over Southern California. Last week, the Lakers announced how people can try to get tickets for the highly anticipated \n \n "},"7":{"tilte":"\n\t\t\t$50 million settlement OK’d to improve state’s student literacy\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/20\/50-million-settlement-okd-to-improve-states-student-literacy\/","discription":"\nA judge approved the settlement of a lawsuit that will establish a $50 million grant program to improve literacy instruction in schools statewide on Thursday, Feb. 20.\nLos Angeles Superior Court Judge Rupert Byrdsong’s action brought a final resolution to the case filed by the plaintiffs in December 2017. The plaintiffs maintained that the state constitution requires that all public school students have basic reading and writing instruction.\nFunding for the settlement of the lawsuit is included in Gov. Newsom’s proposed 2020 budget and is subject to approval by the state legislature.\nThe settlement includes $50 million in block grants for 75 low-performing elementary schools to develop and implement customized three-year literacy action plans. It mandates that block grant recipients push for community engagement and examine the instructional, school climate and other factors that have led to low student achievement.\nThe resolution additionally calls for moving away from punitive school discipline practices and the issuance of state guidelines to reduce racially disproportionate discipline.\nThe case was named for “Ella T.,” one of 10 students from Los Angeles, Inglewood and Stockton who were listed along with two advocacy organizations as plaintiffs in the lawsuit.\nLos Angeles Unified Superintendent Austin Beutner released a statement in response to the settlement, saying reading is “the foundation of learning.”\nHe said the resolution “is a step in the right direction, but only a small step” in the search for improving literacy.\n“A generation ago, California’s public education system led the nation with well-funded schools serving the needs of the entire community and great student outcomes,” Beutner said. “Unfortunately, that’s no longer the case. School funding is not stable or adequate and achievement is lagging. Per-pupil funding in Los Angeles has fallen relative to other parts of the country and is now 40% less than in New York.”\nYet, last year there were record-high graduation rates, record-low suspension rates and increases across the board in student achievement, all of which demonstrate that progress is being made, Beutner said.\n“There is talent in every seat in every classroom in every one of the 1\nPlaintiff’s attorney Mark Rosenbaum of the Public Counsel law firm said the most urgent struggle for social justice in the U.S. has been access to literacy.\n“The right to read is not just the cornerstone of education, it is the cornerstone of our democracy,” Rosenbaum said. “Without it, we continue to build a future on the illusion that the ‘haves’ compete on the same terms with the ‘have nots.”‘\nErik Olson, another plaintiffs’ lawyer, said the settlement is “a tremendous victory for the courageous families and community leaders who demanded that the state of California fulfill its obligation to provide every child the opportunity to learn to read.”"},"8":{"tilte":"\n\t\t\tInstead of another gated community, Porter Ranch and Chatsworth get 257 acres of lovely, preserved open space\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/instead-of-another-gated-community-porter-ranch-and-chatsworth-get-257-acres-of-lovely-preserved-open-space\/","discription":"\nIt was once slated to become yet another suburban gated community with a bucolic name in the northern reaches of Porter Ranch and Chatsworth.\nBut on Friday, there was little doubt that the 257-acre swath of hills near the Aliso Canyon Gas Storage Facility was to remain what it has long been — the home of the oaks, mountain lions, southern spotted owla and other flora and fauna.\nA blessing ceremony by the Tataviam tribe marked the occasion, a dedication of the new parkland attended by state and county officials who had pooled their resources to buy the property last November from a developer that wanted to build a gated community of 188 luxury homes on that land.\nThe housing development was to be called Hidden Creeks Estates. Now the name Hidden Creeks is being used to refer to the newly established parkland in an unincorporated part of Porter Ranch, at Browns Canyon Road north of the 118 Freeway at Desoto Avenue.\nA ribbon-cutting ceremony on Friday, February 22, 2020,  officially opened the 257-acre, $6.7 million Hidden Creeks parkland in the Chatsworth Hills.  The space is located in Browns Canyon Road above the 118 Freeway at DeSoto Avenue.  Speakers included Paul Edelman, Mountains Recreation and Conservation Authority, Joseph T. Edmiston, Executive Director, Santa Monica Mountains Conservancy, Craig Campbell, Starwood Land Advisors, Rudy Ortega Jr., Tribal President, Fernando Tataviam Band of Mission Indians, Irma Munoz, Chair, Santa Monica Mountains Conservancy, John Donnelly, Executive Director, California Wildlife Conservation Board, Kathryn Barger, Los Angeles County Supervisor, 5th District and Henry Stern, California State Senator, 27th District. (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nA Tataviam blessing was given by Alan Salazar.  A ribbon-cutting ceremony on Friday, February 22, 2020,  officially opened the 257-acre, $6.7 million Hidden Creeks parkland in the Chatsworth Hills.  The space is located in Browns Canyon Road above the 118 Freeway at DeSoto Avenue.  (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nA Tataviam blessing and song were given by Rudy Ortega Jr., Alan Salazar and Mark Villasenor.  A ribbon-cutting ceremony on Friday, February 22, 2020,  officially opened the 257-acre, $6.7 million Hidden Creeks parkland in the Chatsworth Hills.  The space is located in Browns Canyon Road above the 118 Freeway at DeSoto Avenue.  (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nA ribbon-cutting ceremony on Friday, February 22, 2020,  officially opened the 257-acre, $6.7 million Hidden Creeks parkland in the Chatsworth Hills.  The space is located in Browns Canyon Road above the 118 Freeway at DeSoto Avenue.  (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nA couple look at maps of the area before the ceremony.  A ribbon-cutting ceremony on Friday, February 22, 2020,  officially opened the 257-acre, $6.7 million Hidden Creeks parkland in the Chatsworth Hills.  The space is located in Browns Canyon Road above the 118 Freeway at DeSoto Avenue.  (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nA ribbon-cutting ceremony on Friday, February 22, 2020,  officially opened the 257-acre, $6.7 million Hidden Creeks parkland in the Chatsworth Hills.  The space is located in Browns Canyon Road above the 118 Freeway at DeSoto Avenue.  (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nKathryn Barger, Los Angeles County Supervisor, 5th District , speaks during the ceremony.  A ribbon-cutting ceremony on Friday, February 22, 2020,  officially opened the 257-acre, $6.7 million Hidden Creeks parkland in the Chatsworth Hills.  The space is located in Browns Canyon Road above the 118 Freeway at DeSoto Avenue.  (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nHenry Stern, California State Senator, 27th District speaks during the ceremony.  A ribbon-cutting ceremony on Friday, February 22, 2020,  officially opened the 257-acre, $6.7 million Hidden Creeks parkland in the Chatsworth Hills.  The space is located in Browns Canyon Road above the 118 Freeway at DeSoto Avenue.  (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nA ribbon-cutting ceremony on Friday, February 22, 2020,  officially opened the 257-acre, $6.7 million Hidden Creeks parkland in the Chatsworth Hills.  The space is located in Browns Canyon Road above the 118 Freeway at DeSoto Avenue.  Speakers included Joseph T. Edmiston, Executive Director, Santa Monica Mountains Conservancy, Rudy Ortega Jr., Tribal President, Fernando Tataviam Band of Mission Indians, Irma Munoz, Chair, Santa Monica Mountains Conservancy, John Donnelly, Executive Director, California Wildlife Conservation Board, Kathryn Barger, Los Angeles County Supervisor, 5th District and Henry Stern, California State Senator, 27th District. (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nLupine grows next to a trail.  A ribbon-cutting ceremony on Friday, February 22, 2020,  officially opened the 257-acre, $6.7 million Hidden Creeks parkland in the Chatsworth Hills.  The space is located in Browns Canyon Road above the 118 Freeway at DeSoto Avenue.  (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nA ribbon-cutting ceremony on Friday, February 22, 2020,  officially opened the 257-acre, $6.7 million Hidden Creeks parkland in the Chatsworth Hills.  The space is located in Browns Canyon Road above the 118 Freeway at DeSoto Avenue.  (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nA ribbon-cutting ceremony on Friday, February 22, 2020,  officially opened the 257-acre, $6.7 million Hidden Creeks parkland in the Chatsworth Hills.  The space is located in Browns Canyon Road above the 118 Freeway at Desoto Avenue.  (Photo by Dean Musgrove, Los Angeles Daily News\/SCNG)\n\nIt joins 11,000 acres of open space also under the care and possession of the Mountains and Recreation Conservation Authority. The Hidden Creeks land belongs to the Santa Susana Pass intermountain range habitat linkage that connects the Simi Hills to the Santa Susana Mountains, according to the state.\nEfforts to preserve the land has been more than a decade in the making, but the $6.7 million purchase deal was finally struck just a month after the Saddleridge Fire had raced uncomfortably close to the natural gas storage that had experienced a massive, months-long leak in 2015, and several gated communities in Porter Ranch, some still under construction.\nThe county paid $1.6 million, the state footed $4.9 million and the MRCA and the Santa Monica Mountains Conservancy put in $200,000 to buy the land.\nState Sen. Henry Stern, who was on hand Friday to mark the opening of the park, \n“By protecting Hidden Creeks, the board (\nCounty Supervisor Kathryn Barger \nThe Hidden Creeks Estates housing project had long faced opposition, and efforts to purchase the land have spanned more than a decade. Last January, the Los Angeles Department of City Planning "},"9":{"tilte":"\n\t\t\tLA’s temporary suspension of Uber’s JUMP e-bikes upheld\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/11\/las-temporary-suspension-of-ubers-jump-e-bikes-upheld\/","discription":"\nA city hearing officer upheld the Los Angeles Department of Transportation’s temporary ban on Uber’s JUMP e-bicycles Tuesday, Feb. 11. The ban was implemented after the company refused to provide the city with real-time data on its ridership.\nThe Los Angeles Department of Transportation instituted the temporary suspension on Uber from dispersing JUMP bikes in November.\n“LADOT requires for-profit mobility companies share verifiable data on their vehicles,” LADOT stated in a prepared statement. “Today’s decision denying Uber’s appeal upholds the city’s common-sense permit requirements, which protect safety and quality of life for L.A. residents.”\nHearing officer David Shapiro said in his ruling that JUMP representatives did not provide evidence of people being “re-identified” when providing data to the city, but LADOT did not provide an example of how five-second data reporting would solve any transportation problems.\nRegardless, Shapiro said JUMP knew the requirements when it entered the city’s dockless mobility program and that it violated the provisions by not providing the data.\nAccording to a letter from the LADOT, Uber stated that it could not comply with the permit requirements as the company’s policies prevented it from meeting the “mobility data specification,” which would give the city information on how the bikes are used.\nThe specification enables cities to manage dockless scooters, bikes, taxis and buses.\n“Every other company that is permitted in Los Angeles is following the rules,” Transportation Department spokeswoman Connie Llanos said in November. “We look forward to being able to work with Uber on getting them into compliance.”\nOther dockless forms of transportation have been allowed to operate within the city such as Lime scooters.\n“This administrative step was largely expected,” Uber said in a statement. “JUMP supports sharing operational mobility data with LADOT, but we have been clear for months that we have serious privacy concerns about LADOT’s requirements to collect real-time, individual trip data on our riders in Los Angeles.\n“We believe that best-in-class data aggregation methods could deliver LADOT near-real time data, while protecting the identity of Los Angeles residents and our riders.”\nThe Uber statement also said that LADOT created a “narrow appeal process” that did not address the company’s privacy concerns. Uber is assessing its legal options, and in the meantime expects its bikes and scooters to remain on the city streets.\nThe Los Angeles City Council last year adopted a pilot program that regulates the number of electric bicycles and scooters each company can have in its fleet.\nAfter demonstrating compliance with program requirements and meeting certain performance criteria, LADOT can allow companies to increase their fleet size."},"10":{"tilte":"\n\t\t\tHow to watch the Kobe and Gianna Bryant memorial on TV\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/how-to-watch-the-kobe-and-gianna-bryant-memorial-on-tv\/","discription":"\nOfficials are urging those who don’t have ticket to the Monday, Feb. 24, 2020 memorial for Kobe Bryant and his daughter Gianna to \nIt will NOT be shown on TVs in the LA Live area near Staples Center, said LA police Chief Michel Moore. \n\t\t\t\t\t\t\nThe memorial service is set to begin at 10 a.m. Pacific time Monday, and it is expected to be broadcast on all of the major television networks as well as other local LA stations. \nABC News is among those broadcasting the event and offering \nStaples Center officials say the event should end about 1 p.m. \n\n  \n\n  \n"},"11":{"tilte":"\n\t\t\tWeinstein jury indicates it is split on most serious counts\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/weinstein-jury-indicates-it-is-split-on-most-serious-counts\/","discription":"\nBy TOM HAYS and MICHAEL R. SISAK\nNEW YORK — Jurors deliberating in Harvey Weinstein’s rape trial indicated Friday that they are deadlocked on the most serious charges, but the judge told them to keep trying.\nIn a note sent to the judge during their lunch break, jurors asked if it were permissible for them to be hung on two counts of predatory sexual assault while reaching a unanimous verdict on other charges.\nAfter consulting with prosecutors and Weinstein’s lawyers, Judge James Burke told the jury of seven men and five women to keep working toward a unanimous verdict on all charges and sent them back to continue deliberating Shortly thereafter, the judge sent the jury home for the day. Deliberations will resume Monday.\nWeinstein’s lawyers said they would accept a partial verdict, but prosecutors said no and Burke refused to allow it.\nThe jury, in its fourth day of deliberations, has been particularly focused on the key aspect of two counts of predatory sexual assault: “Sopranos” actress Annabella Sciorra’s allegations that Weinstein raped and forcibly performed oral sex on her in the mid-1990s. Those charges carry a maximum penalty of life in prison.\nIn all, Weinstein, 67, is charged with five counts stemming from the allegations of Sciorra and two other women — an aspiring actress who says he raped her in March 2013 and a former film and TV production assistant, Mimi Haleyi, who says he forcibly performed oral sex on her in March 2006.\nTo convict Weinstein of a predatory sexual assault charge, jurors must agree on two things: that Weinstein raped or sexually assaulted Sciorra and that he committed one of the other charged offenses. The predatory sexual assault charge requires prosecutors to show that a defendant committed a prior rape or other sex crime, but doesn’t have the statue of limitation constraints that would bar Sciorra’s allegations from consideration on their own.\nWeinstein has maintained any sexual encounters were consensual.\nThe Associated Press has a policy of not publishing the names of people who allege sexual assault without their consent. It is withholding the name of the 2013 rape accuser because it isn’t clear whether she wishes to be identified publicly.\nJurors started the day Friday by listening to a reading of Sciorra’s cross-examination and follow-up questioning by prosecutors. About 90 minutes into the reading, the jurors notified the judge they had “heard enough” and resumed their deliberations.\nSciorra testified nearly a month ago. She was the first accuser to do so in the closely watched #MeToo trial.\nThe jury has already focused on emails that Weinstein sent regarding Sciorra, including ones to the private Israeli spy agency he allegedly enlisted to dig up dirt on would-be accusers as reporters were working on stories about allegations against him in 2017.\nSciorra, now 59, told jurors how the once-powerful movie mogul showed up unexpectedly at the door of her Manhattan apartment before barging in and raping and forcibly performing oral sex on her in late 1993 or early 1994.\nOn cross-examination, Sciorra was grilled about why she opened her door in the first place and didn’t find a way to escape if she was under attack.\nWeinstein lawyer Donna Rotunno asked: “Why didn’t you try to run out of the apartment? Did you scratch him? Try to poke him in the eyes?”\nProsecutors say Sciorra weighed only about 110 pounds (50 kilograms) in those days, making her no match for the 300-pound (135-kilogram) Weinstein.\n“He was too big” to fight off, she told the jury. “He was frightening.”\nSciorra went public in a story in The New Yorker in October 2017 after one of the few people she says she told about the incident, actress Rosie Perez, got word to reporter Ronan Farrow that he should call her.\nSciorra didn’t get involved in the criminal case until later. Her allegations weren’t part of the original indictment when Weinstein was arrested in May 2018, but after some legal shuffling they were included in an updated one last August.\nWeinstein’s lawyers fought to get her nixed from the case in the run-up to the trial, arguing to no avail that prosecutors shouldn’t be allowed to use her claims because they predated the enactment of the predatory sexual assault charge in 2006.\nWeinstein’s lawyers have also argued that it’s plainly unfair to make the producer defend himself against something alleged to have happened more than a quarter-century ago. They contend prosecutors shoehorned Sciorra into the case to get a marquee name on the witness stand.\n“Annabella was brought into this case for one reason and one reason only,” Rotunno said in her closing argument last week. “She was brought in so there would be one witness who had some star power, one witness you may recognize and one witness whose name may mean something.”\n \n "},"12":{"tilte":"\n\t\t\tU.S.: Taliban’s ‘reduction of violence’ deal to start tonight, culminating with peace pact signing\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/us-talibans-reduction-of-violence-deal-to-start-tonight\/","discription":"\nBy KATHY GANNON and MATTHEW LEE\nISLAMABAD — The seven-day “reduction of violence” deal promised by the Taliban will begin on Friday night, a senior U.S. State Department official said, without specifying the exact time. That will start the countdown to the signing of a peace agreement between the Taliban and the United States at the end of the month.\nThat peace agreement, to be signed in Doha, Qatar, on Feb. 29, will pave the way for a withdrawal of U.S. troops and intra- Afghan negotiations. U.S. Secretary of State Mike Pompeo said the peace agreement will also lead to an eventual permanent cease-fire.\n“We are preparing for the signing to take place on February 29,” Pompeo said in a statement. “Intra-Afghan negotiations will start soon thereafter, and will build on this fundamental step to deliver a comprehensive and permanent ceasefire and the future political road map for Afghanistan.”\nThe State Department official spoke on condition of anonymity to discuss the deal.\nBut the road ahead is fraught with difficulties.\nIt’s still not clear who will represent Kabul at the negotiation table for the intra-Afghan talks, considered a key pillar in finding a lasting peace in the war-torn country. The Afghan election commission earlier this week declared President Ashraf Ghani the winner of the presidential elections held in September but his rivals quickly denounced his win.\nThe Taliban have refused to talk to Ghani’s government and also denounced the election results, saying they will talk to government representatives but only as ordinary Afghans\nPompeo’s statement did not say who would participate in the intra-Afghan negotiations from Kabul, saying only that “’intra-Afghan negotiations will start soon” after the signing in Doha “and will build on this fundamental step to deliver a comprehensive and permanent cease-fire and the future political road map for Afghanistan.”\nThe Taliban issued their own statement on the reduction of violence deal.\n“Both parties will now create a suitable security situation in advance of agreement signing date, extend invitations to senior representatives of numerous countries and organizations to participate in the signing ceremony, make arrangements for the release of prisoners, structure a path for intra-Afghan negotiations with various political parties of the country and finally lay the groundwork for peace across the country with the withdrawal of all foreign forces,” the Taliban said in a statement Friday.\nThe Taliban added that they will not allow “the land of Afghanistan to be used against security of others so that our people can live a peaceful and prosperous life under the shade of an Islamic system.”\n___\nLee reported from Washington."}}