{"1":{"tilte":"\n\t\t\tRachel Garcia, in limelight with Team USA, faces former UCLA teammates Sunday\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/rachel-garcia-in-limelight-with-team-usa-faces-former-ucla-teammates-sunday\/","discription":"\n \nUCLA pitcher Rachel Garcia is named the 2019 LA Sports Awards Sportswoman of the Year by the Los Angeles Sports Council during the L.A. Sports Awards at the Beverly Hilton in Beverly Hills on Thursday, February 20, 2020. (Photo by Keith Birmingham, Pasadena Star-News\/SCNG)\n \n\t\t\t\t\t\t\n \nUCLA pitcher Rachel Garcia is named the 2019 LA Sports Awards Sportswoman of the Year by the Los Angeles Sports Council during the L.A. Sports Awards at the Beverly Hilton in Beverly Hills on Thursday, February 20, 2020. (Photo by Keith Birmingham, Pasadena Star-News\/SCNG)\n \n \nUCLA softball coach Lisa Fernandez, left, with UCLA pitcher Rachel Garcia as she is named the 2019 LA Sports Awards Sportswoman of the Year by the Los Angeles Sports Council during the L.A. Sports Awards at the Beverly Hilton in Beverly Hills on Thursday, February 20, 2020. (Photo by Keith Birmingham, Pasadena Star-News\/SCNG)\n \n \nUCLA softball coach Lisa Fernandez, left, with UCLA pitcher Rachel Garcia as she is named the 2019 LA Sports Awards Sportswoman of the Year by the Los Angeles Sports Council during the L.A. Sports Awards at the Beverly Hilton in Beverly Hills on Thursday, February 20, 2020. (Photo by Keith Birmingham, Pasadena Star-News\/SCNG)\n \n \nUCLA softball coach Lisa Fernandez, left, with UCLA pitcher Rachel Garcia as she is named the 2019 LA Sports Awards Sportswoman of the Year by the Los Angeles Sports Council during the L.A. Sports Awards at the Beverly Hilton in Beverly Hills on Thursday, February 20, 2020. (Photo by Keith Birmingham, Pasadena Star-News\/SCNG)\n \n \nUCLA pitcher Rachel Garcia wearing her national championship ring as she is named the 2019 LA Sports Awards Sportswoman of the Year by the Los Angeles Sports Council during the L.A. Sports Awards at the Beverly Hilton in Beverly Hills on Thursday, February 20, 2020. (Photo by Keith Birmingham, Pasadena Star-News\/SCNG)\n \n \nUCLA pitcher Rachel Garcia, right, is named the 2019 LA Sports Awards Sportswoman of the Year by the Los Angeles Sports Council during the L.A. Sports Awards at the Beverly Hilton in Beverly Hills on Thursday, February 20, 2020. (Photo by Keith Birmingham, Pasadena Star-News\/SCNG)\n \n \nUCLA softball coach Lisa Fernandez, left, stands with UCLA pitcher Rachel Garcia as she is named the 2019 LA Sports Awards Sportswoman of the Year by the Los Angeles Sports Council during the L.A. Sports Awards at the Beverly Hilton in Beverly Hills on Thursday, February 20, 2020. (Photo by Keith Birmingham, Pasadena Star-News\/SCNG)\n \n \nUCLA’s Rachel Garcia pitches against Oklahoma during the first inning of Game 2 of the best-of-three championship series at the Women’s College World Series on Tuesday in Oklahoma City. Garcia was named the tournament MVP after leading the Bruins to their first national title since 2010. (AP Photo\/Alonzo Adams)\n \n \nBEVERLY HILLS >> In a backstage in a dressing room at the Beverly Hilton Hotel, an hour before the annual L.A. Sports Awards, Rachel Garcia was surrounded by family and friends. She wore a black dress with see-through sleeves and nude-colored heels — an outfit she had a friend approve of in advance. \n\nA makeup artist asked her to pull up the end of her dress a couple inches and began rubbing tinted lotion on her leg to prepare her for being on camera. Garcia looked confused. \n\n“You don’t do this often, do you?” \n\nThrough all the accolades, including Collegiate Woman Athlete of the Year and most recently receiving the 2019 LA Sportswoman of the Year award by the Los Angeles Sports Council on Thursday, and all the media appearances over the past eight months, Garcia is still not used to all this. \n“I’m not gonna lie, this whole thing is not really my style,” Garcia said. “Dressing up is very hard for me.” \n\nIt’s been a non-stop rollercoaster ride of emotional experiences for the UCLA softball pitcher. After leading the Bruins to the program’s 13th national championship in June, Garcia’s childhood dreams came true in October when she made the U.S. Olympic team for this summer’s 2020 Olympics in Tokyo. \n\nWhile the Palmdale native is learning what it takes to compete on the biggest stage, she understands this opportunity will forever impact the sport’s future, especially with the next stop on the ride being a collision of her two softball worlds in a Sunday exhibition game between Team USA and UCLA at \n“I feel like it’s never ending,” she said. “I feel a little overwhelmed not gonna lie. It’s a lot of stuff coming at me at once. I’m just super honored and humbled with what softball has provided me, just to be here to represent softball means the world to me right now.” \n\nSunday’s game is just one stop on Team USA’s 66-game, 35-city ‘Stand Beside Her’ tour in which the U.S. will play various collegiate, professional and top club teams in preparation for the Olympics. Six Pac-12 schools, including UCLA and Arizona (which Team USA beat 5-4 on Feb. 18), will get the chance to face off against the Red, White and Blue. \nWhile the cross-country traveling and lack of school work — Garcia is redshirting this season with UCLA for a final year of collegiate eligibility in 2021 — are big perks of playing on the national team, Garcia said she’s had to get used to being more self-disciplined in the training room. \n\n“It’s a grind and you have to be motivated internally,” she said. “It’s the mentality of when you don’t have someone telling you what to do, you have to be prepared. Like in the weight room, you step into the weight room and you don’t have a coach telling you what to do. [You have to] be prepared, come up with your own workouts.” \n\nThis summer marks the return of softball to the Olympics after being cut following the 2008 summer games in Beijing. The opportunity to be a part of the sport’s Olympic revival is something Garcia doesn’t take lightly as she knows it’s creating something powerful for future generations. \n\n“When it got taken out, it was devastating,” Garcia said. “It felt like it crushed a lot of little girls’ hearts just like mine. But now that we have this opportunity, I’m just super honored and humbled to be a part of this 2020 journey and just be among some of the best female athletes in this sport and to be that inspiration for the next group of girls.” \n\nGarcia is looking forward to facing the Bruins come Sunday. Through all the crazy madness that has been her life as of late, it’s the support of her teammates and UCLA coaches that has meant the most to her. \n\n“They have my back just as I have theirs,” she said. “Being able to hear from them that they are excited for me to be a part of this, to expand the sport of softball, that was probably the best moment.” \n\n\n\nSunday, 11:30 a.m. \n\n Big League Dreams Sports Park in Cathedral City, Calif. in the Mary Nutter Collegiate Classic \n\n Flosoftball \n  \n\t\t\t"},"2":{"tilte":"\n\t\t\tWhicker: Will the last cut be the deepest for Fury against Wilder?\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/whicker-will-the-last-cut-be-the-deepest-for-fury-against-wilder\/","discription":"\nLAS VEGAS >> Tyson Fury got through 12 rounds against Deontay Wilder with skin and smile unbroken. \n\nHe couldn’t get through three rounds against Otto Wallin without a cut that bled badly enough for sandbags. \n\t\t\t\t\t\t\nThere were two cuts, actually, one over the right eye and one inside the eyelid. They needed 47 stitches and plastic surgery and on Saturday night they serve as a big “Hit One Here” sign, like the ones that used to be on baseball scoreboards, for Wilder in the WBC heavyweight champion rematch. \n\nA break in the levee could quickly dampen this occasion, which has whipped up a hype-storm worthy of  Floyd Mayweather days. It is a straight-up even fight between two undefeated heavyweights who already have given us one shining moment, over 14 months ago, at Staples Center. \nFury and Wilder carried true malice into that fight, probably because Wilder did not take Fury seriously, probably because Fury was literally coming down from 400 pounds of body weight and maybe 800 pounds of depression and addiction. Fury then won more rounds than Wilder but had to accept a draw. \n\nNow it’s theatre. Fury and Wilder yell at each other like Willy Loman’s sons. Fortunately, nobody on this stage yells, “Cut!” \n\n“I was gone from the ring for three years and you still couldn’t knock me out,” Fury told Wilder at close range on Wednesday, before they pushed each other and were separated. Both were play-acting but the promoters are taking no chances. There was no staredown at Friday’s weigh-in. \n\nFury has taken to calling Wilder “a big dosser,”  which is British slang for “bag lady.” His marketing touch has even produced a sport coat with “You Big Dosser” in vertical rows. \n\nThat might not become a fashion staple. But Fury is firing all guns at once this weekend. He knows his career changes dramatically no matter the outcome. \nHe is not pretending that the cut didn’t exist or won’t matter. Perhaps that is why Fury keeps bringing up a second-round knockout. He knows scar tissue does not have a long shelf life against Wilder \n\n“He can try to back me up,” Wilder said. “But can he do it, and if he does do it, how long can he continue? I don’t get credit for a lot of things. But one thing is for sure. I’m a great fighter going on my back feet. That’s when I can time you and set you up and run you into my own traps.” \n\nWallin, 29, was 20-0 before Fury. For a second, he thought 21-0 was in the bag. But referee Tony Weeks and the ring doctors kept running Fury out there, and the Gypsy King won a unanimous decision (four, five and six points on the judges’ cards). Through the blood, Fury dubbed Wallin, from Sweden, “the Viking warrior.” \n\n“If you’ll watch the tape, I hit him, I saw the cut, and then I looked at my corner and said, ‘Yeah!’’’ Wallin said, pumping his fist. \n\n“It was a bad cut. In my mind the fight should have been stopped. But Fury is a warrior and he kept coming. There’s no way he was going to quit.” \n\nNo, especially not with Wilder and a treasure chest over the next hill. There are disinterested parties who think the doctors would have retired Fury in a normal situation. \n\n“He (Fury) will have the cut on his mind,” Wallin said. “He also knows he got knocked down in the first fight. But I do think it would be a mistake for Wilder to target that cut. Fury has a lot of head movement and he’s a good counterpuncher. What Wilder probably should do is go to the body. And then they will adapt.” \n\nBut “they” is different in this fight. Ben Davison was a Trainer of the Year candidate for the way he reshaped Fury the first time. Davison is gone. Fury said he wanted a more aggressive game plan but it didn’t help when Davison’s corner had trouble coagulating. \n\nThe new trainer is SugarHill Steward, the nephew of the legendary trainer Emanuel. Actually his name was Javan “Sugar” Hill but he changed it because he said Emanuel was more of a father figure. \n\nWilder interprets all this as a seed of turmoil. \n\n“You see a lot of nervous energy in his camp,” Wilder said. “He has a lot of things going on. He’s changing up so many things. You already know the saying. If it’s not broken, why fix it?” \n\n“I think Fury has more tools to work with,” Wallin said. “He’s a more versatile fighter. Wilder was impressive when he used to throw that jab, especially against Bermane Stiverne. But he hasn’t done it much lately. So let’s see what happens.” \n\nMore to the point, let’s see what Fury can see. \n  \n\t\t\t"},"3":{"tilte":"\n\t\t\tUCLA men face Colorado for potential tiebreaker in Pac-12 standings\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/ucla-men-face-colorado-for-potential-tiebreaker-in-pac-12-standings\/","discription":"\nThe Bruins have finally become the defensive team Coach Mick Cronin has been striving to turn them into all season. And it’s showing. \n\nAt Utah on Thursday, UCLA prevented the Utes from making a 3-pointer until halfway through the second half, and Utah ended the game 3 for 12 from beyond the arc for its second-worst performance from distance during Pac-12 play this season. \n\t\t\t\t\t\t\n“Defensively, we couldn’t have played much better,” Cronin told reporters following \nUCLA is riding high, having won four in a row and eight of its last 10. In those eight wins, the Bruins have held opponents to an average of 59.1 points per game, improving their record to 15-0 when holding opposing teams to 73 points or fewer. \n“We haven’t changed anything,” sophomore guard David Singleton said at Thursday’s post-game press conference. “We’re just doing it better. We got used to Cronin’s style. To be honest, we started playing harder. We’re putting in more effort on defense, every game.” \n\nWith its final out-of-state away game on Saturday afternoon at No. 18 Colorado, the Bruins (16-11, 9-5 Pac-12) are looking for their longest win streak of the season. \n\nA win over the Buffaloes would not only be UCLA’s first in Boulder since 2017, but securing the season sweep over Colorado would also give the Bruins the tiebreaker if the teams were to finish conference play with the same record. UCLA is tied with Oregon for fourth in the conference standings but sit just one game behind first-place Colorado (21-6, 10-4) with Arizona and Arizona State tied for second at 9-4 in Pac-12 play. The top four teams in the final standings get byes into the quarterfinals of next month’s Pac-12 Tournament in Las Vegas. \n\nSince its previous loss to UCLA, Colorado has won five of its last six games with its only loss coming against then-No. 17 Oregon 68-60 in Eugene. \n\nThe Buffaloes are led by junior guards McKinley Wright (13.6 ppg) and Tyler Bey (13.5 ppg). Bey also leads the team and is tied atop the Pac-12 with 9.3 rebounds per game. \nThe Bruins upset then-No. 20 Colorado 72-68 on Jan. 30 at Pauley Pavilion. Junior guard Chris Smith had a career-high 30 points in the program’s first win against a ranked team since Feb. 8, 2018. UCLA had a season-low eight assists but shot a season-best 86.2 from the free-throw line. \n\n Saturday, 1 p.m. \n\n Boulder, Colo. \n\n CBS\/Ch. 2, 1150 AM \n  \n\t\t\t"},"4":{"tilte":"\n\t\t\tLife for a lefty specialist like Dodgers’ Adam Kolarek could be changing this year\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/life-for-a-lefty-specialist-like-adam-kolarek-could-be-changing-this-year\/","discription":"\nGLENDALE, Ariz. — When they came for the LOOGYs this winter, Adam Kolarek didn’t worry about it. He’s never seen himself that way. \n\n“When it was brought up last year, I kind of knew it was something that was going to be happening. Even in Triple-A, I figured it was going to happen. I just assumed it was already passed,” Kolarek said of the recently-ratified rule change which will require relief pitchers entering the game to face a minimum of three batters or complete an inning. \n\t\t\t\t\t\t\n“I think the main thing I’ve been telling people is until I came to L.A., I never thought of myself as a one-hitter guy. I was never used that way.” \n\nHe was used that way by the Dodgers after being acquired from the Tampa Bay Rays in a midseason trade. Kolarek faced just one batter in 16 of his 26 appearances with the Dodgers in 2019 and two or fewer in 20 of the 26. In the postseason, he made three appearances against the Washington Nationals, faced left-handed Juan Soto each time and struck him out twice. \nLife as a LOOGY – the baseball acronym for Left-handed One-Out Guy – had its good points for Kolarek. \n\n“I enjoyed being available every night,” he said. “I knew looking at the lineup every night who I needed to prepare for mentally. \n\n“I think it’s going to be an adjustment for everybody.” \n\nIn his career, Kolarek has held left-handed hitters to a .199 average with just 10 extra-base hits and only two home runs in 181 plate appearances. Despite his funky, sidearm delivery, right-handed hitters have been a lot more successful – a .299 average and .849 OPS. But Kolarek believes he has the weapons to get them out as well. \n\n“The main thing is I’ve always been a ground ball pitcher so I have to attack from the get-go,” he said. “Maybe the batting average against righties is a little higher than it is against lefties. But as long as I’m keeping it on the ground eventually that ball is going to be at somebody.” \nDodgers manager Dave Roberts said the new rule has the Dodgers looking at ways to sequence pitches from a “lefty killer” like Kolarek – and a “righty” killer like Dylan Floro – to make them more effective against the opposite-handed batter. \n\n“Adam has been a lefty killer throughout his entire career. Now with the rule change, the challenge for him is to be able to feel confident in getting out a right-handed hitter,” Roberts said. “Now it’s kind of, ‘How do I attack right-handed hitters?’ \n\n“We’re going to give him every opportunity to face right-hand hitters to kind of see how that plays out, but I have every confidence that Adam will figure some things out and be effective against the right-handed hitter.” \n\nHe wasn’t scheduled to throw a bullpen session on Friday. But Dodgers closer Kenley Jansen spent a good deal of time during the workout surrounded by instructors Rick Honeycutt, Joel Peralta and Orel Hershiser, throwing off a mound. \n\n“It happened you guys were there instead of watching David Price throw live BP,” Jansen teased with reporters afterward. “If you guys were watching David Price throw live BP, you probably wouldn’t know I was there.” \n\nJansen’s work was focused on his slider. He said he tried three different grips during the session, finally finding a comfort level with one suggested by Hershiser and Honeycutt. \n\n“This is the perfect time to work on it,” Jansen said. “Why not take advantage of having those guys around?” \n\nRoberts said he has talked with Mookie Betts about where the new Dodger feels most comfortable batting in the lineup and Betts is expected to be the primary leadoff hitter this year. He could slip down to No.­ 2 against right-handed pitching, allowing Joc Pederson to bat leadoff. With the new three-batter minimum rule in place this year, opposing teams will have to think long and hard about bringing in a lefty specialist to face Pederson if it means leaving the lefty in to then face Betts and possibly Justin Turner. \n\n“Mookie has talked to me about wanting to hit at the top,” Roberts said. “That’s where he feels comfortable and that’s where we’re at right now.” \n\nBetts batted first or second in all of his 148 starts for the Red Sox last season and has highest OPS (.910) as a leadoff hitter in his career. \n  \n\t\t\t"},"5":{"tilte":"\n\t\t\tSierra Canyon basketball defeats Etiwanda to reach third straight Open Division final\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/sierra-canyon-basketball-headed-to-third-straight-open-division-final-after-defeating-etiwanda\/","discription":"\nSupport our high school sports coverage by becoming a digital subscriber. \n When Sierra Canyon and Etiwanda faced each other on Dec. 28 in the Classic at Damien, it was anticipated to be a potential Open Division matchup. Almost two months later, that’s exactly what it was, and it certainly delivered. \n\t\t\t\t\t\t\nSierra Canyon defeated Etiwanda 73-62 in front of a sold-out crowd at Calabasas High to advance to the CIF Southern Section Open Division final for the third consecutive season. \n\nIt will be the second time in three years the Trailblazers will face Mater Dei in the championship game. It will be played at Long Beach State on Friday, Feb. 28 at 8:30 p.m. \nThe game had multiple lead changes, high-flying dunks and plenty of drama, including a delay in the third quarter because of a scuffle in the stands that poured onto the court. The delay wasn’t longer than 10 minutes, but Sierra Canyon took advantage of the stoppage by going on a 17-5 run when play continued, creating a 54-42 lead late in the third frame that Etiwanda (28-3) couldn’t come back from. \n\n \nSierra Canyon’s Ziaire Williams #1 shoots as Etiwanda’s Jaylen Clark #5 defends during their playoff game at Calabasas High in Calabasas, Friday, February 21, 2020.   (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n \n \nSierra Canyon’s Amari Bailey #10 lays the ball up as Etiwanda’s Jaylen Clark #5 defends during their playoff game at Calabasas High in Calabasas, Friday, February 21, 2020.   (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n \n \nSierra Canyon’s Shy Odom #13 and Etiwanda’s Jaylen Clark #5 go after a rebound during their playoff game at Calabasas High in Calabasas, Friday, February 21, 2020.   (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n \n \nSierra Canyon’s Terren Frank #15 battles for a rebound with Etiwanda’s Brantly Stevenson #4 and Jaylen Clark #5 during their playoff game at Calabasas High in Calabasas, Friday, February 21, 2020.   (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n \n \nSierra Canyon’s Harold Yu #11 grans a rebound away from Etiwanda’s Jaylen Clark #5 as Shy Odom #13 assists during their playoff game at Calabasas High in Calabasas, Friday, February 21, 2020.   (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n \n \nSierra Canyon’s Bronny James #0 looks to pass during their playoff game against Etiwanda at Calabasas High in Calabasas, Friday, February 21, 2020.   (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n \n \nSierra Canyon’s Shy Odom #13 dunks the ball as Etiwanda’s Jahmai Mashack #15 looks on during their playoff game at Calabasas High in Calabasas, Friday, February 21, 2020.   (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n \n \nEtiwanda’s Darvelle Wyatt #34 shoots as Sierra Canyon’s Shy Odom #13 and Harold Yu #11 defend during their playoff game at Calabasas High in Calabasas, Friday, February 21, 2020.   (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n \n \nSierra Canyon’s Shy Odom #13 dunks the ball as Etiwanda’s Brantly Stevenson #4 looks on during their playoff game at Calabasas High in Calabasas, Friday, February 21, 2020.   (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n \n \nEtiwanda’s Tyree Campbell #0 shoots as Sierra Canyon’s Shy Odom #13 and Brandon Boston, Jr. #3 defend during their playoff game at Calabasas High in Calabasas, Friday, February 21, 2020.   (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n \n \nSierra Canyon’s Amari Bailey #10 shoots as Etiwanda’s Darryl Jackson #3 defends during their playoff game at Calabasas High in Calabasas, Friday, February 21, 2020.   (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n \n \nSierra Canyon’s Ziaire Williams #1 shoots as Etiwanda’s Brantly Stevenson #4 and Jahmai Mashack #15 defend during their playoff game at Calabasas High in Calabasas, Friday, February 21, 2020.   (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n \n \nSierra Canyon’s Ziaire Williams #1 reacts during their playoff game against Etiwanda at Calabasas High in Calabasas, Friday, February 21, 2020.   (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n \n \nEtiwanda’s Jaylen Clark #5 shoots as Sierra Canyon’s Ziaire Williams #1 defends during their playoff game at Calabasas High in Calabasas, Friday, February 21, 2020.   (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n \n \nSierra Canyon’s Terren Frank #15 and Etiwanda’s Jaylen Clark #5 go after a loose ball during their playoff game at Calabasas High in Calabasas, Friday, February 21, 2020.   (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n \n \nEtiwanda’s Tyree Campbell #0 shoots as Sierra Canyon’s Ziaire Williams #1 and Terren Frank #15 defend during their playoff game at Calabasas High in Calabasas, Friday, February 21, 2020.   (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n \n \nEtiwanda’s Jaylen Clark #5 lays the ball up as Sierra Canyon’s Shy Odom #13 defends during their playoff game at Calabasas High in Calabasas, Friday, February 21, 2020.   (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n \n \nSierra Canyon’s Amari Bailey #10 pumps his fist as Ziaire Williams #1 hugs him after Bailey scored and was fouled during their playoff game at Calabasas High in Calabasas, Friday, February 21, 2020.   (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n \n \nSierra Canyon’s Amari Bailey #10 pumps his fist as Ziaire Williams #1 hugs him after Bailey scored and was fouled during their playoff game at Calabasas High in Calabasas, Friday, February 21, 2020.   (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n \n \n“The delay really stopped our momentum,” Etiwanda’s Jaylen Clark said. “That was tough.” \n\nEtiwanda cut Sierra Canyon’s lead to 55-49 in the fourth quarter, but a corner 3-pointer from Bronny James in front of the Sierra Canyon bench ballooned the lead back to nine. \n\n“That was a huge shot,” Sierra Canyon coach Andre Chevalier said. \n\nClark had 10 first-quarter points, including a corner 3-pointer that gave Etiwanda a 14-6 lead in front of its rambunctious traveling crowd. But Sierra Canyon used a 9-0 run to retake the lead behind transition baskets from Amari Bailey. \nAfter one tough finish, Bailey immediately began to chirp at the Etiwanda bench. A few possessions later Clark returned the favor with a tough finish of his own. \n\nClark, a transfer from Corona Centennial who didn’t play in December’s first meeting, scored a game-high 32 points. \n\n“This was a great game,” Clark said. “Sierra Canyon was a great team. We still have more basketball to play. I’ll put this one behind me and move on.” \n\nEtiwanda made four 3s in the first half that helped the Eagles to a 34-31 lead a halftime, but those made 3s was something Sierra Canyon knew Etiwanda wasn’t particularly great at. \n\n“When they made those shots early, we knew it wouldn’t last,” Sierra Canyon’s Ziaire Williams said. “But it was harder for us to get in transition when they’re making shots. In the second half, they started missing those same shots and we were able to get out in transition.” \n\nWilliams scored 23 points in the game, another high-level recruit who was unable to play in December’s victory over Etiwanda due to the transfer sit-out period. \n\nIt’s the biggest game he’s played in his high school career after transferring from Notre Dame Sherman Oaks – which never got further than the second round in his three years there. \n\n“The game was crazy, but I just prepare like any other game,” Williams said. \n\nIn the third quarter, only three Sierra Canyon players scored: Williams, Amari Bailey and BJ Boston. Boston totaled 19 and Bailey finished with 18. \n\n“Even when they were making shots, we stuck to the game plan,” Bailey said. \n"},"6":{"tilte":"\n\t\t\tLakers squander big lead before putting away Grizzlies in return from break\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/lakers-squander-big-lead-before-putting-away-grizzlies-in-return-from-break\/","discription":"\n \nLakers forward LeBron James, right, passes while under pressure from Grizzlies guard Dillon Brooks during the first half of Friday’s game at Staples Center. (AP Photo\/Mark J. Terrill)\n \n\t\t\t\t\t\t\n \nThe Lakers’ Avery Bradley dribbles in front of Grizzlies rookie Ja Morant during the first quarter of Friday’s game at Staples Center. (Photo by Harry How\/Getty Images)\n \n \nGrizzlies rookie guard Ja Morant, below, tries to pass the ball from under the legs of Lakers forward Anthony Davis during the first half of an NBA basketball game Friday, Feb. 21, 2020, in Los Angeles. (AP Photo\/Mark J. Terrill)\n \n \nLakers center Dwight Howard, left, fouls Memphis Grizzlies forward Jaren Jackson Jr. (13) in the act of shooting during the first half of an NBA basketball game Friday, Feb. 21, 2020, in Los Angeles. (AP Photo\/Mark J. Terrill)\n \n \nMemphis Grizzlies guard Dillon Brooks, left, shoots as Los Angeles Lakers center JaVale McGee defends during the first half of an NBA basketball game Friday, Feb. 21, 2020, in Los Angeles. (AP Photo\/Mark J. Terrill)\n \n \nAnthony Davis #3 of the Los Angeles Lakers reacts to an injury during the first quarter against the Memphis Grizzlies at Staples Center on February 21, 2020 in Los Angeles, California.  NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this photograph, User is consenting to the terms and conditions of the Getty Images License Agreement. (Photo by Harry How\/Getty Images)\n \n \nAnthony Davis #3 of the Los Angeles Lakers grimaces after an injury during the first quarter against the Memphis Grizzlies during Friday’s game at Staples Center. (Photo by Harry How\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21:  LeBron James #23 of the Los Angeles Lakers dunks in front of Dillon Brooks #24 of the Memphis Grizzlies during the first quarter at Staples Center on February 21, 2020 in Los Angeles, California.  NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this photograph, User is consenting to the terms and conditions of the Getty Images License Agreement. (Photo by Harry How\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21:  Dwight Howard #39 of the Los Angeles Lakers argues his foul call with referee David Guthrie #16  during the first quarter at Staples Center on February 21, 2020 in Los Angeles, California.  NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this photograph, User is consenting to the terms and conditions of the Getty Images License Agreement. (Photo by Harry How\/Getty Images)\n \n \nMemphis Grizzlies guard Dillon Brooks, left, shoots as Los Angeles Lakers center JaVale McGee defends during the first half of an NBA basketball game Friday, Feb. 21, 2020, in Los Angeles. (AP Photo\/Mark J. Terrill)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21:  JaVale McGee #7 of the Los Angeles Lakers reacts as he is fouled by Jaren Jackson Jr. #13 of the Memphis Grizzlies in front of Jonas Valanciunas #17 during the first quarter at Staples Center on February 21, 2020 in Los Angeles, California.  NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this photograph, User is consenting to the terms and conditions of the Getty Images License Agreement. (Photo by Harry How\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21:  Dillon Brooks #24 of the Memphis Grizzlies attempts a shot over Anthony Davis #3 of the Los Angeles Lakers during the first quarter at Staples Center on February 21, 2020 in Los Angeles, California.  NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this photograph, User is consenting to the terms and conditions of the Getty Images License Agreement. (Photo by Harry How\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21:  Danny Green #14 of the Los Angeles Lakers controls a ball in front of Kyle Anderson #1 of the Memphis Grizzlies and Avery Bradley #11 during the first quarter at Staples Center on February 21, 2020 in Los Angeles, California.  NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this photograph, User is consenting to the terms and conditions of the Getty Images License Agreement. (Photo by Harry How\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21: Alex Caruso #4 of the Los Angeles Lakers goes to the basket against De’Anthony Melton #0 of the Memphis Grizzlies during the second quarter at Staples Center on February 21, 2020 in Los Angeles, California. NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this Photograph, user is consenting to the terms and conditions of the Getty Images License Agreement. Mandatory Copyright Notice: Copyright 2020 NBAE (Photo by Katelyn Mulcahy\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21:  Jonas Valanciunas #17 of the Memphis Grizzlies and Danny Green #14 of the Los Angeles Lakers reach for the ball during the first quarter at Staples Center on February 21, 2020 in Los Angeles, California.  NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this photograph, User is consenting to the terms and conditions of the Getty Images License Agreement. (Photo by Harry How\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21:  Kyle Kuzma #0 of the Los Angeles Lakers scores past Jaren Jackson Jr. #13 of the Memphis Grizzlies during the first quarter at Staples Center on February 21, 2020 in Los Angeles, California.  NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this photograph, User is consenting to the terms and conditions of the Getty Images License Agreement. (Photo by Harry How\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21:  Ja Morant #12 of the Memphis Grizzlies tries to keep his dribble as he is chased by JaVale McGee #7 of the Los Angeles Lakers during the first quarter at Staples Center on February 21, 2020 in Los Angeles, California.  NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this photograph, User is consenting to the terms and conditions of the Getty Images License Agreement. (Photo by Harry How\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21:  LeBron James #23 of the Los Angeles Lakers dribble up court during the first quarter against the Memphis Grizzlies at Staples Center on February 21, 2020 in Los Angeles, California.  NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this photograph, User is consenting to the terms and conditions of the Getty Images License Agreement. (Photo by Harry How\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21: Danny Green #14 of the Los Angeles Lakers fights for the ball against Jonas Valanciunas #17 of the Memphis Grizzlies during the first quarter at Staples Center on February 21, 2020 in Los Angeles, California. NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this Photograph, user is consenting to the terms and conditions of the Getty Images License Agreement. Mandatory Copyright Notice: Copyright 2020 NBAE (Photo by Katelyn Mulcahy\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21:  Dwight Howard #39 of the Los Angeles Lakers reacts to the officials in front of Alex Caruso #4 during the first quarter at Staples Center on February 21, 2020 in Los Angeles, California.  NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this photograph, User is consenting to the terms and conditions of the Getty Images License Agreement. (Photo by Harry How\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21: Alex Caruso #4 of the Los Angeles Lakers dribbles against Tyus Jones #21 and Dillon Brooks #24 of the Memphis Grizzlies during the second quarter at Staples Center on February 21, 2020 in Los Angeles, California. NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this Photograph, user is consenting to the terms and conditions of the Getty Images License Agreement. Mandatory Copyright Notice: Copyright 2020 NBAE (Photo by Katelyn Mulcahy\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21: JaVale McGee #7 of the Los Angeles Lakers blocks a shot from Memphis Grizzlies Jonas Valanciunas #17 of the Memphis Grizzlies during the first quarter at Staples Center on February 21, 2020 in Los Angeles, California. NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this Photograph, user is consenting to the terms and conditions of the Getty Images License Agreement. Mandatory Copyright Notice: Copyright 2020 NBAE (Photo by Katelyn Mulcahy\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21: Anthony Davis #3 of the Los Angeles Lakers goes to the basket during the second quarter\nin a game against the Memphis Grizzlies at Staples Center on February 21, 2020 in Los Angeles, California. NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this Photograph, user is consenting to the terms and conditions of the Getty Images License Agreement. Mandatory Copyright Notice: Copyright 2020 NBAE (Photo by Katelyn Mulcahy\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21: Anthony Davis #3 of the Los Angeles Lakers goes to the basket during the second quarter\nin a game against the Memphis Grizzlies at Staples Center on February 21, 2020 in Los Angeles, California. NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this Photograph, user is consenting to the terms and conditions of the Getty Images License Agreement. Mandatory Copyright Notice: Copyright 2020 NBAE (Photo by Katelyn Mulcahy\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21:  Taylor Jenkins of the Memphis Grizzlies reacts to play during the first quarter against the Los Angeles Lakers at Staples Center on February 21, 2020 in Los Angeles, California.  NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this photograph, User is consenting to the terms and conditions of the Getty Images License Agreement. (Photo by Harry How\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21: Ja Morant #12 of the Memphis Grizzlies fights for the ball against Alex Caruso #4 of the Los Angeles Lakers during the second quarter at Staples Center on February 21, 2020 in Los Angeles, California. NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this Photograph, user is consenting to the terms and conditions of the Getty Images License Agreement. Mandatory Copyright Notice: Copyright 2020 NBAE (Photo by Katelyn Mulcahy\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21: LeBron James #23 of the Los Angeles Lakers handles the ball during the second quarter at Staples Center on February 21, 2020 in Los Angeles, California. NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this Photograph, user is consenting to the terms and conditions of the Getty Images License Agreement. Mandatory Copyright Notice: Copyright 2020 NBAE (Photo by Katelyn Mulcahy\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21: Brandon Clarke #15 of the Memphis Grizzlies blocks a shot from Alex Caruso #4 of the Los Angeles Lakers during the second quarter at Staples Center on February 21, 2020 in Los Angeles, California. NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this Photograph, user is consenting to the terms and conditions of the Getty Images License Agreement. Mandatory Copyright Notice: Copyright 2020 NBAE (Photo by Katelyn Mulcahy\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21: LeBron James #23 of the Los Angeles Lakers shoots the ball during the second quarter in a game against the Memphis Grizzlies at Staples Center on February 21, 2020 in Los Angeles, California. NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this Photograph, user is consenting to the terms and conditions of the Getty Images License Agreement. Mandatory Copyright Notice: Copyright 2020 NBAE (Photo by Katelyn Mulcahy\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21: Kentavious Caldwell-Pope #1 of the Los Angeles Lakers shoots the ball during the second quarter in a game against the Memphis Grizzlies at Staples Center on February 21, 2020 in Los Angeles, California. NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this Photograph, user is consenting to the terms and conditions of the Getty Images License Agreement. Mandatory Copyright Notice: Copyright 2020 NBAE (Photo by Katelyn Mulcahy\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21:  Kentavious Caldwell-Pope #1 and Rajon Rondo #9 of the Los Angeles Lakers argue a foul with referee Nick Buchert #3 during the third quarter against the Memphis Grizzlies at Staples Center on February 21, 2020 in Los Angeles, California.  NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this photograph, User is consenting to the terms and conditions of the Getty Images License Agreement. (Photo by Harry How\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21:  Frank Vogel of the Los Angeles Lakers watches play against the Memphis Grizzlies during the third quarter at Staples Center on February 21, 2020 in Los Angeles, California.  NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this photograph, User is consenting to the terms and conditions of the Getty Images License Agreement. (Photo by Harry How\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21:  Anthony Davis #3 and Rajon Rondo #9 of the Los Angeles Lakers discuss play against the Memphis Grizzlies during the third quarter at Staples Center on February 21, 2020 in Los Angeles, California.  NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this photograph, User is consenting to the terms and conditions of the Getty Images License Agreement. (Photo by Harry How\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21:  Anthony Davis #3 and Rajon Rondo #9 of the Los Angeles Lakers celebrate a Davis blocked shot against the Memphis Grizzlies at Staples Center on February 21, 2020 in Los Angeles, California.  NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this photograph, User is consenting to the terms and conditions of the Getty Images License Agreement. (Photo by Harry How\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21:  Kyle Kuzma #0 of the Los Angeles Lakers celebrates his fast break layup during the third quarter against the Memphis Grizzlies at Staples Center on February 21, 2020 in Los Angeles, California.  NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this photograph, User is consenting to the terms and conditions of the Getty Images License Agreement. (Photo by Harry How\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21:  Anthony Davis #3 of the Los Angeles Lakers blocks De’Anthony Melton #0 of the Memphis Grizzlies as Kyle Kuzma #0 looks on during the third quarter at Staples Center on February 21, 2020 in Los Angeles, California.  NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this photograph, User is consenting to the terms and conditions of the Getty Images License Agreement. (Photo by Harry How\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21:  Ja Morant #12 of the Memphis Grizzlies drives to the basket on Rajon Rondo #9 of the Los Angeles Lakers during the third quarter at Staples Center on February 21, 2020 in Los Angeles, California.  NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this photograph, User is consenting to the terms and conditions of the Getty Images License Agreement. (Photo by Harry How\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21:  Jonas Valanciunas #17 of the Memphis Grizzlies looks up to shoot on Dwight Howard #39 of the Los Angeles Lakers during the third quarter at Staples Center on February 21, 2020 in Los Angeles, California.  NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this photograph, User is consenting to the terms and conditions of the Getty Images License Agreement. (Photo by Harry How\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21: JaVale McGee #7 of the Los Angeles Lakers reacts after a foul call during the fourth quarter in a game against the Memphis Grizzlies at Staples Center on February 21, 2020 in Los Angeles, California. The Lakers won 117-105. NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this Photograph, user is consenting to the terms and conditions of the Getty Images License Agreement. (Photo by Katelyn Mulcahy\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21:  Anthony Davis #3 of the Los Angeles Lakers gets help up from LeBron James #23, Danny Green #14 and Avery Bradley #11 during the third quarter against the Memphis Grizzlies at Staples Center on February 21, 2020 in Los Angeles, California.  NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this photograph, User is consenting to the terms and conditions of the Getty Images License Agreement. (Photo by Harry How\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21:  Anthony Davis #3 of the Los Angeles Lakers is guarded by Jonas Valanciunas #17 of the Memphis Grizzlies during the third quarter at Staples Center on February 21, 2020 in Los Angeles, California.  NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this photograph, User is consenting to the terms and conditions of the Getty Images License Agreement. (Photo by Harry How\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21: JaVale McGee #7 of the Los Angeles Lakers reacts during the fourth quarter in a game against the Memphis Grizzlies at Staples Center on February 21, 2020 in Los Angeles, California. The Lakers won 117-105. NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this Photograph, user is consenting to the terms and conditions of the Getty Images License Agreement. (Photo by Katelyn Mulcahy\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21:  Ja Morant #12 of the Memphis Grizzlies drives to the basket past Avery Bradley #11 of the Los Angeles Lakers during the third quarter at Staples Center on February 21, 2020 in Los Angeles, California.  NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this photograph, User is consenting to the terms and conditions of the Getty Images License Agreement. (Photo by Harry How\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21:  LeBron James #23 of the Los Angeles Lakers posts up Ja Morant #12 of the Memphis Grizzlies during the third quarter at Staples Center on February 21, 2020 in Los Angeles, California.  NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this photograph, User is consenting to the terms and conditions of the Getty Images License Agreement. (Photo by Harry How\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21:  Anthony Davis #3 of the Los Angeles Lakers post up Gorgui Dieng #14 of the Memphis Grizzlies during the third quarter at Staples Center on February 21, 2020 in Los Angeles, California.  NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this photograph, User is consenting to the terms and conditions of the Getty Images License Agreement. (Photo by Harry How\/Getty Images)\n \n \nLos Angeles Lakers forward LeBron James passes the ball during the second half of the team’s NBA basketball game against the Memphis Grizzlies on Friday, Feb. 21, 2020, in Los Angeles. The Lakers won 117-105. (AP Photo\/Mark J. Terrill)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21:  Kyle Kuzma #0 of the Los Angeles Lakers dribble past Brandon Clarke #15 of the Memphis Grizzlies at Staples Center on February 21, 2020 in Los Angeles, California.  NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this photograph, User is consenting to the terms and conditions of the Getty Images License Agreement. (Photo by Harry How\/Getty Images)\n \n \nMemphis Grizzlies guard Ja Morant, left, shoots as Los Angeles Lakers guard Kentavious Caldwell-Pope defends during the first half of an NBA basketball game Friday, Feb. 21, 2020, in Los Angeles. (AP Photo\/Mark J. Terrill)\n \n \nLos Angeles Lakers forward LeBron James dunks during the first half of an NBA basketball game against the Memphis Grizzlies Friday, Feb. 21, 2020, in Los Angeles. (AP Photo\/Mark J. Terrill)\n \n \nLos Angeles Lakers forward LeBron James, right, shoots as Memphis Grizzlies forward Jaren Jackson Jr. defends during the first half of an NBA basketball game Friday, Feb. 21, 2020, in Los Angeles. (AP Photo\/Mark J. Terrill)\n \n \nMemphis Grizzlies guard Tyus Jones, left, takes the ball after Los Angeles Lakers guard Kentavious Caldwell-Pope loses control of it during the first half of an NBA basketball game Friday, Feb. 21, 2020, in Los Angeles. (AP Photo\/Mark J. Terrill)\n \n \nLos Angeles Lakers forward Kyle Kuzma, left shoots as Memphis Grizzlies guard Ja Morant, second from right, and forward Kyle Anderson defend during the first half of an NBA basketball game Friday, Feb. 21, 2020, in Los Angeles. (AP Photo\/Mark J. Terrill)\n \n \nLos Angeles Lakers forward Kyle Kuzma gestures after scoring during the first half of an NBA basketball game against the Memphis Grizzlies on Friday, Feb. 21, 2020, in Los Angeles. (AP Photo\/Mark J. Terrill)\n \n \nLos Angeles Lakers forward Anthony Davis, right, hits Memphis Grizzlies guard De’Anthony Melton after blocking his shot during the second half of an NBA basketball game Friday, Feb. 21, 2020, in Los Angeles. The Lakers won 117-105. (AP Photo\/Mark J. Terrill)\n \n \nMemphis Grizzlies guard Ja Morant, right, shoots as Los Angeles Lakers forward Anthony Davis defends during the second half of an NBA basketball game Friday, Feb. 21, 2020, in Los Angeles. The Lakers won 117-105. (AP Photo\/Mark J. Terrill)\n \n \nLos Angeles Lakers guard Kentavious Caldwell-Pope, left, shoots as Memphis Grizzlies center Gorgui Dieng defends during the second half of an NBA basketball game Friday, Feb. 21, 2020, in Los Angeles. The Lakers won 117-105. (AP Photo\/Mark J. Terrill)\n \n \nLos Angeles Lakers forward Anthony Davis drives toward the basket during the second half of the team’s NBA basketball game against the Memphis Grizzlies on Friday, Feb. 21, 2020, in Los Angeles. The Lakers won 117-105. (AP Photo\/Mark J. Terrill)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21: Anthony Davis #3 of the Los Angeles Lakers looks on during the fourth quarter in a game against the Memphis Grizzlies at Staples Center on February 21, 2020 in Los Angeles, California. The Lakers won 117-105. NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this Photograph, user is consenting to the terms and conditions of the Getty Images License Agreement. (Photo by Katelyn Mulcahy\/Getty Images)\n \n \nLos Angeles Lakers guard Kentavious Caldwell-Pope, right, yells before receiving a technical foul during the second half of an NBA basketball game against the Memphis Grizzlies on Friday, Feb. 21, 2020, in Los Angeles. The Lakers won 117-105. (AP Photo\/Mark J. Terrill)\n \n \nLos Angeles Lakers center Dwight Howard, left, blocks the shot of Memphis Grizzlies guard Ja Morant, center, as guard De’Anthony Melton watches during the second half of an NBA basketball game Friday, Feb. 21, 2020, in Los Angeles. The Lakers won 117-105. (AP Photo\/Mark J. Terrill)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21: LeBron James #23 of the Los Angeles Lakers grabs a rebound during the fourth quarter in a game against the Memphis Grizzlies at Staples Center on February 21, 2020 in Los Angeles, California. NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this Photograph, user is consenting to the terms and conditions of the Getty Images License Agreement. (Photo by Katelyn Mulcahy\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21: LeBron James #23 of the Los Angeles Lakers talks with referee David Guthrie #16 during the fourth quarter in a game against the Memphis Grizzlies at Staples Center on February 21, 2020 in Los Angeles, California. The Lakers won 117-105. NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this Photograph, user is consenting to the terms and conditions of the Getty Images License Agreement. (Photo by Katelyn Mulcahy\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21: Frank Vogel of the Los Angeles Lakers reacts to getting a technical during the fourth quarter in a game against the Memphis Grizzlies at Staples Center on February 21, 2020 in Los Angeles, California. NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this Photograph, user is consenting to the terms and conditions of the Getty Images License Agreement. (Photo by Katelyn Mulcahy\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21: Anthony Davis #3 of the Los Angeles Lakers reacts during the fourth quarter in a game against the Memphis Grizzlies at Staples Center on February 21, 2020 in Los Angeles, California. The Lakers won 117-105. NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this Photograph, user is consenting to the terms and conditions of the Getty Images License Agreement. (Photo by Katelyn Mulcahy\/Getty Images)\n \n \nLOS ANGELES, CALIFORNIA – FEBRUARY 21: Anthony Davis #3 and Alex Caruso #4 of the Los Angeles Lakers react during the fourth quarter in a game against the Memphis Grizzlies at Staples Center on February 21, 2020 in Los Angeles, California. NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this Photograph, user is consenting to the terms and conditions of the Getty Images License Agreement. (Photo by Katelyn Mulcahy\/Getty Images)\n \n \nLOS ANGELES — If the season ended today, the Lakers and Grizzlies would be pitted in a first-round playoff series. The Lakers’ 3-0 season record against their challenger doesn’t inspire much hope for a competitive affair if it comes to fruition in April. \n\nBut Friday night’s game, a 117-105 Lakers win at Staples Center, provided a snapshot of what Memphis (28-28) might offer in that potential 1-vs.-8 matchup – not experience, but energy. And the Lakers (42-12), who seemed perhaps a little too cool back from their All-Star break, need to bring some in return. \n\nThe Lakers were up by 25 early in the third quarter, on their way to an apparent blowout, but the Grizzlies whittled that to as few as four points in a tighter-than-hoped fourth. It forced LeBron James (32 points, 10 for 11 from the free-throw line) and Anthony Davis (28 points) to play deep into a game when they might have otherwise been able to watch from the bench and forced the Lakers to find the gear they were on before their time off last week. \n\nTo say the result was in doubt might be an overstatement – but it wasn’t completely assured until James scored back-to-back baskets within the final two minutes: a tough layup in traffic and a turnaround baseline jumper. On the next possession, Davis made a 3-pointer and held his hands high on the follow-through while exhaling with relief. \nThe Lakers are likely to need tougher resolve as soon as Sunday, with an afternoon game scheduled against the Boston Celtics (39-16) who stomped them back in January. \n\n“The worst loss of the season for us, we didn’t play our best at all,” Davis said. “So we remember that for sure. We feel like we owe them.” \n\nJames and Davis, who had the least time off because of their All-Star weekend obligations, looked the most like themselves. James was the main force in gathering up the early lead, including a memorable first-quarter dunk off a Danny Green lob. \n\nDavis might have made his biggest impact on defense, where he racked up seven blocked shots, frustrating Grizzlies drivers for much of the night. He also worked the glass for 13 rebounds on a night when the Lakers’ traditional centers struggled to make an impact with foul trouble. He scored 24 of his 28 points, grabbed 11 of his 13 rebounds and blocked five of his seven shots in the second half. \n\nIt drummed up more talk from the Lakers that Davis should be the front-runner for Defensive Player of the Year, which Davis acknowledged is part of his motivation – but not all. \n“I would love to have that award several times before I retire – which is not soon,” he quipped. “But I think just trying to set a standard for one myself and two, my team on the defensive end and the rest of the guys will follow and I’m just trying to help guys on their beat.” \n\nThe Grizzlies’ effort came on a night when the Lakers effectively corralled their rookie star Ja Morant, holding the springy dunker to 17 points (5-for-14 shooting) and three assists. The franchise’s other young pillar, Jaren Jackson Jr., left the game with left knee soreness after just 16 minutes of play. \n\nBut the Lakers’ own attack looked unsteady against Memphis’ determined defense: They shot only 3 for 11 from 3-point range after halftime. The exceptions were Avery Bradley (14 points) and Kentavious Caldwell-Pope (12 points). Alex Caruso gave the Lakers a two-way boost in the closing lineup, adding nine points including a putback dunk of a missed free throw over a helpless Kyle Anderson. \n\nA recent rotation change has Caruso (nine points) playing more minutes late in the second and fourth quarters in the Lakers’ closing group. Statistics indicate that he’s one of James’ best partners. \n\n“There’s the eye test, but LeBron and Alex is one of our best combinations throughout the season from a net rating standpoint,” Coach Frank Vogel said. “We’ll continue to explore ways that that’s getting out there enough without overdoing it. The last two games he’s just been playing out of his mind.” \n\nThe Lakers had a brief scare in the first quarter, when Davis took a knee in the back of his right calf from one of the Memphis players. He subbed out of the game in the first minute, then headed to the locker room after the first timeout. \n\nIt wasn’t until the 8:48 mark of the second quarter that Davis strode back onto the bench, then quickly checked back in. He ended up playing 31 minutes. \n\nDavis said he felt pain in the calf when he was sitting, but as he played, he got warmer and felt better. \n\n“If guys can’t go, it’s next-man-up mentality, and I think we did that tonight when I went out,” he said. “But we don’t, if guys feel like they’re able to play, then, by all means, we’re going to be on the floor. We’re trying to set a culture, set a standard for ourselves that is going to get us into a rhythm heading into the playoffs.” \n\nThat’s the goal, which Vogel emphasized again on Friday. The Lakers are on pace to earn the No. 1 seed in the Western Conference, and their priorities will start shifting to maintaining health and rhythm in the final run of the regular season. \n\nSo yes, he acknowledged, potential playoff matchups like the Grizzlies are “in the back of our minds,” but first things come first. \n\n“The answers reveal themselves after the fact,” he said. “We’re not thinking about playoffs tonight. We’re thinking about getting one win.” \n\n.\n— Spectrum SportsNet (@SpectrumSN) \n\n\n\"They're both just winning players. Alex is one of those guys who impacts the game in a million different ways.\" Frank Vogel on the impact Danny Green & Alex Caruso made on tonight's \n— Spectrum SportsNet (@SpectrumSN) \n\n\n.\n— Spectrum SportsNet (@SpectrumSN) \n\n\nHere’s Anthony Davis on the Boston game. The Lakers were drubbed by the Celtics last month. \n\n“Worst loss of season for us. We didn’t play our best at all. We remember that for sure. We feel like we owe them.” \n— Kyle Goon (@kylegoon) \n\n\n.\n— Spectrum SportsNet (@SpectrumSN) \n\n"},"7":{"tilte":"\n\t\t\tReport: Lakers to waive DeMarcus Cousins, hope to add Markieff Morris\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/report-lakers-to-waive-demarcus-cousins-hope-to-add-markieff-morris\/","discription":"\nLOS ANGELES — On Friday evening, just as he has for almost every day this season, DeMarcus Cousins showed up for work. \n\nHe hugged employees on his way to the locker room roughly two hours before tip-off against the Memphis Grizzlies. Then he sat inside under the locker bearing his last name. While he has not played this season since tearing his left ACL, Cousins has been a consistent presence around the team – even on trips. \n\t\t\t\t\t\t\nIt’s likely one of the last such days Cousins will have this season as a Laker: Multiple media reports indicate the team is making a move in the buyout market, intending to add forward Markieff Morris if he clears waivers on Sunday, and waiving Cousins to create the necessary roster spot. \n\nThe Athletic reported that Morris was entering the market after agreeing to a buyout with the Detroit Pistons on Friday. ESPN was first to report that Cousins, a former All-Star who was injured in August, would be cut to make room for an addition the Lakers hope can bolster their frontcourt for the postseason. \nThe Lakers declined to officially comment, with Coach Frank Vogel saying: “I don’t have any comment about rumors or reports.” \n\nMorris is the latest chess move as Western Conference contenders have worked to improve their rosters for the playoffs, but it’s the first addition the Lakers have made during the season. The Clippers added veteran guard Reggie Jackson and Morris’ twin brother, Marcus; the Rockets added veterans Robert Covington, Jeff Green and Demarre Carroll. Morris could still be claimed by another team with cap space – or trade exceptions – off waivers before Sunday. \n\nMorris, 30, was averaging 11 points and 3.9 rebounds while shooting 39.7 percent from 3-point range in 44 games for the Pistons, who have torn down their roster for a full rebuild. Over nine seasons, he has averaged 11.6 points, 5.4 rebounds and 1.7 assists in 623 games while shooting 34.5 percent from beyond the arc. The Athletic reported that Morris was told the Lakers would use him as a reserve power forward, potentially freeing up Kyle Kuzma to see more minutes at small forward. \n\nThe Lakers were in the running to add Morris last season, when he was bought out by the Washington Wizards, but he instead signed with the Oklahoma City Thunder. \n\nMorris reportedly is leaving $4.3 million, the remainder of this season and his 2020-21 salary, on the table, according to ESPN. The Lakers can use a $1.75 million exception, awarded by the NBA when Cousins suffered his injury, to help sign Morris – significantly higher than the veteran’s minimum. \nA subplot of the potential move is a rivalry between the twin Morris brothers for the Los Angeles franchises. At Clippers practice on Friday, Marcus Morris said he’d still support his brother even though he would be playing for the Lakers. \n\n“I’m gonna be in Staples Center all the time,” he said. “I think maybe to y’all it might be weird that I’m going to all his games, but that’s what’ll probably happen. And we’ll probably get a house together.” \n\nAs recently as Thursday, the Lakers addressed questions as to whether Cousins, a popular player in the Lakers locker room, would be ready for the playoffs. \nThe move seems to acknowledge that Cousins’ medical progress didn’t look good to return this year. Vogel said that it wouldn’t be “ideal” for the 29-year-old to be finding his rhythm again during the postseason. \n\nThe New York Times reported that Cousins, if he is not picked up by another team, might be permitted to continue rehabbing his injury at the Lakers’ practice facility. \n\nThe Lakers originally signed Cousins in July, hoping the former All-Star’s bond with Anthony Davis would lead to something special. Cousins came in with injury concerns, suffering an Achilles rupture in 2018 when he played with Davis and the New Orleans Pelicans, and tearing his left quadriceps in the middle of Golden State’s 2019 postseason run. \n\nThe move comes as Cousins made his first public comments about his injury and his offseason misdemeanor domestic violence allegation (since dismissed) on a podcast earlier in the week. On “All The Smoke” with former NBA players Steven Jackson and Matt Barnes, Cousins said: “I said the wrong thing. Heat of the moment, we’ve all done it.” \n\n\n"},"8":{"tilte":"\n\t\t\tCharisma Osborne scores 32 to lead UCLA women’s basketball past Washington State\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/charisma-osborne-scores-32-to-lead-ucla-womens-basketball-past-washington-state\/","discription":"\nPULLMAN, Wash. — UCLA coach Cori Close had one thing to say about her team’s come-from-behind win over Washington State: Thank goodness for Charisma Osborne. \n\n“We were in a heap of trouble if it weren’t for Charisma,” Close said. “The bottom line is though, I’m bringing the joy because we found a way.” \n\t\t\t\t\t\t\nOsborne had a career-high 32 points and 11 rebounds and No. 8 UCLA rallied in the fourth quarter and beat Washington State 70-62 Friday night. \n\nTrailing 61-57 with 3:30 remaining, Osborne was fouled on a 3-point attempt. She made all three free throws, pulling the Bruins within a point. \nKiana Jefferson made two baskets and Osborne hit a jumper with 1:14 left to close out the Cougars. \n\nThe Bruins (23-3, 12-3 Pac-12) won despite shooting just 34% from the field and committing 17 turnovers. UCLA improved to 23-8 all-time in Pullman and has won consecutive games following an 80-66 home loss to No. 3 Oregon on Feb. 14. \n\nOsborne, who averages 14 points, posted a career high in scoring for the second straight game. She put up 22 points in the Bruins’ 83-74 overtime win over No. 15 Oregon State on Monday. \n\nOsborne shot 11 of 21 against Washington State and recorded her third double-double of the season. She was the only Bruins player to score in double figures. \n\nBorislava Hristova scored 29 points for Washington State (11-16, 4-11 Pac-12), which lost its fourth straight. Hristova went down with what appeared to be a leg injury with a little over a minute to play. She returned after being checked out in the locker room. Chanelle Molina added 15 points and nine rebounds for the Cougars. \n“Well, I feel a lot of emotion right now. Just really proud of our team and how hard they played. Their start of the game was unbelievable energy wise and we really had tremendous effort by Bobby and Molina, two kids who you would expect it from as seniors,” said WSU Coach Kamie Ethridge. “This was just a really good UCLA team that has so many weapons that it is hard to hold them down for an entire game.” \n\nUCLA shot 25% in the first quarter as Washington State jumped out to a 19-11 lead behind Hristova’s 11 points. Washington State center Bella Murekatete had four steals and the Cougars forced nine turnovers on a UCLA team that averages 11.4 per game. \n\nUCLA cut the Washington State lead to 34-31 in the second quarter as Osborne took control, scoring 12 of her team’s 20 points on 5-of-7 shooting. \n\nUCLA took its first lead when Michaela Onyenwere scored a layup off a fast break, making the score 39-38 with 6:49 left in the third. \n\n With South Carolina, Baylor and Oregon having established themselves as the three best teams in the country, UCLA is in a crowded field competing for the final No. 1 seed in the NCAA Tournament. The Bruins have only one marquee non-conference win (at Indiana) and their three remaining games are against teams in the bottom half of the Pac-12 standings. They will need a convincing finish to the regular season to make their case for the final top seed in March. \n\n The Cougars have lost 34 straight games against Top-25 ranked teams. They are currently 7-7 when playing in Pullman and will have one more opportunity, on Sunday against USC, to secure their first winning season at home since 2016-2017. \n\n At Washington on Sunday. \n\n Host USC on Sunday. \n"},"9":{"tilte":"\n\t\t\tDodgers photo day at spring training: See the new and returning faces\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/20\/dodgers-photo-day-at-spring-training-see-the-new-and-returning-faces\/","discription":"\n \nNew Dodgers starting pitcher David Price poses for a portrait during Spring Training Photo Day on Thursday at Camelback Ranch in Glendale, Ariz. (Photo by Kevin Sullivan, Orange County Register\/SCNG)\n \n\t\t\t\t\t\t\n \nDodgers outfielder Cody Bellinger poses for a portrait during Spring Training Photo Day on Thursday at Camelback Ranch in Glendale, Ariz. (Photo by Kevin Sullivan, Orange County Register\/SCNG)\n \n \nDodgers third baseman Justin Turner poses for a portrait during Spring Training Photo Day on Thursday at Camelback Ranch in Glendale, Ariz. (Photo by Kevin Sullivan, Orange County Register\/SCNG)\n \n \nDodgers starting pitcher Clayton Kershaw poses for a portrait during Spring Training Photo Day on Thursday at Camelback Ranch in Glendale, Ariz. (Photo by Kevin Sullivan, Orange County Register\/SCNG)\n \n \nDodgers relief pitcher Blake Treinen poses for a portrait during Spring Training Photo Day at Camelback Ranch in Phoenix on Thursday, Feb. 20, 2020. (Photo by Kevin Sullivan, Orange County Register\/SCNG)\n \n \nDodgers utility player Chris Taylor poses for a portrait during Spring Training Photo Day at Camelback Ranch in Phoenix on Thursday, Feb. 20, 2020. (Photo by Kevin Sullivan, Orange County Register\/SCNG)\n \n \nDodgers shortstop Corey Seager poses for a portrait during Spring Training Photo Day at Camelback Ranch in Phoenix on Thursday, Feb. 20, 2020. (Photo by Kevin Sullivan, Orange County Register\/SCNG)\n \n \nNew Dodgers outfielder Mookie Betts poses for a portrait during Spring Training Photo Day on Thursday at Camelback Ranch in Glendale, Ariz. (Photo by Kevin Sullivan, Orange County Register\/SCNG)\n \n \nDodgers outfielder Joc Pederson poses for a portrait during Spring Training Photo Day at Camelback Ranch in Phoenix on Thursday, Feb. 20, 2020. (Photo by Kevin Sullivan, Orange County Register\/SCNG)\n \n \nDodgers starting pitcher Walker Buehler poses for a portrait during Spring Training Photo Day at Camelback Ranch in Phoenix on Thursday, Feb. 20, 2020. (Photo by Kevin Sullivan, Orange County Register\/SCNG)\n \n \nDodgers utility player Kike Hernandez poses for a portrait during Spring Training Photo Day at Camelback Ranch in Phoenix on Thursday, Feb. 20, 2020. (Photo by Kevin Sullivan, Orange County Register\/SCNG)\n \n \nDodgers relief pitcher Kenley Jansen poses for a portrait during Spring Training Photo Day at Camelback Ranch in Phoenix on Thursday, Feb. 20, 2020. (Photo by Kevin Sullivan, Orange County Register\/SCNG)\n \n \nDodgers infielder Max Muncy poses for a portrait during Spring Training Photo Day at Camelback Ranch in Phoenix on Thursday, Feb. 20, 2020. (Photo by Kevin Sullivan, Orange County Register\/SCNG)\n \n \nDodgers pitcher Julio Urias poses for a portrait during Spring Training Photo Day at Camelback Ranch in Phoenix on Thursday, Feb. 20, 2020. (Photo by Kevin Sullivan, Orange County Register\/SCNG)\n \n \nDodgers pitcher Dustin May poses for a portrait during Spring Training Photo Day at Camelback Ranch in Phoenix on Thursday, Feb. 20, 2020. (Photo by Kevin Sullivan, Orange County Register\/SCNG)\n \n \nNew Dodgers pitcher Brusdar Graterol poses for a portrait during Spring Training Photo Day on Thursday at Camelback Ranch in Glendale, Ariz. (Photo by Kevin Sullivan, Orange County Register\/SCNG)\n \n \nGLENDALE, Ariz. — The Dodgers are back on the field at spring training – and they’ve added some high-profile new pieces to their lineup as they try to get back to the World Series. \n\nEvery year at spring training the Dodgers, like every MLB team, hold Photo Day, the annual parade of players and coaches having their moment in front of the cameras from several media outlets. \n\nDodgers players and coaches were out there posing for the cameras on Thursday at their Camelback Ranch facility. Check out some of the new faces and returning veterans photographed by O.C. Register\/SoCal News Group staff photographer Kevin Sullivan. \n"},"10":{"tilte":"\n\t\t\tUSC basketball putting its fate in NCAA selection committee’s hands with recent losses\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/usc-basketball-putting-its-fate-in-ncaa-selection-committees-hands-with-recent-losses\/","discription":"\nThe ramifications of the USC men’s basketball team’s \nOn its surface, a four-point road loss to a ranked opponent that \nUSC (19-8) fell to 8-6 in the Pac-12 Conference, and with four games left it’s conceivable the Trojans fall below .500 in conference play after entering February 6-2. Worse, USC is now in sixth place in the Pac-12 after \nEven if USC rallies to finish the season, it’s put itself in a delicate situation when it comes to tiebreakers. The Trojans need to finish in the top-four in the Pac-12 to secure a bye to the conference tournament’s quarterfinals. \nBut USC is now 1-5 against the five teams ahead of it in the conference standings, the lone win \nBeyond the conference, USC has done itself no favors of late when it comes to the NCAA Tournament picture. In Quadrant 1 opportunities, USC is 2-7, the two wins coming against LSU and at Oregon State. \n\nNow, you never know what the selection committee is going to pay the most attention to each March. In NET ratings, USC is in good position at 44th nationally. The Trojans are 60th in strength of schedule, which should only improve with games against Arizona and Arizona State next week. \n\nBut the quadrant system is a good way to measure how teams are performing against the best competition. Colorado and Oregon have six Quadrant 1 wins apiece. Arizona State has five. Even UCLA has four. \n\nSo with only one Quad 1 opportunity left (next week against Arizona), USC is leaving itself at the mercy of the selection committee when it comes to at-large bids in March, especially with a 2-4 record in February. \nAnd this is being reflected by tournament prognosticators. \nAnother loss or two could see the Trojans on the outside looking in. \n\nThey’ll try to get back on track on Sunday against Utah (14-12, 5-9 in Pac-12), a team that has lost four of six since \nIn that game, USC rallied from a nine-point second-half deficit to win 56-52. Nick Rakocevic led the Trojans with 16 points and 15 rebounds, while Elijah Weaver scored 14. \n\nWeaver was the subject of head coach Andy Enfield’s ire Thursday night. The sophomore guard incorrectly ran a play as the Trojans tried to tie things up with Colorado late in the second half. \n\n“If he wants to be a lead guard in this league, you got to be able to come out in a game-time situation when the game’s on the line and follow directions and go to the right side of the floor,” Enfield steamed to reporters after the game. \n\nJust more frustration as USC’s fate slips out of its hands. \n\n\n\n3 p.m. Sunday \n\nJon M. Hunstman Center (Salt Lake City) \n\nESPNU\/AM 790 \n  \n\t\t\t"},"11":{"tilte":"\n\t\t\tClippers enjoy a full complement at practice, at least\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/clippers-enjoy-a-full-complement-at-practice-at-least\/","discription":"\nPLAYA VISTA — Everyone, old and new, was present and accounted for – and on the court – Thursday and Friday. \n\nKey cogs Paul George and Patrick Beverley joined newcomers Marcus Morris and Reggie Jackson among the participants at practices Thursday and Friday, as the Clippers (37-18) prepare for the final 27-game regular-season push that begins with a Saturday matinee against the Sacramento Kings (22-33) at Staples Center. \n\t\t\t\t\t\t\nGeorge and Beverley both are listed as “out” for Saturday, but George’s participation in practice was welcome considering he’s been battling an ailing left hamstring, which forced him from the Clippers’ game in Boston just before the All-Star break. Similarly, it was a boost to have Beverley on the practice floor, even though he will miss his fifth consecutive game (and eighth of the past 12) dealing with a nagging groin injury. \n\n“It’s game to game, but even if we can’t have healthy games, let’s have healthy practices,” Clippers coach Doc Rivers said. “It’s funny, I talked to about four or five coaches over the break, that was their big thing. People make a big deal about load management, what they’re missing is the load management of practice. It’s one thing that they can’t play in a game, but when you can’t play in a game or practice, that hurts. That was our first half of the year. \n“Guys missed games (96 collectively) but more importantly, even when the guys were playing, some of them couldn’t practice … that bothered me more than them missing a game. Like today, everybody practiced. If tomorrow everyone doesn’t play, not the best, but at least we got a practice in.” \n\nLess imperative, perhaps, but after Friday’s practice, Jackson and Morris also got in their introduction to the L.A. media. \n\n“Y’all gotta mic stand? It’s different out here. I love it,” said Morris, the 6-foot-8 former New York Knicks forward, as he stood before a collection of microphones after practice at the Honey Training Center – just a little more than five miles from the Lakers’ El Segundo training facility where his twin brother, Markieff, soon will be practicing if he signs with the Clippers’ crosstown rivals, as reports indicate he will. \n\nMarcus Morris joined the Clippers on the road for three games before the All-Star break after he was acquired in a three-team deal at the trade deadline. \n\nJackson, after agreeing to a buyout with the Detroit Pistons and subsequently clearing waivers, joined the Clippers – and George, “probably my best friend in the league” – just this week. \nJackson said he and George have been dreaming of playing together for years, right up until it actually happened. \n\n“It’s been brought up since my first year in the league,” Jackson said of those conversations with George, the six-time All-Star forward for whom the Clippers traded this offseason in a sequence of moves that also netted Kawhi Leonard, precisely the result that was sought by both players. \n\n“He’s always been like ‘We’re going to play together,’ and we wanted to, was trying in Indy, (but) we ended up division rivals (on the Pistons and Indiana Pacers),“ Jackson said. “And I loved going against him – he has the head-to-head matchup (11-4, \n“But it’s something that we’ve always talked about, so it felt surreal even hanging out after practice yesterday and leaving his house, telling him ‘I’ll see you in the morning.’ And then practice has just been awkward, but it’s been fun though.” \n\nLike Jackson himself, Rivers said the ninth-year guard – who was averaging 27.2 minutes, 14.1 shots and 14.9 points per game this season in Detroit – won’t have issues handling reduced responsibilities and opportunities in L.A. \n\n“It’s funny, everyone talks about the ‘buy-in,’” Rivers said. “Listen, if you’re coming to a team that has championship aspirations, you’re not getting the same shots – and everybody knows that. It’s funny, when I read … such and such is averaging five points less – well, he should. He’s on a team with five better players, that’s the way it works.” \n\nWhat Rivers is focused on, he said, is the issues that Jackson’s presence will solve. \n\n“Lou (Williams) was doing too much ball-handling,” Rivers said. “And I thought it hurt his scoring. We want Lou to be a scorer. And because we didn’t have that extra guard, Lou was doing all the ball-handling duties and I thought that hurt him. Now, Lou can focus on what he really does well and Reggie can get it to him, and that’s good.” \n\nReggie Jackson doing his thing on the other. \n— Mirjam Swanson (@MirjamSwanson) \n\n"},"12":{"tilte":"\n\t\t\tAngels’ JC Ramírez said his velocity returned to 96 mph in winter ball\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/angels-jc-ramirez-said-his-velocity-returned-to-96-mph-in-winter-ball\/","discription":"\nTEMPE, Ariz. — JC Ramírez had a bad feeling when he looked up at the scoreboard after returning from Tommy John surgery. \n\n“I was never used to being in that situation, seeing on the scoreboard 93 on the best day,” Ramírez said. “It was 91-92. It was frustrating.” \n\t\t\t\t\t\t\nRamírez averaged 95.6 mph with his fastball in 2017, but it was down to 91 mph when he came back in 2019. He pitched in just five games and then the Angels designated him for assignment. \n\nRamírez took some time off after the season to get married and take a European honeymoon, and then he began physical therapy. He pitched in Mexico over the winter and said he got his fastball back up to 96 mph. \n“I think the key was rest,” he said. “I rested my arm. My muscles weren’t fully healed.” \n\nThe Angels saw enough in two workouts to sign him to a minor league deal earlier this week, and Ramírez was happy to return to a place he’d pitched for most of the past four seasons. Ramírez could get a shot at the bullpen or he could go onto the starter depth chart. \n\n“At this point, I am just hoping to throw the ball and show the team I’m healthy,” he said. “They can use me however. I’m pretty comfortable to do any role.” \n\nThe Angels are scheduled to start Tommy La Stella (2B), David Fletcher (3B), Brian Goodwin (RF), Taylor Ward (LF), Matt Thaiss (1B), Michael Hermosillo (CF), Luís Rengifo (SS), Jared Walsh (DH) and José Briceño (C) in their home Cactus League opener on Saturday, with Matt Ball starting on the mound. … \n\nIn the road game against the Chicago White Sox, the Angels will start Brandon Marsh (LF), Jo Adell (RF), Anthony Bemboom (C), José Rojas (1B), Jahmai Jones (2B), Arismendy Alcantara (SS), Brennon Lund (CF), Elliot Soto (3B) and Franklin Torres (DH). Jake Thompson will be the first pitcher. … \nOutfielder D’Shawn Knowles and infielders Jeremiah Jackson and Kevin Maitan are the notable prospects among the players scheduled to come off the bench in the home game. … \n\nManager Joe Maddon said Tuesday he’s planning to have all of his regulars playing by Tuesday. … \n\nMike Trout and Justin Upton collaborated to help a fan do a gender reveal during Friday’s workout. Trout flipped a ball to Upton, who hit it, revealing a puff of pink powder. \n  \n\t\t\t"},"13":{"tilte":"\n\t\t\tRams promote Sophie Luoto to run football operations department\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/19\/rams-promote-sophie-luoto-to-run-football-operations-department\/","discription":"\nThe Rams have named Sophie Luoto director of football operations, making her the top female executive on the football side of the team’s front office. \n\nThe move, first \nLuoto had been manager of football administration in the Rams’ player-personnel department. \n\nIn her new role, Luoto will be responsible for day-to-day management of football operations, including running the Rams’ training headquarters in Thousand Oaks, training camp and team travel. \nA UCLA graduate, Luoto was director of recruiting operations for Cal football before joining the Rams in 2016 as they moved from St. Louis to Los Angeles. \n\nHer promotion was greeted warmly by Rams players, including quarterback Jared Goff, who tweeted: “Most deserving. Congrats @sophieluoto!!” \n\nMost deserving. Congrats \n— Jared Goff (@JaredGoff16) \n "},"14":{"tilte":"\n\t\t\tWhicker: Odds are that Philip Rivers still has a football life beyond the Chargers\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/10\/whicker-odds-are-that-philip-rivers-still-has-a-football-life-beyond-the-chargers\/","discription":"\nTake the meager band of Los Angeles Chargers partisans who buy tickets. \n\nSubtract 10. \n\t\t\t\t\t\t\nPhilip and Tiffany Rivers and the nine children had already moved to Florida before the deal came down Monday. Now Dad is officially on the quarterback market. \n\nHe will take his first snaps as an ex-Charger in 2020, and the final identifying characteristic of the franchise will be gone, just as it moves into SoWhat Stadium. \n“This is not a sad day,” said Nick Hardwick, Rivers’ center when the Chargers last played in an AFC Championship Game, at New England in 2007. \n\nHe meant it wasn’t sad for Rivers. \n\n“It can be a great experience for him to walk into a new stadium, to deal with a new franchise and have new teammates,” Hardwick said. “This is an opportunity.” \n\nOffhand, Hardwick thought Indianapolis could be the landing spot, with strong blocking and with Frank Reich, the Chargers’ former offensive coordinator, as the head man. \n\nHe also noted that Tampa Bay’s Bruce Arians has fed and cared for older quarterbacks over the years. \n“But there’s New England, too,” Hardwick said. “If Tom Brady really does go elsewhere, it would be fun for Philip to go inside the Death Star and see how they go about things. New England was the base camp for the AFC Championship Game almost every year. \n\n“And I thought about the Raiders, too. They’ve got a great center in Rodney Hudson, and a good running game, and I think Jon Gruden knows about Philip. It might take a little getting used to, seeing Philip in that uniform, but people will get used to it.” \n\nSeeing someone else in the lightning-bolt hat might be difficult, too. \n\nAlmost every mock-drafter, with only two-and-a-half months until Roger Goodell takes the stage, thinks Oregon’s Justin Herbert will be the Chargers’ first pick, at No. 6. Tyrod Taylor has started an NFL playoff game and can place-hold the position until Herbert readies himself. \n\nAnd it’s true that Rivers’ misfirings helped send the Chargers spiraling to 5-11, a year after they went 12-4 and won a playoff game in Baltimore. \n\nBut Rivers has teed it up 235 consecutive times, more than any other quarterback except for Brett Favre (321). Russell Wilson, at 128, is the only other QB with an active triple-digit streak. \n\nRivers played that \n“I can’t tell you how many times it didn’t look like he could get ready for the next week, and then he did,” Hardwick said. “He’s the toughest guy I’ve ever been around. He’s an offensive lineman playing quarterback.” \n\nRivers is a famous chirper who fired shots across the scrimmage DMZ. Hardwick was a sideline reporter one day in San Diego when Denver’s Von Miller sacked Rivers, who grabbed Miller’s jersey, wouldn’t let him up and then followed him into the Denver huddle to land the last word. \n\nOne day the Ravens got to Rivers, but he threw for a first down anyway, and then he looked at Baltimore coach John Harbaugh and yelled, “You call that a blitz?” \n\n“My favorite times were the mornings,” Hardwick said. “We’d go through the tape, and he’d identify every blitz the other team had, who was coming, who was giving it away just by the way they were standing, what we should look if he did come. To this day he can tell you every defensive back he ever played against and what his tendencies were. Then we’d go out there Sunday and it would happen just like he said.” \n\nRivers began learning football when most kids began teething. His dad Steve was his high school coach in Athens, Ala. He was throwing varsity footballs before he was old enough to grip them, and that evolved into his funky delivery that he wasn’t supposed to turn into 397 touchdown passes and 123 wins, and he led the NFL in 10 different categories during his career. \n\nWith all the recent inefficiencies, he still has 7.8 yards per pass attempt, ninth all-time and second (to Wilson) among today’s QBs. \n\nAuburn tried to recruit him as a tight end, and Rivers, who is 6-foot-5 and 228, also played safety and linebacker. One year he intercepted seven passes. \n\n“I can imagine what he’ll be like when he coaches a high school team,” Hardwick said. “He’ll be in-your-face, non-stop, all the things he is as a quarterback.” \n\nYou’ll notice the present tense. After three years of indignity in a sports park, Philip Rivers deserves another home game, or eight. \n\n  \n\nPhilip Rivers’ Top 10 throws from his final season with the \n— NFL (@NFL) \n\n"},"15":{"tilte":"\n\t\t\tKings host two of NHL’s best in Nathan MacKinnon, Leon Draisaitl this weekend\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/kings-host-two-of-nhls-best-in-nathan-mackinnon-leon-draisaitl-this-weekend\/","discription":"\nWhile the Kings have been sellers leading up to the NHL trade deadline, hockey fans should be buyers at Staples Center this weekend as the Kings welcome arguably the two best players in the league this season. \n\nThey’ll face the Colorado Avalanche and center Nathan MacKinnon on Saturday and then square off with left wing Leon Draisaitl and the Edmonton Oilers on Sunday. The Avs will also have in tow this season’s top rookie, defenseman Cale Makar. \n\t\t\t\t\t\t\n“We’re spoiled because we get to watch MacKinnon play every game, watch the way he skates and the way we can create offense from his speed, explosiveness and power. We’ve got the same thing with Cale Makar, just as a defenseman,” Colorado coach Jared Bednar said. \n\nRay Ferraro, Guy Carbonneau and a host of other prominent former players have been heaping praise on the temeritous tandem of center Connor McDavid and Draisaitl. The two had been trading places in the top two among scorers until McDavid sustained a lower-body injury earlier this month. MacKinnon’s 84 points tie him for second in the NHL behind Draisaitl, who seems destined for the Art Ross Trophy given his 11-point lead in the scoring race. \nThe Kings, who have been trading away veterans all month as part of their rebuild, are coming off a \nCenter Gabriel Vilardi played his first NHL game. The 2017 first-round selection was one of the top talents in his draft class, but back issues have slowed his ascent to the pros. Among other successful outings for recent additions, Vilardi scored his first goal just 10 seconds into his first shift and also earned his first assist on a go-ahead goal on Thursday. \n\n“(The players) know his story and know his struggle to get back healthy … everyone was excited for him,” Kings coach Todd McLellan said. “To have him score in 10 seconds was remarkable and it affected the bench. The enthusiasm was contagious.” \n\nNext, the Kings face two of the top teams in the West, against whom they have had some success this season. They have lost two of three games to Edmonton, but they are ahead in the aggregate score 11-9 by way of a decisive 5-1 win at home and two one-goal heartbreakers in Edmonton. The Kings have won their only meeting with Colorado thus far, earning a 3-1 victory outdoors in the Feb. 15 Stadium Series matchup in Colorado Springs. \n\n Saturday, 7:30 p.m. \n Staples Center \n\n Fox Sports West, iHeartRadio \n\n Sunday, 7 p.m. \n\n Staples Center \n\n Fox Sports West, iHeartRadio \n"},"16":{"tilte":"\n\t\t\tDucks blanked by Avalanche in their third consecutive defeat\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/ducks-blanked-by-avalanche-in-their-third-consecutive-defeat\/","discription":"\n \nThe Ducks’ Max Jones, left, pushes the Colorado Avalanche’s J.T. Compher against the boards during the first period of Friday’s game at Honda Center. (AP Photo\/Marcio Jose Sanchez)\n \n\t\t\t\t\t\t\n \nColorado Avalanche’s Martin Kaut, left, is defended by Anaheim Ducks’ Brendan Guhle during the first period of an NHL hockey game Friday, Feb. 21, 2020, in Anaheim, Calif. (AP Photo\/Marcio Jose Sanchez)\n \n \nColorado Avalanche’s Nathan MacKinnon (29) is chased by Anaheim Ducks’ Nicolas Deslauriers (20) during the first period of an NHL hockey game Friday, Feb. 21, 2020, in Anaheim, Calif. (AP Photo\/Marcio Jose Sanchez)\n \n \nColorado Avalanche’s Gabriel Landeskog, right, is defended by Anaheim Ducks’ Carter Rowney (24) during the first period of an NHL hockey game Friday, Feb. 21, 2020, in Anaheim, Calif. (AP Photo\/Marcio Jose Sanchez)\n \n \nAnaheim Ducks’ Nicolas Deslauriers, right, controls the puck in front of Colorado Avalanche’s Ryan Graves during the second period of an NHL hockey game Friday, Feb. 21, 2020, in Anaheim, Calif. (AP Photo\/Marcio Jose Sanchez)\n \n \nAnaheim Ducks’ Derek Grant, left, is defended by Colorado Avalanche’s Cale Makar during the second period of an NHL hockey game Friday, Feb. 21, 2020, in Anaheim, Calif. (AP Photo\/Marcio Jose Sanchez)\n \n \nColorado Avalanche’s Erik Johnson, center, defends on Anaheim Ducks’ Max Jones (49) during the second period of an NHL hockey game Friday, Feb. 21, 2020, in Anaheim, Calif. (AP Photo\/Marcio Jose Sanchez)\n \n \nAnaheim Ducks goaltender John Gibson, bottom, stops a shot against the Colorado Avalanche during the first period of an NHL hockey game Friday, Feb. 21, 2020, in Anaheim, Calif. (AP Photo\/Marcio Jose Sanchez)\n \n \nColorado Avalanche’s J.T. Compher, left, celebrates after scoring against the Anaheim Ducks during the second period of an NHL hockey game Friday, Feb. 21, 2020, in Anaheim, Calif. (AP Photo\/Marcio Jose Sanchez)\n \n \nThe Colorado Avalanche celebrate after a goal by J.T. Compher during the second period of an NHL hockey game against the Anaheim Ducks Friday, Feb. 21, 2020, in Anaheim, Calif. (AP Photo\/Marcio Jose Sanchez)\n \n \nAnaheim Ducks’ Josh Manson, left, pushes Colorado Avalanche’s Tyson Jost against the boards during the third period of an NHL hockey game Friday, Feb. 21, 2020, in Anaheim, Calif. (AP Photo\/Marcio Jose Sanchez)\n \n \nColorado Avalanche’s J.T. Compher (37) faces off against Anaheim Ducks’ Adam Henrique (14) during the third period of an NHL hockey game Friday, Feb. 21, 2020, in Anaheim, Calif. (AP Photo\/Marcio Jose Sanchez)\n \n \nAnaheim Ducks’ Rickard Rakell (67) works against Colorado Avalanche’s Pierre-Edouard Bellemare (41) during the third period of an NHL hockey game Friday, Feb. 21, 2020, in Anaheim, Calif. (AP Photo\/Marcio Jose Sanchez)\n \n \nColorado Avalanche’s Nathan MacKinnon, left, kicks up ice next to Anaheim Ducks’ Troy Terry (61) during the third period of an NHL hockey game Friday, Feb. 21, 2020, in Anaheim, Calif. (AP Photo\/Marcio Jose Sanchez)\n \n \nAnaheim Ducks’ Korbinian Holzer (5) works against Colorado Avalanche’s Matt Nieto during the third period of an NHL hockey game Friday, Feb. 21, 2020, in Anaheim, Calif. (AP Photo\/Marcio Jose Sanchez)\n \n \nANAHEIM — Their goaltending was outstanding from beginning to end. Their defense was sound save for one hiccup. They won plenty of battles along the boards and in front of the nets. They hardly looked like a defeated team after falling behind by a goal late in the second period. \n\nThe Ducks simply couldn’t score and they couldn’t beat the Colorado Avalanche on Friday at Honda Center, absorbing a 1-0 defeat. Their third consecutive loss was unlike their previous two, far more competitive than the others, but in the end, the result was the same. \n\nAvalanche goalie Pavel Francouz made 26 saves for his first NHL shutout, turning away the league’s second-worst offensive team again and again. J.T. Compher scored the only goal of the game, beating John Gibson on a one-timed shot after a Ducks turnover in the second period. \n\nGibson made 28 saves, but couldn’t stop Compher’s laser from the left faceoff circle, off a pass from teammate Martin Kaut at 16:38 of the middle period. Ducks coach Dallas Eakins declined to fault defenseman Hampus Lindholm for an errant breakout pass that Kaut intercepted at the blue line. \nLindholm had a team-leading five shots in a team-high 22:53 of ice time. \n\n“I see what our defenseman saw,” Eakins said, referring to Lindholm. “Their guy (Kaut) came out of his blind spot. It was a real honest mistake. That’s the only one I can remember from the night. It’s a bit of an outlier. Overall, I thought our ‘D’ moved the puck pretty well.” \n\nThe first period was evenly-played, the Avalanche assumed control in the second and then the Ducks pushed back hard in the third. The Ducks couldn’t fire the puck behind Francouz, who started his third consecutive game after Philipp Grubauer suffered a lower-body injury Feb. 15. \n\nDucks defenseman Michael Del Zotto certainly could have used a little better luck on his close-range bid in the first period and then on another chance in the third. One shot struck the crossbar and ricocheted out of harm’s way and the other glanced off the nob of Francouz’s stick. \n\n“Off the crossbar, off the post in the last game, off his nob in the third period tonight,” Del Zotto said. “I’ve been getting some pretty good looks. I’ve been getting more ice time as of late, playing on the power play some. When that happens, you feel more comfortable with the puck. \n“I’m getting good looks. It’s just a matter of one or two going in and getting on a hot streak.” \n\nThe Ducks’ frustration was evident by game’s end. \n\n“That’s the way it goes, 6-5 or 1-0, it’s the same thing, really,” center Adam Henrique said. “I thought we played hard, battled hard, stuck to the game plan. They were getting pressure. We did a good job defensively. They’re shifty. They’re fast. They create a lot. We were fairly poised. \n\n“The other side of it is, we’ve got to find a way to get one. That’s the bottom line.” \n\nDefenseman Cam Fowler sat out for the second consecutive game because of an unspecified lower-body injury and there was no timetable for his return to the lineup. Fowler had played in each of the Ducks’ first 59 games before he was sidelined for Wednesday’s game against Florida. \n\nThe Ducks were down to only six healthy defensemen for the second game in a row. Erik Gudbranson continues to be sidelined by an unspecified upper-body injury that kept him out of the lineup for a sixth consecutive game (not including the postponed game against St. Louis on Feb. 11). \n\n“I do not know the timeline,” Eakins said when asked after the game for an update on Fowler’s status. “I do know he’s been examined (by team doctors). He’s out of the question for the weekend. I know that. I don’t know how much longer.” \n\nLindholm played in his 500th game in the NHL, all with the Ducks, who drafted him in the first round (sixth overall) in 2012. Lindholm, 26, played 44 games in the AHL in 2012-13 and then made the jump to the NHL with the Ducks the following season. \n  \n\t\t\t"},"17":{"tilte":"\n\t\t\tGordon Wild focusing on making the Galaxy roster after two “up-and-down” seasons to start professional career\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/gordon-wild-focusing-on-making-the-galaxy-roster-after-two-up-and-down-seasons-to-start-professional-career\/","discription":"\nGordon Wild needed some time to reevaluate his soccer career. \n\nIt would be understandable if Wild was in the latter stages of a career, but here he was, just two years removed from signing a Generation Adidas contract with MLS and being selected by Atlanta United in the 2018 SuperDraft. \n\t\t\t\t\t\t\n“I was originally planning on going back to Europe and playing there,” he said Wednesday following the Galaxy’s 2-1 preseason win against Colorado. “I was in Amsterdam visiting my dad and in the middle of January, (Galaxy technical director) Jovan (Kirovski) called me and then he said the coach wants to see me. \n\n“We talked a little bit and what they told, it felt like this was going to be a good opportunity. I kind of had my head off of the U.S., I was more focused on Europe, but the Galaxy called, I came to have a look and I’m loving it. It came a little bit out of nowhere, but again, this is life and sometimes things happen out of nowhere.” \nWild, 24, joined the Galaxy’s training camp as a trialist, although he expects to be signed in the coming days. Wild has been in L.A. for just three weeks. \n\nGalaxy coach Guillermo Barros Schelotto said he has a good feeling about Wild improving over the year. \n\nIn 2018, Wild was loaned to the Charleston Battery in the USL, and in July 2019, Atlanta United waived him. He was signed by D.C. United, but again loaned to the USL (Loudoun United). \n\nNot exactly the way he had hoped his professional career to begin after leaving Maryland following his junior year. \n\n“The last two years weren’t easy for me,” he said. “Ups and downs, didn’t go completely as planned, but that’s life. I’ve learned my lessons and I’ve never lost the drive of getting better, learning more about the game mentally, physically and keep improving. \n“I always believe my time will come and I will keep working hard, putting my head down, getting better and that’s all I can do.” \n\nWild will look to take advantage of Saturday’s opportunity as the Galaxy host the Chicago Fire in the final preseason game (3 p.m.; Spectrum SportsNet). \n\n“It’s like climbing a mountain, sometimes you’re up, then you’re down, right, up and down,” he said. “That’s part of the game and something you have to learn once you become a professional. \n\n“All you can do is play good, you know, that’s my theme at the moment.” \n\nWild said he was in contact with two clubs in Europe before the Galaxy called, but he didn’t want to disclose them, instead focusing on his current situation. \n\n“Guillermo and the whole coaching staff want to play attacking and I think that suits my game very well,” Wild said. “How we play and what he expects from the wingers, everything is very attacking … they’re from Argentina, I worked with (former Atlanta United coach) Tata (Martino) and I also liked his philosophy, so it’s been a lot of fun and I like the way we’re playing. \n\n“It is a really good group of guys (in the locker room), everyone has a good vibe and wants to work for each other.” \n\n\n\nRolf Feltscher returned to the U.S. Wednesday evening. Feltscher was in Italy working to get his green card. … Efrain Alvarez had a boot on his left foot Thursday after suffering an injury in Wednesday’s scrimmage. … Emiliano Insua should be available for Saturday’s game. … Jonathan dos Santos and Daniel Steres moved their workouts to the training field with plans on joining the full training next week ahead of the season opener. \n  \n\t\t\t"},"18":{"tilte":"\n\t\t\tSparks trade Marina Mabrey to Dallas for 2021 draft pick\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/sparks-trade-marina-mabrey-to-dallas-for-2021-draft-pick\/","discription":"\nThe Los Angeles Sparks traded second-year guard Marina Mabrey to the Dallas Wings for a 2021 second round pick, the team announced today. She’ll team up with her friend and former Notre Dame teammate Arike Ogunbowale on the Wings. \n\n“These moves provide us with additional flexibility as we build a 2020 team that gives us the best chance to compete for a championship,” said Eric Holoman, the team’s managing partner and governor. \n\t\t\t\t\t\t\nThe Sparks now have a maximum 12 players on their roster, counting All-Star point guard Chelsea Gray, who is a restricted free agent. They tip off their 24th season May 16 on the road against the defending champion Washington Mystics, and open at home May 31 against the Connecticut Sun. \n\nThe Sparks drafted Mabrey, a fiery competitor out of Notre Dame, 19th in the second round of the 2019 draft. In her rookie season, she appeared in 31 games and averaged 4 points, 1.2 rebounds and 1 assists while shooting 34.4 percent from the floor. In her season in L.A., \nSince WNBA free agency began last week, the Sparks have been busy: They signed two-time WNBA champion Kristi Toliver from the Washington Mystics, four-time WNBA champion Seimone Augustus from the Minnesota Lynx and acquired guard Brittney Skyes and center Marie Gülich in a trade with the Atlanta Dream in exchange for second-year center Kalani Brown. \n\nThe Sparks also officially announced Friday they waived Alexis Jones, who since has been signed by the Atlanta Dream. \n\nSparks acquire 2021 Second Round Pick from Dallas in exchange for Marina Mabrey \n\n📰 » \n— Los Angeles Sparks (@LA_Sparks) \n\n\nBeen thinking about Kobe’s support of Sparks guard Marina Mabrey and her THIS IS MY KITCHEN basketball T-shirt line — which meant a lot to her, she said last summer. \n— Mirjam Swanson (@MirjamSwanson) \n\n"},"19":{"tilte":"\n\t\t\tWhicker: Trampler, Goodman are champs at boxing’s matchmaking game\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/20\/whicker-trampler-goodman-are-champs-at-boxings-matchmaking-game\/","discription":"\nLAS VEGAS >> Does your fighter have Michael Jackson’s feet? Does the heavy bag start bleeding when he hits it? Can you break 2-by-4s against his hard chin? \n\nPut his highlights on YouTube and send them to Top Rank, ℅ Bruce Trampler and Brad Goodman. \n\t\t\t\t\t\t\nThen, don’t call them. They’ll call you. \n\n“They’ll tell me their kid is the hardest-working guy in the gym,” Trampler said the other day, sitting next to Goodman in an MGM Grand ballroom. “That usually means he can’t fight.” \nTrampler and Goodman are the most respected matchmakers in boxing. They are also the Top Rank gatekeepers, strategists, wielders of reality. \n\nNearly every prominent fighter over the past 50 years has been with Top Rank. Oscar De La Hoya and Floyd Mayweather might leave, but Manny Pacquiao arrives, and when he leaves, Terence Crawford is there. \n\nCurrently Top Rank has Teofimo Lopez and Shakur Stevenson coming up, with pay-per-view riches in their sights, but it also has Crawford, Jose Ramirez and Vasyl Lomachenko. And it recently hired Tyson Fury, who goes for Deontay Wilder’s WBC heavyweight title on Saturday. \n\n“They come along in different ways,” Goodman said. “By Shakur’s fourth or fifth fight we knew he would be a champion. With a big promotional company, you need ability but also marketability. \n\n“Sometimes we have a prospect and we need to protect him early in his career. Then the fans rip the fight. It’s a no-win situation.” \n“The goal is to get them a title,” said Trampler, who \nTrampler and Goodman watch undercard fighters, guys in four-rounders fighting in bars, Golden Gloves hopefuls, Olympians, any pugilist anywhere on earth. They are a 2-man Boxipedia. \n\nBoth worked for Teddy Brenner, the acclaimed matchmaker at Madison Square Garden. He was a tough sell, too. \n\nGoodman remembers raving about a young Roberto Duran. Brenner quietly showed him film of Ike Williams, a former lightweight champion who was 126-24-4. “The guy was sensational, poetry in motion,” Goodman said. \n\n“Teddy did the same thing with me,” Trampler said. “He said Carlos Ortiz would kick Duran’s ass.” \n\nAfter a win by Pacquiao, Top Rank chief Bob Arum excitedly asked, “Brucester, isn’t he the best fighter you’ve ever seen?” \n\n“Bob,” Trampler replied, “he isn’t even the best welterweight you’ve ever promoted.” \n\nArum sputtered, but two days later he told Trampler he was right. \n\nTrampler says Ray Leonard was the last truly great fighter. But he and Goodman keep laboring, primarily because it’s love. \n\nTrampler saw his first fight in 1967: Joe Frazier vs. George Chuvalo in the old Garden. He went to Ohio University and interviewed Bill Douglas for the school paper. Bill’s son Buster upset Mike Tyson 23 years later. \n\n“Bill had a 5-2 record,” Tramplre said, “and no manager, so I managed him while I was in college. Then Chris and Angelo Dundee hired me out of college and I started doing their press releases.” \n\nGoodman was 15 when he began working for Brenner and publicist Irving Rudd. “I’d sit on the couch and listen to Teddy and Bruce, and I’d keep my mouth shut,” he said. \n\nSoon he’d tag along when fights came to Atlantic City, N.J. Eventually he moved west when Top Rank came to Vegas. \n\n“Bruce would absolutely destroy me,” Goodman said. “I was an East Coast guy and those were the fighters I know. I’d say, let’s put so-and-so on. He’d look at me like I was nuts. I had to educate myself on the Mexican fighters.” \n\n“We still yell at each other,” Trampler said. “He’ll come up with a fight and I’ll say, ‘That sucks.’ Then I’ll do the same thing and he says, ‘What are you, nuts?’’’ \n\nBut they have their favorites, like Earnie Shavers, who had 68 knockouts. Goodman skipped school to watch \n“Shavers gave me his shirt, which I still have,” Goodman said. “But when I came home, there were cops all around, My mom thought I’d been kidnapped. I got punished for that. Three months without watching boxing.” \n\nHe laughed. “The next Friday, I was watching boxing.” \n\nTrampler nodded. \n\n“You know, maybe four or five years before, I refereed Shavers against Leroy Caldwell in a little town in Ohio,” he said. \n\nYes. Newton Falls, in the high school gym, 1972. For Trampler and Goodman, there’s a big world in that small ring. \n  \n\t\t\t"},"20":{"tilte":"\n\t\t\tUSA Gymnastics asks Nassar survivors to release Steve Penny, USOPC, Karolyis, Don Peters from legal claims\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/usa-gymnastics-asks-nassar-survivors-to-release-steve-penny-usopc-karolyis-don-peters-from-legal-claims\/","discription":"\nSpeaking during a 2018 sentencing hearing for former U.S. Olympic and national team physician Larry Nassar, Rachael Denhollander, a former gymnast and Nassar survivor, asked “How much is a little girl worth?” \n\nAccording to a USA Gymnastics bankruptcy filing Friday night, it’s as little as $82,000. \n\t\t\t\t\t\t\nIn a disclosure statement filed with U.S. Bankruptcy Court for the Southern District of Indiana, USA Gymnastics said it is asking Nassar survivors to accept a settlement agreement that would pay $1.25 million to former Olympic and World Championships team members who were abused by Nassar but $82,550 to others. \n\nThe settlement agreement releases the U.S. Olympic and Paralympic Committee, former USA Gymnastics CEO Steve Penny and former national team directors Bela and Martha Karolyi from all claims but does not address the extent USA Gymnastics officials were aware of the predatory behavior of Nassar and others and to what steps, if any, they took to conceal that sexual abuse from unknowing potential victims. \nThe proposed $217-million settlement is part of a reorganization plan USA Gymnastics filed with the court earlier this year. USA Gymnastics filed for Chapter 11 protection in December 2018. \n\nThe 77-page filing states that if they approve the settlement agreement, the 517 Nassar survivors would agree to release “any and all claims arising from or related to Abuse Claims or Future Claims.” \n\nIn addition to the USOPC, Penny, the Karolyis and five Karolyi-related businesses, the settlement proposal also calls for the release of former U.S. Olympic team and SCATS coach Don Peters, 2012 Olympic coach John Geddert, former USA Gymnastics senior vice president Rhonda Faehn, former USA Gymnastics board chairman Paul Parilla, former USA Gymnastics president Bob Colarossi, former USA Gymnastics national teams manager Amy White, former USA Gymnastics sports medicine official Debra Van Horn and the All Olympia Gymnastics Center in Southern California. \n\n“USOPC is a beneficiary of the Settlement Election’s release and its injunctions,” according to the filing. \n\n“The only way the USOPC will agree to” the settlement “is if it is protected by the release and injunctions described” in the agreement. \nThe proposed settlement, an attorney for USA Gymnastics wrote in the filing, “is in the best interests of, and provides the highest and most expeditious recovery to, all parties who hold claims” against the organization. \n\nThe disclose statement outlines how the survivors would be broken up into four groups. Women who were sexually abused by Nassar at the Olympics, Worlds, national team training camps or other national team events would receive $1,250,757 each. Simone Biles, the four-time Olympic and 19-time World champion, and all five members of the record setting 2012 Olympic gold medal-winning team said they were abused by Nassar while they represented the U.S. at the Olympic Games, World Championships and other major international competitions as well as national team training camps at the Karolyi Ranch in Central Texas. \n\nNon-elite gymnasts sexually abused at USA Gymnastics-sanctioned events would receive $508,670 each. Individuals abused at non-USA Gymnastics locations would receive $174,401 each and individuals with “derivative claims” $82,550 each. \n\n“Let’s be clear for parents considering putting your child in a gym sanctioned by USA Gymnastics what USA Gymnastics is saying if we place a known pedophile in that gym and that individual rapes your child then your child is worth $82,000,” said John Manly, an attorney for dozens of Nassar survivors. “My client Rachael Denhollander asked what is a little girl worth. Apparently if you’re raped by the national team doctor you’re worth $82,000 to USA Gymnastics. \n\n“This is the most disgusting, reprehensible, vile view of children I can imagine. And for (USA Gymnastics) to put this out there and act like it is a constructive step shows how out of touch they are. Steve Penny was so bad USA Gymnastics banned him for life, the Karolyis, every one of them, and they pay nothing. They have no consequences. What message does that send to the next Steve Penny? The message is you get off scot free. You’re better off putting your kids in roller derby.” \n\n Under the heading “non-monetary commitments and reforms” USA Gymnastics states in the filing that “in addition to compensating survivors…USAG is committed to taking concrete action to address concerns that survivors and others have raised about the organization and its culture.” But neither the disclosure statement or a reorganization plan filed with the bankruptcy court last month make any mention of USA Gymnastics disclosing documents or information that would reveal the organization’s role and that of others in creating the culture of abuse within the sport that enabled Nassar’s abuse. \n\nUSA Gymnastics in the disclosure statement does assert that the organization has made “significant progress” in taking steps to prevent future abuse. The filing states that “one of the most significant changes USAG made during the case was its decision to hire Li Li Leung” as the organization’s CEO last year. \n\nLeung receives $450,000 in annual compensation and as much as $90,000 annual in bonuses, according to financial records and court filings. \n\nUSA Gymnastics is facing hundreds of lawsuits across the country that allege the organization and its top officials and coaches fostered a culture of abuse that enabled the predatory behavior of Nassar and other coaches and officials, and then, in consultation with U.S. Olympic and Paralympic Committee and FBI officials, attempted to conceal that sexual abuse from the public. \n\nUSA Gymnastics filed for protection under Chapter 11 in U.S. Bankruptcy for the Southern District of Indiana in December 2018. \n\nThat Chapter 11 filing prompted an automatic stay on all legal proceedings and litigation, including discovery, against USA Gymnastics, and the USOPC’s efforts to strip the organization of its national governing body status. \n\nThe USOPC has not said if it proceed with the decertification process, should a settlement be reached. \n\nThe proposal comes after months of talks between attorneys for USA Gymnastics and the hundreds of Nassar survivors have stalled with the two sides still hundreds of millions of dollars apart. It also follows a motion filed by attorneys for the survivors in January asking the bankruptcy court to dismiss USA Gymnastics’ bid for Chapter 11 protection. \n\n“USAG\/USOC, and its revolving door of executives since, have done everything in their collective power to conceal the truth from Nassar’s hundreds of survivors, the more than 100 survivors of abuse suffered at the hands of coaches over the past several decades, law enforcement authorities, and the American public,” James I. Stang, an attorney for a committee representing survivor wrote in the January filing. “The coordinated strategy of USAG and the USOC was, and remains to be, to delay, deflect and deny them and non-Nassar survivors justice for the horrible crimes committed upon them as children. Sadly, USAG and the USOC have used this bankruptcy proceeding as yet another tool to inflict pain upon these sexual abuse survivors – both Nassar and non-Nassar survivors – and to deny justice to these girls and women who competed for this institution and their country.” \n\nUnder the reorganization plan, USA Gymnastics proposes two options of for sexual abuse survivors: accept $215 million to settle all claims or continue to pursue judgments in civil suits from insurance policies available to the organization. \n\nIf the survivors vote to accept the settlement, the insurers for a Michigan gym owned by the family of former U.S. Olympic coach John Geddert would also contribute an additional $2.125 million to the settlement amount. Nassar routinely treated young athletes at the gym, Twistars, located near Lansing. \n\nUSA Gymnastics’ proposed settlement is less than half the $500 million settlement Michigan State reached with survivors of sexual abuse by Nassar, a former member of the Michigan State sports medicine staff. \n\nNassar is serving a 60-year federal prison sentence on child pornography charges. He was also sentenced in Ingham County, Michigan, last January to 40 to 175 years for child sexual assault and 40-125 years in Eaton County, Michigan, on similar charges in February. \n\nPenny was first informed of Nassar’s sexual abuse of U.S. national team member Maggie Nichols in June 2015. In the following weeks Penny was also informed that Olympic champions Aly Raisman and McKayla Maroney had also likely been sexually assaulted by Nassar. Yet Penny kept the abuse hidden from the public until September 2016, working with FBI agents in the bureau’s Indianapolis office, other USA Gymnastics officials and board members, as well as an attorney for the organization, according to documents obtained by the Southern California News Group. \n\nNassar, according to court documents, sexually abused at least 40 young athletes between Penny’s first contact with the FBI agent in charge of the bureau’s Indianapolis office in July 2015 and September 2016, when Nassar’s abuse became public. The number of victims in that window could actually surpass 100, according to persons familiar with dozens of Nassar-related lawsuits. \n\nNassar was allowed to retire as U.S. national team coach in September 2015 without he or USA Gymnastics describing the reason behind his departure. \n\nPenny was arrested in October 2018 after a Texas grand jury indicted him on felony evidence tampering charges. The indictment alleges Penny ordered the removal of documents from the Karolyi Ranch related to Nassar’s activities. \n\n“The indictment further alleges that the removal of the documents was done for the purpose of impairing the ongoing investigation by destroying or hiding the documents,” according to the Walker County, Texas District Attorney’s office. \n\nPenny was fired as USA Gymnastics CEO and president in March 2017 under pressure from the USOPC. He has denied any wrongdoing. \n\nFaehn, then USA Gymnastics senior vice president for its women’s program, was informed of concerns about Nassar’s procedures on June 17, 2015 by Sarah Jantzi, Maggie Nichols’ club coach. Jantzi told Faehn that Nichols described “three uncomfortable encounters of therapy with Nassar”  including massaging her groin area “too close to the vagina.” \n\nFaehn reported the call to Penny that day. It would be weeks, however, before Penny and other USA Gymnastics officials contacted the FBI about Nassar. Faehn was forced out at USA Gymnastics in May 2018. \n\n“Unbelievably painful… total disregard for the athletes that were used, abused, and now swept to the side!” John Nichols, Maggie’s father, wrote on twitter Friday night after the Orange County Register first posted details from the disclosure statement. \n\nWhite, the USA Gymnastics national teams manager, on Penny’s orders removed several boxes of medical records and other documents relevant to the Larry Nassar investigation from the Karolyi Ranch in November 2016, according to Faehn in a sworn deposition. \n\nFaehn said in the deposition that White in March confided to her that Penny called her and told her to remove records from the Karolyi Ranch and transport them to USA Gymnastics headquarters in Indianapolis. \n\nWhite told Faehn that after returning to the headquarters “she gave them to Steve Penny,” Faehn said referring to the medical records. \n\nPeters, the coach of the groundbreaking 1984 U.S. Olympic women’s team, was banned for life by USA Gymnastics in 2011 following a Register investigation that reported he had sex with three teenage gymnasts. \n\n  \n\n  \n\n  \n  \n\t\t\t"}}