{"1":{"tilte":"\n\t\t\tTeleperformance closing Burbank office; employees will work from home\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/teleperformance-closing-burbank-office-employees-will-work-from-home\/","discription":"\n will shutter its Burbank office next month, but the facility’s 140 employees won’t be out of work.\nInstead, they’ll be working from home.\nIn a letter sent to the state \nThe Worker Adjustment and Retraining Notification Act requires employers to provide 60 days advance written notice of a pending mass layoff or facility closure.\n“Specifically, the changes relate to how we will handle customer and client inquiries and where those inquiries will be answered,” Kerry E. Black, the company’s regional director of corporate human resources, wrote in the letter.\nThe Burbank office, at 111 N. 1st St., Suite 201, will close March 31, Black said, adding that the crew of all non-union employees will become work-at-home agents and still be employed by Teleperformance.\nThe letter includes a tally of the affected workers:\nTeleperformance specializes in outsourced customer service management, also known as business process outsourcing. The company provides customer acquisition, customer care, technical support, debt collection, social media and other services around the world.\nTeleperformance serves a variety of industries, including automotive, banking and financial services, healthcare, e-commerce retail, technology, telecom and media, travel, logistics and hospitality and utilities."},"2":{"tilte":"\n\t\t\tWells Fargo to pay $3B to resolve probes into fake accounts\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/wells-fargo-to-pay-3b-to-resolve-probes-into-fake-accounts\/","discription":"\nWells Fargo agreed Friday to pay $3 billion to settle criminal and civil investigations into a long-running practice whereby company employees opened millions of unauthorized bank accounts in order to meet unrealistic sales goals.\nSince the fake-accounts scandal came to light in 2016, Wells has paid out billions in fines to state and federal regulators, reshuffled its board of directors and seen two CEOs and other top-level executives leave the company.\nThe $3 billion payment includes a $500 million civil payment to the Securities and Exchange Commission, which will distribute those funds to investors who were impacted by Wells’ behavior.\nBefore the scandal broke, Wells Fargo was considered to have a sterling reputation among the big banks. The bank referred to its branches as “stores,” and once had a policy of trying to get each Wells Fargo customer to have eight financial products with the company\nWells’ sales policies, pushed by top management, were aggressive and unrealistic. Bank employees were berated for not making bloated sales quotas, which ultimately resulted in many employees gaming Wells Fargo’s sales system in order to meet these artificial sales goals. For example a number of Wells Fargo customers, notably the elderly, were signed up for online banking when they did not have Internet access.\n“Simply put, Wells Fargo traded its hard-earned reputation for short-term profits, and harmed untold numbers of customers along the way,” said U.S. Attorney Nick Hanna for the Central District of California, in a prepared statement."},"3":{"tilte":"\n\t\t\tNo tickets for Monday’s Kobe memorial? Stay clear of Staples, officials say\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/no-tickets-for-mondays-kobe-memorial-stay-clear-of-staples-officials-say\/","discription":"\nOrganizers of Monday’s memorial ceremony for Laker legend Kobe Bryant and his daughter Gianna, who both died in a Calabasas helicopter crash, on Friday, Feb. 21 urged people without tickets to the Staples Center gathering to stay away from the area. \n\n“We hope that everybody heeds the message and they stay either in their offices, surrounded by their friends or at home with their family or loved ones, because it’s going to be a very emotional memorial for that day and we want people to be able to enjoy it,” Staples Center President Lee Zeidman told reporters outside the venue. \n\t\t\t\t\t\t\n\n\nZeidman and Los Angeles Police Department Chief Michel Moore again stressed that the ceremony will not be broadcast on any of the outdoor screens at Staples Center or in the adjacent L.A. Live plaza. \n“This is, to be clear, a ticketed worldwide event at this location,” Moore said. “And what that means is, if you don’t have tickets and credentials, you will not be allowed into this venue. … The point there is, do not impact the rest of the Los Angeles downtown community by trying to come here and be part of something that you’ll not be a part of.” \n\nMoore and Zeidman said they do not anticipate issues of people trying to “crash” the event or cause a disturbance, with both saying the community has shown the utmost respect in the weeks following the Jan. 26 helicopter crash that killed Bryant, 41, Gianna, 13, and seven other people. \n\nZeidman noted that as many as 350,000 people visited a massive memorial that grew outside Staples Center in the days after the crash, without any incidents. \n\nMajor streets — such as Pico and Olympic boulevards — near the arena will remain open, but smaller streets outside Staples Center and L.A. Live will be blocked off and accessible only to people with tickets. \n\nMonday’s ceremony will begin at 10 a.m. Zeidman said he had no details about how many tickets were purchased by fans, but 20,000 seats were made available in the arena. He said doors to Staples Center will open at 8 a.m., and he urged everyone with tickets to be in their seats by 9:45 a.m. \nZeidman also said he had no information on who will be speaking at the memorial. \n\n“Right now, it’s a very fluid situation,” he said. “The family and the Los Angeles Lakers are reaching out to people that would like to be part of this. We have no insight to exactly what they’re going to do, outside of we know that we’re going to have 20,000 seats in that building ready to do whatever they want to do from a sound, LED or memorial standpoint.” \n\nTicket prices for the memorial ranged from $24.02 to $224. The ticket prices, along with the date of the event, are all in recognition of Bryant’s jersey number, 24, and Gianna’s number 2. \n\nAll proceeds from the ticket sales will be donated to the Mamba and Mambacita Sports Foundation. \n\nThe tickets are non-transferable, meaning anyone entering the arena must enter with the purchaser of the tickets. \n  \n\t\t\t"},"4":{"tilte":"\n\t\t\tNew bill would cap mobile home rent hikes statewide\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/new-bill-would-cap-mobile-home-rent-hikes-statewide\/","discription":"\nCalifornia legislators passed a law last year that limited rent increases for tenants in buildings at least 15 years old.\nBut the measure, AB 1482, did not include mobile homes, allowing park owners to raise space rent as much as they want.\nA new bill unveiled Friday, Feb. 21, would change that.\nAssemblymember Sharon Quirk-Silva, D-Fullerton, unveiled a plan to place rent caps on all California mobile homes. Patterned after AB 1482, the bill would limit future increases to 5% a year plus the cost of living, up to a maximum of 10% a year. Landlords also would be prohibited from raising mobile home rents more than two times a year.\nThe bill would apply both to Californians who rent a mobile home and those who own their own mobile home and rent the land it sits on.\nHomes in the Anaheim section of the Rancho La Paz Mobile Home Park in Anaheim, CA, on Tuesday, March 19, 2019. Residents in the park, which straddles Anaheim and Fullerton, are concerned about steep increases in their rent. (Photo by Jeff Gritchen, Orange County Register\/SCNG)\n\nHomes in the Fullerton section of the Rancho La Paz Mobile Home Park in Fullerton, CA, on Tuesday, March 19, 2019. Residents in the park, which straddles Anaheim and Fullerton, are concerned about steep increases in their rent. (Photo by Jeff Gritchen, Orange County Register\/SCNG)\n\nThe community pool at Rancho La Paz Mobile Home Park in Anaheim, CA, on Tuesday, March 19, 2019. Residents in the park, which straddles Anaheim and Fullerton, are concerned about steep increases in their rent. (Photo by Jeff Gritchen, Orange County Register\/SCNG)\n\nLupe Ramirez, right, led a group of residents in the Rancho La Paz mobile home park to fight significant rent hikes proposed by the park’s new owner. The owner is still increasing the park’s rents, albeit now over time, and the residents also encouraged Fullerton and Anaheim to offer a rent assistance program for seniors. (File Photo by Jeff Gritchen, Orange County Register\/SCNG)\n\nResidents of the Rancho La Paz Mobile Home Park attend a press conference unveiling a new bill to extend rent caps to mobile home tenants statewide. (Photo by Jeff Collins, Orange County Register\/SCNG)\n\nSpeaking at a press conference outside Fullerton City Hall Friday morning, Quirk-Silva said rent protections provided last year to people living in apartments and other rentals need to be extended to those living in mobile homes.\n“Just as (apartment) rents have dramatically increased, mobile-home owners are also faced with drastic rent increases,” a statement from Quirk-Silva’s office said.\nUnlike tenants who rent an apartment or a house, however, those living in mobile homes can’t easily move when their rent becomes unaffordable, Quirk-Silva added at Friday’s press conference.\n“The reality of these is many are built on a foundation,” she said. “And even if they could be moved, where would they move them to (with) rent increasing every day?”\nQuirk-Silva said many residents are one paycheck away from poverty or homelessness.\n“We know that any increases for some members of our community, specifically those who are on a fixed income, can be the next step for them not being able to stay in their home,” she said.\nThe press conference was attended by about 15 residents of the Rancho La Paz Mobile Home Park, a property in Fullerton and Anaheim that faced big rent increases after it changed hands. The new owner reduced the rent hikes and spread them out over time after negotiations with residents, but tenants say the increases eventually will force them out of their homes.\nFor example, rents are set to rise by more than 50% over the next three years.\n“We needed this bill. … A third of our park will probably be homeless after that third increase because there’s no way somebody on a fixed income can come up with this amount of money,” said Lupe Ramirez, head of the Rancho La Paz residents association. “We didn’t get the huge increase, but we still got substantial increases that are not sustainable by our people.”"},"5":{"tilte":"\n\t\t\tCostco changes its food court policy: You gotta be a member\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/costcos-changes-its-food-court-policy-you-gotta-be-a-member\/","discription":"\nShoppers who enjoy cheap hot dogs, churros and pizza from \nShoppers who are not members of the warehouse club have long enjoyed its food offerings — particularly the hot dog\/soda combo for $1.50 and the $1 churros. But beginning in March, the big-box retailer will require an active membership to visit the food court, according to multiple media reports.\nCostco couldn’t be reached to elaborate on the policy, but comments on social media indicate the change won’t immediately go into effect at all company stores and may be rolled out in stages.\nA photo on Instagram shows a sign in front of a Costco store that reads, “Effective March 16, 2020, an active Costco membership card will be required to purchase items from our food court.”\nThe sign encourages shoppers to “please see our membership counter for details.”\nBuying items from the food court has technically required a membership, but the policy has not been strictly enforced, the company said. With many of its food courts outdoors, it was easy for non-members to walk up and buy the inexpensive food without showing a membership card.\nThe pending change has elicited a wide range of comments.\n“Costco, ur starting to suck,” one Instagram follower posted.\n“Of course you should have a membership,” another posted. “Good for you, Costco!”\nA third Instagram follower offered yet another perspective:\n“In our area, our homeless depend on your fast food …” the message said."},"6":{"tilte":"\n\t\t\tLeave your emotions at the doormat, this home needs to sell\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/22\/leave-your-emotions-at-the-doormat-this-home-needs-to-sell\/","discription":"\nPreparing to sell your house begins with getting your house ready to market it, and for some, this concept is difficult to grasp.\nThere are so many memories, milestones and emotions tied up in the place where you live. You’ll have greater success selling the home if you can flip the mental switch, disconnecting from those emotional attachments to “home sweet home.” Instead, view it as a commodity to be marketed to as many consumers as possible.\nKeep in mind, you’re not preparing for company, family or a birthday party. You’re getting ready to announce to the world that your most valuable asset, in most cases, is available for someone else. You’re not inviting friends and family over to see your pretty things; you’re luring buyers over to see all the features your house has to offer. This is a crucial concept for home seller success.\nWhen you can make the switch from homeowner to house seller, you begin with an advantage. When you make the decision to declutter, update, redecorate, rearrange, repaint, repurpose and stage your house and have well lit, balanced, wide-angle photographs showing the result of all your hard work posted on the Internet, you will attract more screen time and more foot traffic.\nNearly all homebuyers today begin their search on a smartphone, tablet, laptop or home computer. When your house shows up looking clean, bright, devoid of the distractions and the rooms convey design, purpose and features, you are much more likely to grab your audience’s attention.\nMind you, the photos cannot lie about your commodity. The photos cannot do the heavy lifting of getting your house ready for the market. The photos can only promote what you actually have to offer in the best form possible.\nYou flip the switch from homeowner to house seller and do the work to get ready for the photos in order to attract qualified buyers to come see the house in person and like it so much they will write you an offer.\nOn the flip side, when you fail to switch to house seller, you put yourself at a disadvantage. Impediments instead are in the buyer’s path. If the photos don’t look attractive, buyers have to spend a lot of energy imagining what your house really looks like, what it might look like without all of your stuff, with different stuff or with their stuff.\nThose house hunters are more likely to put your house on the “maybe” list rather than on the “must-see” list.   Regardless of how well lit the photos are."},"7":{"tilte":"\n\t\t\tGet a $43 raise? That’s the average in Southern California\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/get-a-43-raise-thats-the-average-in-southern-california\/","discription":"\nSouthern California pay raises and job growth slightly exceeded the national pace in the third quarter, a new government report shows.\nMy trusty spreadsheet tells me that private and government employers in Los Angeles, Orange, San Bernardino and Riverside counties paid an average weekly wage of $1,157 — up 3.8% or $43 in a year, according to a quarterly study of employers’ unemployment insurance records.\nNationally, average pay rose $38 or 3.6% over 12 months to $1,093 a week. Wages rose in 283 of 355 large U.S. counties studied.\nThe four counties had 7.67 million workers in the quarter, up 93,100 jobs in a year, a 1.2% gain. Nationally, jobs grew at a 1.1% pace with gain found in all but five large counties. The Southern California region accounted for one in 17 of all new U.S. jobs created.\nHere is how this job tally breaks down by county and how the local counties compare with the large U.S. counties tracked in this study …\n $1,225 weekly wages, up $44 or 3.7% in a year. Pay ranked No. 50 of the 355 U.S. counties; raises ranked No. 151 nationally. Jobs grew 44,500 to 4.50 million. That’s 1% growth, No. 171 nationally.\n $1,204 weekly, up $50 or 4.3% in a year. Pay was No. 55 of 355; raises No. 85 nationally. Jobs grew 17,900 to 1.65 million. That’s 1.1% growth, No. 153 nationally.\n $881 weekly, up $35 or 4.1% in a year. Pay was No. 294 of 355; raises No. 103 nationally. Jobs grew 17,700 to 756,000 That’s 2.4% growth, No. 51 nationally.\n $927 weekly, up $35 or 3.9% in a year. Pay was No. 236 of 355; raises No. 122 nationally. Jobs grew 12,900 to 769,900 That’s 1.7% growth, No. 93 nationally."},"8":{"tilte":"\n\t\t\tNewsom calls out almost every Californian for being a NIMBY\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/21\/newsom-calls-out-all-californians-for-being-nimbys\/","discription":"\nGive Gov. Gavin Newsom credit for his lengthy list of culprits in California’s homelessness problem.\n basically stated that almost every Californian is a NIMBY.\nThe speech detailed, directly or indirectly, a roster of forces that, at best, did little to help the housing crunch. Folks who are rich or poor, urban or suburban. Homeowners and renters. Landlords, too. Not to mention decades of policymakers from his political party and the other one, too.\nAnd he’s 100% correct in tying inaction to self-interest. It’s a natural defense mechanism against change in all situations, especially when an issue like housing puts literally trillions of dollars of wealth at stake.\n“Time and time again, bigger, bolder reform hasn’t happened — in part because of some legitimate concerns,” \n“Many of our lowest-income residents understandably worry about being pushed out of their own communities because of gentrification. Middle-class homeowners worry that their single-family home could lose its value — a scary prospect given a house is often a family’s biggest asset.\n“These real concerns should not be brushed aside. At the same time, we also know the status quo is simply unacceptable — we aren’t building enough housing.”\nShaming inaction is a laudable tactic. But one often unspoken challenge is that the status quo is EXACTLY what a chunk of the real estate industry wants.\nNewsom says sacrifices are needed from the homeowner who’s bet their life savings on a California home. He suggests the same from the tenement-dweller who accepts their dumpy rental because there’s no better option and they live one layoff or medical bill away from homelessness.\nBut what about the real estate industry?\nCalifornia is one of the nation’s most-profitable places to build a home, sell or finance one or own an apartment complex. That’s due, in part, to the modest supply of housing available in the state’s growing economy.\nDo you expect the industry to willingly give up that profitable perch?\nNewsom and many others suggest the supply slice of the homelessness challenge is simple economics, more homes equal lower costs. But similar economic pressures suggest the state’s real estate world will protect its turf in a very NIMBY way.\nIt’s not just your typical Californian who doesn’t want the homeless shelter or “affordable” housing down the block. The portfolios of big landlords and major landowners may be harmed as well.\nOr you hear of industry calls for “help” to make lower-priced home construction “profitable.”\nLet’s look at last year’s \nNewsom called for greater “accountability” in the housing challenges. What about this industry error?\nThe industry is good at seeking “help” from the government. Requests to loosen environmental constraints and ease regulatory approvals have merit. But what of industry demands for lowering “fees” charged in the process?\nMany of these much-debated development fees are attempts by local governments to recoup infrastructure costs associated with new communities — schools, sewers, roads, first responders, etc. And some reasonable proposals have been floated to find state money to help lower these fees, which often are pushed all the way to the price the eventual buyer pays.\nIt’s a win-win if future cuts in developer fees equal homebuyer savings and not greater profits for homebuilders.\nAnd it’s not just new construction.\nWhat about the unnecessary complexity, not to mention the costs, of actually acquiring a home, new or used, or renting one. While we consider retooling state laws to make construction easier, what about regulations that could ease the acquisition and financing of housing, not to mention open up the transactions’ field to new entrants in order to boost competition?\nIf California wants to really fix this problem, all stakeholders must accept change for the greater good. That includes the real estate industry."},"9":{"tilte":"\n\t\t\t80 people lose jobs as Uber closes DTLA office, outsources work\t\t","link":"https:\/\/www.dailynews.com\/2020\/02\/19\/80-people-lose-jobs-as-uber-closes-dtla-office-outsources-work\/","discription":"\nAbout 80 employees lost their jobs without notice when Uber recently closed its downtown Los Angeles customer support office, according to a report published today.\nEmployees were told Thursday that it was their last day, as Uber was closing its Los Angeles office and shifting those jobs to a large customer support office in Manila, Philippines, \n“I know that this is a shock. This meeting is to inform you all that today is the last day in this office,” Uber manager Ruffin Chevaleau said to employees Thursday, according to the Times, which obtained a recording of the meeting.\nWorkers at the Santa Monica Uber office were not affected by the layoffs, the Times reported.\nMost of the employees in the Los Angeles office were paid hourly and “focused on driver outreach, with tasks such as processing documents, resolving account issues and explaining incentives and promotions,” The Times reported. They were told they will receive severance packages and could apply for other jobs at Uber.\nUber has laid off more than 1,000 workers since going public in May 2019, according to The Times.\nUber was not immediately available for comment."}}