{"_id": "5ec956f55019da268c469ee2", "img_description": "F. No. 4/9/ 2019/DP-2\n\nee\nS22 MINISTRY OF DEFENCE PRODUCTION\n\nSITUATION VACANT\n\nApplications from Pakistani National are invited to fil up the following vacancies in the\n\nfee ¢\n\n \n\nMinistry of Defence Production, Pak Sectt- I, Adam Jee Road, Rawalpindi. The scales of pay,\nqualification and age limit etc. prescribed for the posts are as under:-\n\n    \n   \n\n \n\n \n\nMerit i), Intermediate\n\n  \n    \n\n  \n\n \n\n  \n\n \n\nStenotypist 04 |18-25| (Minories) 1 i). Minimum speed of 80/40 w.p.m in\nPunjabd-3 Shorthand Typing respectively.\ni), Mustbe computer iterate\n\n: oeoa |i Matric\n2 01 |18:25)Mert- |i). Minimum Typing speed of 30 wpm\n3 | Store Heiper 01 |18-25/ Local Primary Pass\n4 | Nai Gasid 01 _|1825/Civilan _| Primary Pass\n5 | Khakroob [BPS.01] 01 _[18-25/Local___| Primary Pass\n2. Applications on the prescribed format for post of Stenotypist (BPS-14), LDC (BPS-\n\n09) be sent directly to Candidate Testing Service (CTS), Office No. 6, 3rd Floor,\nUnited Plaza, 96-E, Blue Area, Islamabad within 15 days of publication of this\nadvertisement. Form can be downloaded from their website www.cts.org.pk. An\namount of Rs. 65/- will be deposited against the CTS AIC No. 0807641201007160\nMCB Ltd, Super Market Branch, F-6 Islamabad (1028) through challan (which can\nbe downloaded from CTS website). No need to attach copies of documents.\nCandidates already in government service must apply through proper channel failing\nWhich they will not be considered for recruitment.\n\nApplications for the post of BPS-1 (Store Helper, Naib Qasid and Khakroob) should\nreach the undersigned within 15 days of the publication of the advertisement. No\nneed to attach copies of documents. Application form can be downloaded from the\nwebsite jodp.gov.pk.\n\nApplications will be accepted only on prescribed applications form of CTS/MoDP.\nMaximum age limits shall be relaxable for five years in all cases, in addition to the age\nrelaxation admissible under (Relaxation of Upper Age Limit) Rules, 1993.\nApplications received after due date will not be considered.\n\nMale and Female are eligible.\n\nNo TA/DAwill be admissible for testinterview.\n\nMuhammad Ali\nDeputy Secretary (Admin)\nMinistry of Defence Production\nLes Cra OR RECON come C UCLA ROrcULUd"}