{"_id": "5ec956f55019da268c469ee4", "img_description": "‘ Govennmert of Pakistan >\n“<, Pakistan National Council of the Arts\nnational Hisrony & Lirenany Henirage Division s\nvbr ‘\n\noS JOB OPPORTUNITIES\n\n‘Applications are invited for the following vacant postions in Pakistan National Council of the Arts from Pakistani Nationals purely\n(on contract basis fora periadof two years fuffiling the criteria and requirements:\n\n \n\nPost Qualification Experience\n\n \n\nProgramme Exocutve!\nSupervisor (NPAG), Karachi (BPS-17)\n\nMaster's degree with one year experience in the relevant field OP,\n| graduation wins years experience in he relevant ec\n\n \n\n‘Senior Consultantxpert\n\n \n\n2. | uct & Aout) 1 | Merit | Master's degree in relevant Selo wit 10 years experience.\n\"Senior PhotographeriCameraman [Masters degree with one year experience in the relevant fed OR\n\n3.| @esin 1 |Meat | Graduate nih yarsexperance no raerant tad\n\n4, | esearch Ontcer (8°S-17) ‘01 | Mer | Master's Gegree with one year experience in the relevant fekd OR\n\n| graduate wih years expertenceinthe relevant fet\n\n‘Graduation inthe relevant field OR three years diploma course from\n5, | Photographer (8°5-16) 01. | Merit | Nafonal College of Ans, Polytechnic insite! Colege of Technology\nwif thee years experience nthe relevant aid\n\n \n\n \n\n \n\n \n\n \n\n«| Caeser ‘or |Met | RA, Junior Commissioned Offcer’ Intermediate wih 10 years\n\n(516) exoerence\n\nProp Assistant Graduate OR Inlermacate with 3 years experiance in the reevant\n7.| ee ot | Mert | Gd\n\nincharge Up Diploma of Assocale Engneer in elecrcal engineering with 3 years\n8 | essay) 01 | Mest | experience invlevane io “swans\n\n \n\nal Pecoon i; | Matters degree with one year experience in the relevant Bld or\n| he poet) 92 [Men ‘graduation with 5 years expenence in the relevant hed,\n\nMavic pass having valid onnse with 5 years experience of ering\n1 [toca light vehicies/ motor cycle.\n\nDispatch Rider\n(8PS-4)\n\n \n\n \n\n \n\n \n\n \n\nConditions of Eligibility:\n\nGovernment sorvants should submit their applications through thor respective departments\n\nOnly shoristed candidate shal becaledforinterview\n\nNoTAIDA willbe paid or appearance inthe test/nteriew\n\nWomen are encouragedto apply\n\n‘Allrecrutmentfor the above-mentioned posts willbe made as perrecrutment policy tthe Federal Government.\nPease send application attaching CV & relevant documents within 15 days ofpublishing this advertisement.\n\n \n\nMuhammad Ayoub Jamal\nitr Cmte) F\n\nee | Council of the Arts, Plot Ni\nEmail: pncoaisb@gmail.com\n\n \n\nPID (1) 5250/19"}